[
    {
      "id": 1,
      "name": "Bentota River Safari",
      "offer": "2000 to 6000 LKR Off",
      "image": "https://imagine.lk/content_images/772360437921620.jpg",
      "description": "Save between 2000 to 6000 LKR on a Bentota River Safari. Explore lush mangroves and spot diverse wildlife with Less Taxi’s trusted service.",
      "moreDetails": "Immerse yourself in the serene beauty and vibrant biodiversity of the Bentota River with a thrilling safari experience, now available at an incredible discount of up to 6000 LKR. Brought to you by Less Taxi, Sri Lanka’s most trusted and highest-rated transportation provider on TripAdvisor, this safari promises an unforgettable journey through lush mangroves and along tranquil waters. As you navigate the river, our knowledgeable guides will introduce you to the rich array of wildlife that inhabits this unique ecosystem, including a variety of bird species, monitor lizards, and perhaps even the elusive crocodile. This is not just a boat ride; it’s a deeply immersive experience that connects you with nature and offers unparalleled opportunities for wildlife photography. Whether you’re a nature lover, a photographer, or simply seeking a peaceful retreat, the Bentota River Safari is the perfect escape."
    },

    {
      "id": 2,
      "name": "Free SIM Card at Airport",
      "offer": "FREE SIM Card (Worth 2500 LKR)",
      "image": "https://app.lesstaxi.com/_next/image?url=https%3A%2F%2Flesstaxi-cus-app-operations.sfo3.cdn.digitaloceanspaces.com%2Fprod%2Fuploads%2Fthumbnails%2Ffree%20sim%20card%20at%20colombo%20airport%20with%20less%20taxi%20(5)%20copy-1724321934214-430px.jpg&w=750&q=75",
      "description": "Get a free SIM card at the airport, including 30GB and unlimited local calls for 30 days or 15GB and unlimited calls for 7 days. Stay connected with Less Taxi’s top-rated service.",
      "moreDetails": "Begin your journey in Sri Lanka with seamless connectivity, courtesy of Less Taxi, the highest-rated transportation provider on TripAdvisor. We understand the importance of staying connected while you explore a new destination, and as a gesture of our commitment to your comfort and convenience, we are offering a free SIM card upon your arrival at the airport. This exclusive offer includes a choice between two substantial data packages: 30GB of data with unlimited local calls for 30 days, or 15GB of data with unlimited local calls for 7 days. Whether you're navigating your way through bustling cities, sharing your experiences with loved ones, or staying in touch with local guides, this SIM card ensures you’re always connected. Our top priority is to enhance your travel experience with our exceptional service, known for reliability and customer satisfaction."
    },

    {
      "id": 3,
      "name": "Yala Safari Jeep",
      "offer": "2000LKR to 4000LKR off",
      "image": "https://ravantangalle.com/wp-content/uploads/2018/06/yala-slider1-1.jpg",
      "description": "Save up to 4000 LKR on a Yala Safari Jeep tour. Choose from morning, extended morning, or full-day safaris to explore Yala’s diverse wildlife.",
      "moreDetails": "Embark on an exhilarating journey through Yala National Park, a sanctuary teeming with wildlife and natural beauty, with up to 4000 LKR off on our exclusive safari jeep tours. Yala is renowned for its dense population of leopards, elephants, and diverse bird species, making it one of the most sought-after safari destinations in Sri Lanka. With Less Taxi, the top-rated transport service on TripAdvisor, you can choose from a variety of safari experiences that cater to different preferences and schedules—whether it’s a morning or afternoon safari, an extended morning adventure, or a full-day exploration. Each option offers a unique glimpse into the wild, where you’ll have the chance to witness these majestic creatures in their natural habitat. Our skilled guides are passionate about wildlife and committed to providing you with an informative and unforgettable experience. As you traverse the park, you'll also learn about the conservation efforts that protect these animals and their environment. This is more than just a safari; it’s an opportunity to connect with nature in one of the most pristine settings in the world."
    },

    {
      "id": 4,
      "name": "Hurulu Eco Safari Jeep– Explore the Rich Biodiversity",
      "offer": "2000 LKR Off",
      "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1a/5e/07/6a/caption.jpg?w=500&h=400&s=1",
      "description": "Get 2000 LKR off a Hurulu Eco Safari Jeep tour. Discover the park’s diverse flora and fauna with Less Taxi’s highly rated service.",
      "moreDetails": "Dive deep into the heart of Sri Lanka’s wilderness with a 2000 LKR discount on our Hurulu Eco Safari Jeep tour, offered exclusively by Less Taxi, the leading name in transportation and safari experiences as rated on TripAdvisor. Hurulu Eco Park, located in the cultural triangle of Sri Lanka, is a hidden gem that boasts a rich tapestry of flora and fauna, making it an ideal destination for nature enthusiasts and wildlife photographers alike. As you journey through the park in a comfortable jeep, guided by our expert naturalists, you’ll encounter a variety of wildlife, including elephants, spotted deer, and an impressive array of bird species. The park’s diverse ecosystems, from dense forests to open grasslands, offer a stunning backdrop for your adventure, providing ample opportunities to observe and photograph wildlife in their natural habitats. This eco-friendly safari not only brings you closer to nature but also raises awareness about the importance of conservation efforts in preserving Sri Lanka’s rich biodiversity. By choosing Less Taxi, you’re not just booking a safari; you’re supporting sustainable tourism and contributing to the protection of these precious ecosystems."
    },

    {
      "id": 5,
      "name": "Kandy City Half-Day Tour – Explore the Heart of Kandy",
      "offer": "2000 LKR Off",
      "image": "https://duqjpivknq39s.cloudfront.net/2018/12/800x750-21.jpg",
      "description": "Save 2000 LKR on a half-day city tour of Kandy. Discover key attractions and cultural highlights with Less Taxi’s trusted service.",
      "moreDetails": "Unearth the cultural treasures of Kandy, one of Sri Lanka’s most historic and vibrant cities, with a 2000 LKR discount on our half-day city tour. Offered by Less Taxi, the #1 rated transportation provider on TripAdvisor, this tour is a deep dive into the rich heritage and spiritual heart of the country. Kandy, a UNESCO World Heritage Site, is home to the iconic Temple of the Sacred Tooth Relic, one of the most revered Buddhist sites in the world. Your journey begins with a visit to this magnificent temple, where you’ll witness intricate architecture and learn about the centuries-old traditions that continue to thrive here. The tour also includes a leisurely stroll around Kandy Lake, a picturesque centerpiece of the city, surrounded by lush greenery and offering serene views. As you explore further, you’ll visit local markets bustling with activity, where you can experience the vibrant culture and perhaps purchase some unique souvenirs. This tour is not just about sightseeing; it’s an opportunity to connect with the history and culture of Sri Lanka, guided by experts who are passionate about sharing their knowledge."
    },
    
    {
      "id": 6,
      "name": "Kandy Full-Day Tour with Pinnawala – Dive Deep into Sri Lanka’s Culture",
      "offer": "4000 LKR Off (includes Pinnawala)",
      "image": "https://i0.wp.com/www.urlaub-sr-lanka.info/img/2022/09/Purple-and-Yellow-Travel-Tri-fold-Brochure-1-800x618.jpg?resize=800%2C618&ssl=1",
      "description": "Save 4000 LKR on a full-day city tour of Kandy, including a visit to Pinnawala. Explore Kandy’s top attractions with Less Taxi’s highly rated service.",
      "moreDetails": "Discover the rich cultural heritage of Sri Lanka with a comprehensive full-day city tour of Kandy, including an unforgettable visit to the Pinnawala Elephant Orphanage, all at a discounted rate of 4000 LKR. This tour, provided by Less Taxi—the highest-rated service on TripAdvisor—is designed to immerse you in the heart of Sri Lanka’s historic and spiritual center. Your day begins with a visit to the Temple of the Sacred Tooth Relic, where you’ll experience the profound spirituality of this UNESCO World Heritage Site. Next, take a peaceful stroll around Kandy Lake, enjoy the vibrant atmosphere of the local markets, and explore the beautifully manicured Peradeniya Botanical Gardens, where you’ll encounter a vast array of tropical flora. The highlight of your tour will be the Pinnawala Elephant Orphanage, where you’ll have the chance to observe these gentle giants in a sanctuary setting, learning about the conservation efforts that protect them. This full-day tour is more than just a sightseeing trip; it’s a journey into the soul of Sri Lanka, where history, culture, and natural beauty come together."
    },


    {
      "id": 7,
      "name": "Udawalawa Safari – Exclusive Private Jeep Adventure",
      "offer": "2000 LKR Off (up to 6 passengers, private jeep)",
      "image": "https://www.holidaylankatours.com/x/cdn/?https://storage.googleapis.com/production-sitelio-v1-0-7/187/54187/zAc7Unhz/ef1ca7eb9d264332bc23efdc5ebd1334",
      "description": "Save 2000 LKR on a private jeep safari in Udawalawa. Explore the park’s diverse wildlife with Less Taxi’s top-rated service.",
      "moreDetails": "Step into the wild and explore the untamed beauty of Udawalawa National Park with a 2000 LKR discount on our exclusive private jeep safari, available for up to 6 passengers. Offered by Less Taxi, the top-rated transportation service on TripAdvisor, this safari provides an intimate and personalized experience, allowing you to immerse yourself fully in the natural splendor of the park. Udawalawa is famous for its large herds of elephants, but it also offers sightings of a variety of other wildlife, including water buffalo, deer, and an impressive array of bird species. As you traverse the park’s diverse landscapes—from lush forests to open grasslands—our experienced guides will share their deep knowledge of the area’s ecology, wildlife behavior, and the ongoing conservation efforts that protect this precious environment. This private safari is perfect for families, small groups, or anyone seeking a more exclusive and tailored wildlife experience. The comfort of a private jeep ensures you can explore at your own pace, stopping whenever you wish to observe the animals or capture the perfect photograph."
    },


    {
      "id": 8,
      "name": "Ella TukTuk Tour – Discover the Hidden Gems of Ella",
      "offer": "1200 LKR Off",
      "image": "https://cdn.getyourguide.com/img/tour/620ba079b1501.jpeg/98.jpg",
      "description": "Save 1200 LKR on an Ella TukTuk Tour. Visit Little Adam’s Peak, 9 Arches Bridge, Ravana Falls, and more with Less Taxi’s top-rated service.",
      "moreDetails": "Embark on a unique adventure through the scenic town of Ella with a 1200 LKR discount on our TukTuk Tour, exclusively offered by Less Taxi—the most trusted name in transportation services as rated on TripAdvisor. This tour is your gateway to discovering the hidden gems of Ella, a town renowned for its breathtaking landscapes and rich history. Hop aboard a TukTuk, the quintessential Sri Lankan mode of transport, and let our experienced guides lead you on an exploration of Ella’s most iconic attractions. Your journey begins with a visit to Little Adam’s Peak, where a short hike rewards you with panoramic views of the surrounding hills and valleys. Next, we’ll take you to the famous 9 Arches Bridge, an architectural marvel nestled in the lush jungle, offering a picture-perfect setting. The tour continues to Ravana Falls, a majestic waterfall steeped in local legend, where you can cool off in the refreshing waters or simply admire the natural beauty. Additionally, you’ll have the option to visit a traditional tea plantation, where you can learn about Sri Lanka’s rich tea heritage and even sample some of the finest Ceylon tea. This tour is more than just a sightseeing excursion; it’s an authentic experience that connects you with the heart and soul of Ella."
    }
    
  ]
  