
  [
    {
      "id": 1,
      "name": "Amaya Lake Dambulla",
      "location": "Dambulla",
      "rating": 4.5,
      "image": "https://www.bestoflanka.com/images/slider/recommended-stays-sri-lanka/stay-in-the-cultural-triangle-sri-lanka/amaya_lake/01.jpg",
      "details": "Amaya Lake Dambulla is a luxurious resort nestled on the shores of Kandalama Lake, located in the cultural triangle of Sri Lanka near Dambulla. Surrounded by lush greenery and a peaceful environment, the resort offers an immersive nature retreat while providing easy access to nearby historical sites like Sigiriya and Dambulla Cave Temple.",
      "rooms": [
        {
          "image": [
            "https://amayaresorts.imgix.net/sites/6/2022/09/Sig-suite-scaled.jpg",
            "https://tropicalvenues.com/uploads/amaya-lake/gallery-amaya-lake-8076.jpeg",
            "https://cf.bstatic.com/xdata/images/hotel/max1024x768/9636721.jpg?k=f8578b5799a3e27d7677bb2eda84fa7f03c965dd45a614aa99d31fe23670acb7&o=&hp=1",
            "https://images.squarespace-cdn.com/content/v1/65c64f1aa0fd06022764b0e3/1717421207900-0KPNC3WT4BSGOOZ99MTU/Food%284%29.jpg?format=1000w"
          ],
          "description": "A range of accommodation options, including Luxury Villas, Superior Rooms, Deluxe Rooms, and Suites. A large outdoor swimming pool with panoramic views of the lake and surrounding greenery, perfect for relaxation. Amaya Lake Dambulla offers a peaceful retreat amid nature with modern amenities, cultural experiences, and easy access to the rich heritage of Sri Lanka. Whether you’re relaxing by the lake, indulging in a spa treatment, or exploring ancient ruins, Amaya Lake provides a memorable blend of luxury and tranquility."
        }
      ]
    },

  {
    "id": 2,
    "name": "Granbell Hotel",
    "location": "Colombo",
    "rating": 4.5,
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0e/75/d8/95/infinity-pool.jpg?w=1200&h=-1&s=1",
    "details": "Granbell Hotel Colombo is a stylish, contemporary hotel located in the heart of Colombo, Sri Lanka. Offering a blend of modern comfort and luxury, the hotel features elegantly designed rooms with panoramic views of the Indian Ocean or the vibrant cityscape. Guests can enjoy a range of amenities including a rooftop infinity pool, a well-equipped fitness center, and multiple dining options serving local and international cuisine. Its central location provides easy access to Colombo's key attractions, making it an ideal choice for both business travelers and tourists.",
    "rooms": [
        {
          "image": ["https://granbellhotel.lk/wp-content/uploads/2022/09/Accomadation-Gallery-1200x600-1-1.webp",
                    "https://granbellhotel.lk/wp-content/uploads/2022/09/Accomadation-Gallery8-1200x600-1.webp",
                    "https://granbellhotel.lk/wp-content/uploads/2023/05/All-Day-Dining-1350x765-2.jpg",
                    "https://granbellhotel.lk/wp-content/uploads/2022/09/Facilities-Gallery1-1200x600-1.webp"
        ],
          "description": "It offers stylish and comfortable accommodations with modern amenities, including free Wi-Fi, flat-screen TVs, and air conditioning. Many rooms feature private balconies with stunning views of the Indian Ocean or the city skyline. The hotel boasts a rooftop infinity pool, a well-equipped fitness center, and a variety of dining options, including a rooftop bar and restaurant. Its central location provides easy access to major attractions, shopping, and dining in Colombo."
        }
      ]
    },

   {
    "id": 3,
    "name": "Marino Beach Hotel",
    "location": "Colombo",
    "rating": 4.6,
    "image": "https://www.marinobeach.com/images/gallery/gallery9.jpg",
    "details": "Marino Beach Hotel Colombo is a luxurious seaside hotel located in the heart of Colombo, Sri Lanka. It offers stunning ocean views, modern amenities, and elegant accommodations, making it a perfect destination for both leisure and business travelers. The hotel features a rooftop infinity pool, multiple dining options, a spa, and direct access to Marino Mall, providing guests with a blend of relaxation and convenience. Its central location allows easy access to Colombo’s attractions, shopping, and cultural sites, making it an ideal base for exploring the city.",
    "rooms": [
        {
          "image": ["https://images.trvl-media.com/lodging/30000000/29970000/29961100/29961010/1542e3fb.jpg?impolicy=fcrop&w=1200&h=800&p=1&q=medium",
                     "https://www.marinobeach.com/image/g-022.jpg",
                     "https://www.marinobeach.com/image/GARDEN-BAR.jpg",
                     "https://www.marinobeach.com/image/g-024.jpg"
        ],
          "description": "Marino Beach Hotel in Colombo offers luxurious accommodations with stunning ocean views and modern amenities. Guests can enjoy spacious rooms, an infinity pool, a rooftop garden, multiple dining options, and a full-service spa. Located in the heart of Colombo, the hotel provides easy access to the city's attractions, making it an ideal choice for both leisure and business travelers."
        }
      ]
   },

   {
    "id": 4,
    "name": "Radisson Hotel",
    "location": "Colombo",
    "rating": 4.4,
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/495691453.jpg?k=af37a7df355d84d6ec21a98fc13d2b1169c1f2c8f885a6c360635069f6381d7c&o=&hp=1",
    "details": "Radisson Hotel Colombo is a contemporary, upscale hotel located in the heart of Sri Lanka's capital city, Colombo. Offering stunning views of the Indian Ocean, the hotel features well-appointed rooms and suites designed for both business and leisure travelers. Guests can enjoy a range of amenities, including a rooftop pool, multiple dining options, a fitness center, and modern event spaces. Its central location provides easy access to Colombo's key attractions, shopping centers, and business districts, making it a convenient and stylish choice for visitors.",
    "rooms": [
        {
          "image": ["https://cf.bstatic.com/xdata/images/hotel/max1024x768/495691380.jpg?k=c91546946a02b625423769dd84579a540e7c908a7ef620dadf2ef354eb7d3f30&o=&hp=1",
                    "https://cf.bstatic.com/xdata/images/hotel/max1024x768/495691456.jpg?k=ac3b623bb73440a47da5d3c8ec6e14739726cf9d282ed8fe4325b2020c30ccd1&o=&hp=1" ,
                    "https://media-cdn.tripadvisor.com/media/photo-s/28/f4/41/0e/caption.jpg",
                    "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2d/ef/af/cc/suite.jpg?w=700&h=-1&s=1"
          ],
          "description": "The hotel features well-appointed rooms and suites equipped with contemporary amenities, including free Wi-Fi, flat-screen TVs, and spacious workspaces, making it ideal for both business and leisure travelers. Guests can enjoy a rooftop infinity pool, a fitness center, and multiple dining options that offer a range of international and local cuisines. The hotel's central location provides easy access to Colombo's major attractions, shopping districts, and business hubs."
        }
      ]
   },

   {
    "id": 5,
    "name": "EKHO Ella",
    "location": "Ella",
    "rating": 4.6,
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/208836268.jpg?k=63460d0d905217e63748d01180ad39718ed3317639950457aa3df0f4e4d6426d&o=&hp=1",
    "details": "EKHO Ella is a boutique hotel nestled in the picturesque town of Ella, Sri Lanka, offering stunning views of the surrounding mountains and lush greenery. The hotel combines modern comforts with traditional Sri Lankan charm, providing guests with a serene and luxurious retreat. EKHO Ella is known for its elegant accommodations, personalized service, and proximity to popular attractions like the Nine Arch Bridge, Little Adam's Peak, and the famous Ella Rock. Ideal for travelers seeking tranquility and natural beauty, the hotel is a perfect base for exploring the scenic landscapes of the region.",
    "rooms": [
        {
          "image": ["https://www.ekhohotels.com/ekhoella/wp-content/uploads/sites/5/2024/02/ekho-ella-rooms-08.webp",
                    "https://www.ekhohotels.com/ekhoella/wp-content/uploads/sites/5/2024/02/ekho-ella-dining-04.webp",
                    "https://www.ekhohotels.com/ekhoella/wp-content/uploads/sites/5/2024/02/ekho-ella-rooms-10.webp",
                    "https://www.ekhohotels.com/ekhoella/wp-content/uploads/sites/5/2024/02/ekho-ella-rooms-01.webp"
          ],
          "description": "EKHO Ella is a boutique hotel nestled in the picturesque town of Ella, Sri Lanka, offering stunning views of the surrounding mountains and lush greenery. The hotel combines modern comforts with traditional Sri Lankan hospitality, featuring elegantly designed rooms, a cozy restaurant serving local and international cuisine, and easy access to popular attractions like the Nine Arches Bridge and Little Adam's Peak. Ideal for travelers seeking a serene and relaxing getaway, EKHO Ella provides an intimate atmosphere and personalized service in a breathtaking natural setting."
        }
      ]
   },

   {
    "id": 6,
    "name": "Jetwing Kurulubedda Galle",
    "location": "Galle",
    "rating": 4.5,
    "image": "https://www.jetwinghotels.com/jetwingkurulubedda/wp-content/uploads/sites/14/2020/02/kurulu-dine-2.jpg",
    "details": "Jetwing Kurulubedda is a boutique hotel located in Sri Lanka, nestled in the scenic surroundings of Galle. The hotel offers a tranquil retreat with a focus on eco-friendly practices and local culture. Location: Set in a lush environment, providing a serene atmosphere while being close to the historic Galle Fort. Accommodations: Typically includes spacious rooms and villas with modern amenities, private balconies, and beautiful views of the surrounding nature.",
    "rooms": [
        {
          "image": ["https://cf.bstatic.com/xdata/images/hotel/max1024x768/587132218.jpg?k=6db4868aee2463fe08f84a2cfea12dc68955b044dd577d54902fe2abbfa1cac0&o=&hp=1",
                    "https://www.jetwinghotels.com/jetwingkurulubedda/wp-content/uploads/sites/14/2021/05/accommodation-849x647-1.jpg",
                    "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1b/00/7b/a8/jetwing-kurulubedda.jpg?w=1200&h=-1&s=1",
                    "https://images.trvl-media.com/lodging/5000000/4740000/4739300/4739268/7a97e5c0.jpg?impolicy=resizecrop&rw=575&rh=575&ra=fill"
          ],
          "description": "Spacious, well-appointed rooms with modern decor. Options often include private balconies or terraces overlooking lush landscapes. Features like air conditioning, Wi-Fi, and flat-screen TVs are typically included. More luxurious spaces that may offer additional amenities such as separate living areas and upgraded furnishings. On-site restaurant serving a variety of local and international dishes, often using fresh, locally sourced ingredients. An inviting pool area surrounded by nature, perfect for relaxation. Spa services that may include massages and wellness treatments. Yoga sessions could be offered for relaxation and mindfulness. Beautifully landscaped gardens for leisurely strolls and relaxation."
        }
      ]
   },

   {
    "id": 7,
    "name": "Jetwing Lighthouse galle",
    "location": "Galle",
    "rating": 4.5,
    "image": "https://www.jetwinghotels.com/wp-content/uploads/2019/06/lighthouse-new-category-744x653.jpg",
    "details": "Jetwing Lighthouse is a luxury hotel located in Galle, Sri Lanka. Known for its stunning ocean views, elegant colonial architecture, and its significance as a masterpiece by renowned Sri Lankan architect Geoffrey Bawa, Jetwing Lighthouse is a popular destination for travelers seeking a blend of historical charm, modern comfort, and natural beauty. Situated along the southwest coast of Sri Lanka, just a few kilometers from the historic Galle Fort (a UNESCO World Heritage site). The hotel offers panoramic views of the Indian Ocean, creating a serene setting for guests.",
    "rooms": [
        {
          "image": ["https://www.reddottours.com/uploads/Accommodation/Jetwing-Lighthouse/Jetwing%20Lighthouse-gallery-pop-up%20(40).jpg",
                    "https://www.jetwinghotels.com/jetwinglighthouse/wp-content/uploads/sites/24/2023/08/Room-Gallery-900x607-8.jpg",
                    "https://content.r9cdn.net/rimg/himg/43/27/5e/expedia_group-98137-22702301-663495.jpg?width=1366&height=768&crop=true",
                    "https://www.jetwinghotels.com/jetwinglighthouse/wp-content/uploads/sites/24/2018/02/3-1.jpg"
        ],
          "description": "Rooms are spacious and elegantly designed, offering sea or garden views, equipped with modern amenities. There are also luxury suites and private dining options, making it a great choice for both families and couples seeking a romantic getaway. Jetwing Lighthouse offers a variety of dining options, from fine dining with local and international cuisines to more casual dining settings. Seafood is a highlight, given the hotel's coastal location, and there’s an emphasis on fresh, locally sourced ingredients. The hotel features a luxurious spa offering traditional Ayurvedic treatments and modern wellness therapies. There are infinity pools, a fitness center, and activities like yoga and meditation. Visitors can also explore nearby attractions like Galle Fort, nearby beaches, or even go whale watching."
        }
      ]
   },

   {
    "id": 8,
    "name": "Le Grand Galle",
    "location": "Galle",
    "rating": 4.5,
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/174997696.jpg?k=5187a88c8fe58523b9f0eb3d92e24d0627ad8d7e1efa5c1c2a572cd510fbc9ea&o=&hp=1",
    "details": "Le Grand Galle is a luxury hotel situated near the historic city of Galle, Sri Lanka. Renowned for its modern elegance, stunning views of the Indian Ocean, and proximity to the UNESCO World Heritage Site Galle Fort, Le Grand Galle provides a sophisticated and tranquil getaway for travelers.",
    "rooms": [
        {
          "image": ["https://d3eklcfi2wom17.cloudfront.net/2018/09/super-deluxe-room1-4.jpg",
                     "https://www.reddottours.com/uploads/Accommodation/Le-Grand/Le%20Grand-gallery-pop-up%20(40).jpg",
                     "https://www.dotwnews.com/uploads/posts_photos/0s9a6831-ttn64w.jpg",
                     "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/14/3a/10/2a/pool-area.jpg?w=700&h=-1&s=1"       
        ],
          "description": "King-size bed or twin beds, Private balcony with seating, Luxury bathroom with rain shower and bathtub, Free Wi-Fi, Smart TV, and air conditioning, Minibar, tea/coffee-making facilities. Spacious bedroom and living area, Private balcony with Jacuzzi and uninterrupted ocean views, Butler service Large luxury bathroom with Jacuzzi tub, Espresso machine and premium in-room amenities."
        }
      ]
   },

   {
    "id": 9,
    "name": "The Fortress Resort And Spa",
    "location": "Galle",
    "rating": 4.5,
    "image": "https://fortressresortandspa.imgix.net/2022/02/gall-overview-1280_0003_Curves-4.jpg?w=900&h=760?q=35",
    "details": "The Fortress Resort & Spa is a luxury beachfront resort located in Koggala, Sri Lanka, a short drive from the historic city of Galle. Known for its unique blend of Dutch and Portuguese colonial architecture, modern amenities, and serene beachfront location, The Fortress offers a relaxing and luxurious escape. It is designed to resemble a traditional Dutch fort, blending the charm of Sri Lanka’s coastal heritage with contemporary luxury.",
    "rooms": [
        {
          "image": ["https://fortressresortandspa.imgix.net/2022/02/accomodation-main_0001_Ocean-Room.jpg?w=900&h=760?q=35",
                    "https://fortressresortandspa.imgix.net/2022/02/accomodation-main_0005_Ocean-Loft-Suite-Plunge-pool.jpg?w=900&h=760?q=35",
                    "https://fortressresortandspa.imgix.net/2022/02/dining-header_0004_Restaurant-Duo.jpg?w=900&h=760?q=35",
                    "https://www.kayak.co.uk/rimg/himg/b4/5a/76/leonardo-2688995-Unforgettable_ocean_views_at_The_Fortress_O-668786.jpg?width=1366&height=768&crop=true"
          ],
          "description": "The Fortress Resort & Spa provides an array of luxurious amenities tailored to meet the needs of both relaxation-seekers and adventure travelers. Whether it's indulging in spa treatments, exploring Sri Lankan culture, or simply enjoying the beachfront location, the resort ensures a memorable stay with its blend of comfort, elegance, and world-class service. Spacious and elegant, these rooms offer views of the resort's tropical gardens or the infinity pool. King-size bed or twin beds Private balcony or terrace, Air conditioning, Smart TV, and free Wi-Fi, Mini-bar, tea/coffee making facilities, and in-room safe Luxury bathroom with rain shower and premium toiletries"
        }
      ]
   },

   {
    "id": 10,
    "name": "The Grand Kandyan's Hotel",
    "location": "Kandy",
    "rating": 4.5,
    "image": "https://www.il.kayak.com/rimg/himg/99/8f/1d/expedia_group-2207964-fe1626-832653.jpg?width=1366&height=768&crop=true",
    "details": "The Grand Kandyan Hotel is a luxurious five-star hotel located in Kandy, Sri Lanka. Known for its grandeur, elegance, and modern amenities, it offers guests a lavish stay while being close to Kandy’s cultural and historical attractions, including the famous Temple of the Sacred Tooth Relic. With stunning views of the Kandy cityscape and lush green hills, the hotel provides a mix of relaxation, comfort, and access to cultural experiences.",
    "rooms": [
        {
          "image": ["https://images.trvl-media.com/lodging/13000000/12340000/12331100/12331083/5891c957.jpg?impolicy=fcrop&w=1200&h=800&p=1&q=medium",
                     "https://grand-kandyan-hotel.srilankahotel.net/data/Photos/700x500w/3983/398308/398308140.JPEG",
                     "https://grand-an.kandy-hotels.com/data/Pics/OriginalPhoto/15474/1547428/1547428483/grand-an-hotel-kandy-pic-22.JPEG",
                     "https://cf.bstatic.com/xdata/images/hotel/max1024x768/84970730.jpg?k=e893037a9192445a8907924e444f2807f3f68f3b4cf6323907ebcf630b55304c&o=&hp=1"
          ],
          "description": "The hotel offers a variety of luxurious rooms and suites, all equipped with modern amenities and designed to ensure comfort. King-size bed or twin beds, Private balcony with seating, En-suite bathroom with rain shower and bathtub, Air conditioning, Smart TV, free Wi-Fi, Mini-bar, in-room safe, tea/coffee making facilities. The Grand Kandyan Hotel is a luxurious blend of modern amenities, traditional charm, and personalized service, offering guests a memorable experience in the heart of Kandy. Whether you're there for relaxation, cultural exploration, or special events, the hotel’s opulence, scenic views, and high-end services make it a standout destination"
        }
      ]
   },

   {
    "id": 11,
    "name": "Queen's Hotel Kandy",
    "location": "Kandy",
    "rating": 3.9,
    "image": "https://thumbs.dreamstime.com/b/kandy-sri-lanka-february-queens-hotel-l-275137173.jpg",
    "details": "Queen's Hotel in Kandy, Sri Lanka, is a historic landmark with a rich colonial heritage. It is one of the oldest hotels in Sri Lanka, dating back over 160 years, and is located right in the heart of Kandy, near many of the city's major cultural and historic attractions. The hotel’s grand architecture, traditional charm, and prime location make it a unique place to stay while exploring the city. Queen’s Hotel in Kandy is an iconic hotel that offers more than just accommodation—it provides an immersive historical experience. Its colonial charm, combined with its central location, makes it ideal for travelers looking to explore the cultural and natural beauty of Kandy while staying in a place steeped in history. Whether you're there to explore the ancient Temple of the Tooth or to enjoy a relaxing getaway in the hill country, Queen's Hotel offers a unique and elegant stay.",
    "rooms": [
        {
          "image": ["https://www.queenshotel.lk/images/gallerynew/9.jpg",
                    "https://www.queenshotel.lk/images/gallerynew/8.jpg",
                    "https://www.queenshotel.lk/images/gallerynew/25.jpg",
                    "https://www.queenshotel.lk/images/gallerynew/2.jpg"
          ],
          "description": "Queen’s Hotel offers comfortable, classically furnished rooms that reflect the hotel's colonial elegance. Air conditioning. En-suite bathrooms. Satellite TV. Complimentary Wi-Fi. Tea/coffee-making facilities. Some rooms come with private balconies offering views of Kandy Lake or Udawattakele Forest Reserve. Queen’s Hotel features a large outdoor pool, surrounded by lush greenery and a seating area. It’s a refreshing escape for guests looking to relax after exploring the city."
        }
      ]
   },

   {
    "id": 12,
    "name": "Amaya Hills Kandy",
    "location": "Kandy",
    "rating": 4.4,
    "image": "https://www.themiracleisland.com/images/acommodation/amaya-hills/slider.jpg",
    "details": "Amaya Hills Kandy is a luxury hotel located in the picturesque hill country of Sri Lanka, specifically in Kandy, one of the country's most culturally significant cities. Nestled amidst lush greenery and scenic mountains, Amaya Hills offers a unique blend of traditional Kandyan architecture, modern comforts, and stunning panoramic views of the surrounding landscape. Amaya Hills is a great choice for those who want to enjoy the natural beauty of Sri Lanka’s hill country, combined with cultural experiences and modern luxury. It’s ideal for couples on a romantic getaway, families seeking a peaceful retreat, or travelers interested in exploring Kandy’s rich history and scenic surroundings.",
    "rooms": [
        {
          "image": ["https://amayaresorts.imgix.net/sites/2/2022/09/Hills-Gallery-5-scaled.jpg",
                     "https://the-secret.kandy-hotels.com/data/Pics/OriginalPhoto/6423/642398/642398337/the-secret-hotel-kandy-pic-46.JPEG",
                     "https://cf.bstatic.com/xdata/images/hotel/max1024x768/16185050.jpg?k=5251b28df01e9d6b77273fa0bffe7ae8890c0d53d15fe4933e896556b3a8f1a0&o=&hp=1",
                     "https://sankenconstruction.com/wp-content/uploads/2021/01/wedding-halls-in-kandy.jpg"
          ],
          "description": "Free Wi-Fi: Available throughout the property. 24-Hour Front Desk: Concierge services to assist with travel arrangements, tour bookings, and any other requests. Poolside Services: Sun loungers, poolside bar service, and snacks."
        }
      ]
   },

   {
    "id": 13,
    "name": "Fox Kandy",
    "location": "Kandy",
    "rating": 4.7,
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/252324340.jpg?k=8516d7e27d554f4da72c7c18ba63cde4c071fe1c97b3f220331b7f1e2e7a657b&o=&hp=1",
    "details": "Fox Resorts Kandy is a stylish boutique hotel located in the scenic hills surrounding Kandy, Sri Lanka. It offers a tranquil escape from the bustle of the city, with a strong emphasis on blending art, culture, and luxury. The resort is renowned for its artistic ambiance, with local artwork integrated into the hotel’s design, providing a unique cultural experience for guests.",
    "rooms": [
        {
          "image": ["https://images.trvl-media.com/lodging/18000000/17400000/17399100/17399100/6e6dc0e3.jpg?impolicy=fcrop&w=1200&h=800&p=1&q=medium",
                     "https://files.elfsight.com/storage/6e7ecea3-fb01-45f4-a04c-d8257512324d/4bd3c795-454c-4ff6-bead-27cf3ce7b41d.jpg",
                     "https://tb-static.uber.com/prod/image-proc/processed_images/d8d275da1b0dbce77f93a76c19630b55/fb86662148be855d931b37d6c1e5fcbe.jpeg",
                     "https://images.trvl-media.com/lodging/18000000/17400000/17399100/17399100/07ac8edc.jpg?impolicy=resizecrop&rw=575&rh=575&ra=fill"
          ],
          "description": "Earl’s Regency Hotel is a luxurious 5-star hotel located in the scenic hills of Kandy, Sri Lanka. Known for its regal design and breathtaking views of the surrounding mountains and lush landscapes, it offers a perfect blend of comfort, luxury, and natural beauty. Earl’s Regency is an excellent choice for both leisure travelers and those visiting Kandy for business or special occasions."
        }
      ]
   },

   {
    "id": 14,
    "name": "Earls Regency Kandy",
    "location": "Kandy",
    "rating": 4.6,
    "image": "https://d3a2q5al71qg9.cloudfront.net/sites/2/2021/01/Slide2-1.jpg",
    "details": "Earl’s Regency Hotel is a luxurious 5-star hotel located in the scenic hills of Kandy, Sri Lanka. Known for its regal design and breathtaking views of the surrounding mountains and lush landscapes, it offers a perfect blend of comfort, luxury, and natural beauty. Earl’s Regency is an excellent choice for both leisure travelers and those visiting Kandy for business or special occasions.",
    "rooms": [
        {
          "image": ["https://d3a2q5al71qg9.cloudfront.net/sites/2/2021/01/Slide11.jpg",
                     "https://images.trvl-media.com/lodging/2000000/1530000/1523200/1523191/489f603c.jpg?impolicy=fcrop&w=1200&h=800&p=1&q=medium",
                    "https://d3a2q5al71qg9.cloudfront.net/sites/2/2021/01/Slide9.jpg",
                    "https://d3a2q5al71qg9.cloudfront.net/sites/2/2021/01/Slide12.jpg"
          ],
          "description": "Earl's Regency Hotel Kandy offers a range of rooms and suites, all designed to provide comfort with a hint of colonial grandeur. The rooms feature vintage décor, high ceilings, and traditional furnishings, creating a unique and nostalgic atmosphere Earls Regency Kandy is ideal for travelers seeking an authentic and historical experience in Sri Lanka’s cultural capital. Its colonial charm, combined with a scenic location by Kandy Lake, makes it a great choice for those who appreciate history, nature, and comfort. The hotel’s proximity to major attractions, along with its beautiful gardens and traditional hospitality, ensures a relaxing and memorable stay in Kandy."
        }
      ]
   },

   {
    "id": 15,
    "name": "Radisson Kandy",
    "location": "Kandy",
    "rating": 4.6,
    "image": "https://media.radissonhotels.net/image/radisson-hotel-kandy/exterior/16256-124733-f75010924_3xl.jpg?impolicy=GalleryLightboxFullscreen",
    "details": "Radisson Hotel Kandy is a contemporary 4-star hotel offering a blend of modern luxury and scenic beauty in the heart of Sri Lanka’s cultural capital, Kandy. Located near Kandy Lake, the hotel provides easy access to the city’s historic attractions while delivering high-quality service and facilities for a relaxing stay. Radisson Hotel Kandy is an excellent choice for travelers seeking a modern, comfortable stay in the heart of Kandy. Its central location, rooftop pool with panoramic views, and high-quality service make it perfect for both leisure and business travelers. Whether you are visiting Kandy’s cultural landmarks or just looking for a relaxing retreat, Radisson Kandy combines convenience and luxury for a memorable stay.",
    "rooms": [
        {
          "image": ["https://media.radissonhotels.net/image/radisson-hotel-kandy/guest-room/16256-124733-f75008524_4k.jpg?impolicy=GalleryLightboxFullscreen",
                     "https://cf.bstatic.com/xdata/images/hotel/max1024x768/441992491.jpg?k=5392132e0fc72b7b1aea0ad74a1c410b9cb607bd5c5ffdd769dde7b3bf33c2ca&o=&hp=1",
                     "https://media.timeout.com/images/103429817/750/422/image.jpg",
                     "https://www.reddottours.com/uploads/Accommodation/ozo-kandy/OZO%20Kandy-gallery-pop-up%20(10).jpg"
          ],
          "description": "Radisson Hotel also offers a variety of luxurious rooms and suites, all designed to provide comfort with a touch of elegance and traditional Sri Lankan style. The rooms are spacious and well-equipped, with many offering stunning views of the surrounding landscapes. Free high-speed Wi-Fi, Flat-screen TV with satellite channels, Minibar, Coffee and tea-making facilities, In-room safe, Air conditioning, En-suite bathroom with premium toiletries."
        }
      ]
   },

   {
    "id": 16,
    "name": "Jetwing St. Andrew's Nuwara Eliya",
    "location": "Nuwara Eliya",
    "rating": 4.4,
    "image": "https://jetwingstandrewsnuwaraeliya.hotelmix.co.uk/data/Photos/OriginalPhoto/6921/692176/692176809/Jetwing-St-AndrewS-Hotel-Nuwara-Eliya-Exterior.JPEG",
    "details": "Jetwing St. Andrew’s Nuwara Eliya is a prestigious heritage hotel that offers a unique colonial experience in the heart of Sri Lanka’s central highlands. Located in the cool, misty town of Nuwara Eliya, also known as 'Little England' , the hotel captures the essence of British colonial architecture and blends it with the natural beauty of the surrounding tea plantations and mountain landscapes. he hotel’s timeless elegance, coupled with modern conveniences and eco-friendly practices, makes it a standout choice for both relaxation and exploration. Whether you're interested in the region’s tea culture, natural beauty, or simply enjoying the cooler climate, Jetwing St. Andrew’s provides a luxurious and historically rich retreat.",
    "rooms": [
        {
          "image": ["https://cf.bstatic.com/xdata/images/hotel/max1024x768/155924382.jpg?k=5c98619fd883a31fd66495ee0f44ea0bae58d81665ec03bfcece6a1c658c3b8a&o=&hp=1",
                    "https://www.jetwinghotels.com/jetwingstandrews/wp-content/uploads/sites/19/2019/08/gallery-r-3.jpg",
                    "https://www.jetwinghotels.com/jetwingstandrews/wp-content/uploads/sites/19/2018/02/Gal-8.jpg",
                    "https://cf.bstatic.com/xdata/images/hotel/max1024x768/99805175.jpg?k=c8bedc2d7ae4f8761193fbba02bc5f8dd00169779b0a23d48326c34e1280c94e&o=&hp=1"
          ],
          "description": "Free Wi-Fi: Available throughout the hotel. Concierge Services: The hotel’s concierge can assist in planning excursions, arranging transportation, and providing. local insights on places to visit. Library: A small, cozy library stocked with a variety of books for guests to enjoy. Business Services: The hotel offers facilities for small meetings and business travelers, including meeting rooms and basic office services. Laundry Service: Available for guests on request. Parking: Free parking is available for guests who drive to the hotel. A beautiful lake where visitors can enjoy boating, horse riding, and relaxing by the water."
        }
      ]
   },

   {
    "id": 17,
    "name": "Jetwing Warwick Gardens Nuwara Eliya",
    "location": "Nuwara Eliya",
    "rating": 4.6,
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0f/eb/5b/d8/jetwing-warwick-gardens.jpg?w=700&h=-1&s=1",
    "details": "Jetwing Warwick Gardens is a luxury boutique bungalow nestled in the heart of Sri Lanka's highlands, near Nuwara Eliya. This beautiful, colonial-era mansion offers an intimate and luxurious escape, set amidst tea plantations and lush greenery. With its blend of historical charm and modern comfort, it provides a perfect retreat for guests seeking tranquility and a personalized experience in Sri Lanka's cool hill country.",
    "rooms": [
        {
          "image": ["https://www.jetwinghotels.com/jetwingwarwickgardens/wp-content/uploads/sites/17/2019/08/warwick-White-Room-detail.jpg",
                     "https://cf.bstatic.com/xdata/images/hotel/max1024x768/306420800.jpg?k=358b7596ee12d563d8d414fc073da98b94872a538eba92c697d46548373f6632&o=&hp=1",
                     "https://www.jetwinghotels.com/jetwingwarwickgardens/wp-content/uploads/sites/17/2019/08/warwick-living-room.jpg",
                     "https://www.jetwinghotels.com/jetwingwarwickgardens/wp-content/uploads/sites/17/2019/08/warwick-dish.jpg"
          ],
          "description": "Queen-sized bed or twin beds, Intimate setting with tasteful colonial decor, En-suite bathroom with hot water and essential amenities, Complimentary Wi-Fi (may experience fluctuations due to location), Heating and cozy blankets to stay warm during the chilly nights, Garden or hillside views, Traditional wooden furniture, adding to the colonial ambiance. Jetwing Warwick Gardens is ideal for those seeking an exclusive, tranquil experience with a personal touch."
        }
      ]
   },

   {
    "id": 18,
    "name": "Broom Field By Jetwing",
    "location": "Nuwara Eliya",
    "rating": 4.5,
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0d/8f/60/23/hotel-exterior.jpg?w=1200&h=-1&s=1",
    "details": "Jetwing Broomfield seems to refer to a property or development associated with Jetwing, a well-known luxury hotel and hospitality brand in Sri Lanka. However, I don't have any details on a specific location called 'Broom Field' linked to Jetwing.",
    "rooms": [
        {
          "image": ["https://www.jetwinghotels.com/broomfield/wp-content/uploads/sites/43/2022/07/Room-Gallery5-1200x810-1.jpg",
                     "https://www.jetwinghotels.com/broomfield/wp-content/uploads/sites/43/2022/07/Broomfield-By-Jetwing-Gallery4-1200x810-1.jpg",
                     "https://www.jetwinghotels.com/broomfield/wp-content/uploads/sites/43/2022/06/Home-Dining-849x647-1.jpg",
                     "https://cf.bstatic.com/xdata/images/hotel/max1024x768/365140805.jpg?k=1388d0fdd1d9fb0c8d444ac8ac93df904f2c8f70f063bf40e98daa3f29b43901&o=&hp=1"
          ],
          "description": "Queen-sized bed or twin beds, Intimate setting with tasteful colonial decor, En-suite bathroom with hot water and essential amenities, Complimentary Wi-Fi (may experience fluctuations due to location), Heating and cozy blankets to stay warm during the chilly nights, Garden or hillside views, Traditional wooden furniture, adding to the colonial ambiance. Jetwing Warwick Gardens is ideal for those seeking an exclusive, tranquil experience with a personal touch."
        }
      ]
   },

   {
    "id": 19,
    "name": "Oatlands By Jetwing",
    "location": "Nuwara Eliya",
    "rating": 4.6,
    "image": "https://content.skyscnr.com/available/1739487315/1739487315_WxH.jpg",
    "details": "Oatlands by Jetwing is a charming colonial-era bungalow located in the picturesque highlands of Nuwara Eliya, Sri Lanka. This vintage retreat offers a luxurious stay with a homely touch, perfect for those looking to experience the cool misty climate and rich history of the region. Oatlands by Jetwing is a charming colonial-era bungalow located in the picturesque highlands of Nuwara Eliya, Sri Lanka. This vintage retreat offers a luxurious stay with a homely touch, perfect for those looking to experience the cool misty climate and rich history of the region.",
    "rooms": [
        {
          "image":[  "https://www.jetwinghotels.com/oatlands/wp-content/uploads/sites/10/2017/10/DSC1801_HDR.jpg",
                      "https://www.jetwinghotels.com/oatlands/wp-content/uploads/sites/10/2017/10/DSC1665_HDR.jpg",
                      "https://www.jetwinghotels.com/oatlands/wp-content/uploads/sites/10/2017/10/DSC1890_HDR.jpg",
                      "https://www.jetwinghotels.com/oatlands/wp-content/uploads/sites/10/2017/10/DSC2000.jpg"
          ],
          "description": "The accommodation consists of four elegantly furnished rooms, blending colonial charm with modern comforts. The bungalow is set on a quiet hill, offering stunning views of the surrounding countryside. It’s an intimate and cozy space that caters to families and small groups looking for an exclusive, private stay. Luxurious bedrooms with modern amenities. A dining area serving traditional Sri Lankan and international cuisine, A private garden to enjoy the serene environment, Complimentary Wi-Fi, Butler services to cater to personalized requests."
        }
      ]
   },

   {
    "id": 20,
    "name": "Meena Amma's Tea Experience",
    "location": "Nuwara Eliya",
    "rating": 4.6,
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/129684720.jpg?k=6b6c9564ed20ce3597520942f2568b6a2985cb23aa50dbff29d31ee2f3fa4667&o=&hp=1",
    "details": "Meena Amma's Tea Experience, located in Nuwara Eliya within the Warwick Estate, offers guests an authentic immersion into Sri Lankan tea culture. The experience is designed to connect visitors with the life of local tea pickers and the long heritage of tea cultivation in Sri Lanka. Situated at 6,000 feet above sea level, it is a peaceful escape surrounded by beautiful landscapes, offering a tranquil environment for learning about tea while enjoying the serenity of the Sri Lankan highlands.",
    "rooms": [
        {
          "image": ["https://www.jetwinghotels.com/meena-ammas-tea-experience/wp-content/uploads/sites/34/2018/05/Gallery-2-300x203.jpg",
          "https://cf.bstatic.com/xdata/images/hotel/max1024x768/147918158.jpg?k=cb3a90979ca5087b0e867fccc2b9af9dcb671cb329f6e0ae19c51f660d68a6fb&o=&hp=1",
          "https://www.jetwinghotels.com/meena-ammas-tea-experience/wp-content/uploads/sites/34/2018/05/Gallery-4.jpg",
          "https://a0.muscache.com/im/pictures/f46fd348-5f46-4894-8d08-a7dafc9f11e2.jpg?im_w=720"

          ],
          "description": "Set apart from holiday homes in Nuwara Eliya, Meena Amma’s Tea Experience offers truly authentic upcountry living with the simple luxuries of its famed residents. Designed to immerse you in the lives of Sri Lanka’s iconic tea pickers, the line rooms and their surroundings offer only a selection of basic facilities including room and laundry service, as well as a doctor on call. Parking can be found at the upper portion of our estate, which also houses Jetwing Warwick Gardens. A number of additional facilities and services are available with our family at Jetwing Warwick Gardens, should you require, and can be arranged for you upon request."
        }
      ]
   },

   {
    "id": 21,
    "name": "The Westbury Hotel",
    "location": "Nuwara Eliya",
    "rating": 4.8,
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/464308883.jpg?k=83758a5ed71886417d48eb86e1121374f37b939ea01b64df87a091b5722a8e5a&o=&hp=1",
    "details": "The Westbury Palace, Nuwara Eliya is the most luxurious bungalow in Little England, Sri Lanka. Indulge in the celebrity-like treatment at the palace of modern Royalty! We offer a discrete, one-of-a-kind experience for a splendid holiday. Let us spoil and pamper you with utmost luxurious hospitality!",
    "rooms": [
        {
          "image": ["https://www.thewestburypalace.com/images/site-specific/westbury-palace/rooms-and-suites/royal-deluxe-2.png",
                     "https://cf.bstatic.com/xdata/images/hotel/max1024x768/188924676.jpg?k=dc74bf7d24db66e13d2cf0aab9132beef743a3b530f9802c0d0da0357645e9ee&o=&hp=1",
                     "https://cf.bstatic.com/xdata/images/hotel/max1024x768/470046173.jpg?k=c6513a99334ff8deb75c8c651363330c42535e5cf8c8613879fdb508701c0944&o=&hp=1",
                     "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/28/95/c9/7e/background.jpg?w=700&h=-1&s=1"
          ],
          "description": "The hotel offers a range of rooms and suites, typically designed with elegant decor, comfortable furnishings, and modern amenities. Many rooms provide stunning views of the surrounding hills and gardens. Facilities may include a spa, fitness center, and outdoor activities like hiking or exploring tea estates. The Westbury Hotel serves as a delightful base for exploring the natural beauty and cultural heritage of Nuwara Eliya"
        }
      ]
   },

   {
    "id": 22,
    "name": "Araliya Green Hotel",
    "location": "Nuwara Eliya",
    "rating": 4.3,
    "image": "https://do6raq9h04ex.cloudfront.net/sites/3/2020/12/PGP_7527-1.jpg",
    "details": "Araliya Green Hotel in Nuwara Eliya is a well-regarded accommodation option, known for its beautiful surroundings, modern amenities, and exceptional service. Nestled in the picturesque hill country of Nuwara Eliya, the hotel is surrounded by lush landscapes, tea plantations, and the cool climate characteristic of the region. It is conveniently located near many local attractions. The hotel features a blend of modern design and colonial charm, offering a welcoming atmosphere for guests. Araliya Green Hotel offers a variety of accommodations, including standard rooms, deluxe rooms, and suites. Each room is designed to provide comfort and relaxation.",
    "rooms": [
        {
          "image": ["https://do6raq9h04ex.cloudfront.net/sites/3/2020/12/2-1.jpg",
                    "https://do6raq9h04ex.cloudfront.net/sites/3/2020/12/PGP_8125-1.jpg",
                    "https://do6raq9h04ex.cloudfront.net/sites/3/2021/04/PGP_8250f.jpg",
                    "https://do6raq9h04ex.cloudfront.net/sites/3/2020/12/Royal-Suite-PGP_7927.jpg"
          ],
          "description": "The hotel may offer spa services, providing guests with relaxation and rejuvenation options, including massages and wellness treatments. Comfortable beds, En-suite bathrooms, Flat-screen TVs, Tea/coffee-making facilities, Balconies or large windows with scenic views. Araliya Green Hotel is a great choice for travelers looking for a comfortable and charming place to stay in Nuwara Eliya, with plenty of opportunities to explore the natural beauty and cultural richness of the area."
        }
      ]
   },

   {
    "id": 23,
    "name": "Heritance Tea Factory",
    "location": "Nuwara Eliya",
    "rating": 4.7,
    "image": "https://www.mediastorehouse.com/p/251/sri-lanka-nuwara-eliya-heritance-tea-estate-19496515.jpg.webp",
    "details": "Heritance Tea Factory is a unique luxury hotel located in Nuwara Eliya, Sri Lanka, known for its stunning location, rich history, and exceptional service. Nestled in the picturesque hill country of Sri Lanka, the hotel is set amidst lush tea plantations and rolling hills, providing a serene environment for guests. It is located in an old tea factory, giving it a unique character and charm. The hotel is built on the site of a former tea factory, which has been beautifully converted into a luxurious accommodation. Heritance Tea Factory combines modern luxury with the rich heritage of Sri Lanka's tea culture, making it a fantastic choice for travelers looking for a unique and comfortable stay in Nuwara Eliya.",
    "rooms": [
        {
          "image": ["https://www.heritancehotels.com/teafactory/wp-content/uploads/sites/23/2023/08/Superior-Rom-Double-106-21.png",
                     "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/05/da/45/d1/heritance-tea-factory.jpg?w=700&h=-1&s=1",
                     "https://arenatours.com/wp-content/uploads/sri-lanka/heritance-tea-factory/heritance-tea-factory-10.jpeg",
                     "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/21/78/a7/91/caption.jpg?w=1200&h=1200&s=1"
          ],
          "description": "Comfortable double or twin beds En-suite bathroom with modern amenities Flat-screen TV Tea and coffee-making facilities Work desk and seating area Large windows with views of the surrounding tea plantations. Spacious layout with elegant decor Enhanced views of the tea estates Luxurious bedding and furnishings En-suite bathroom with upgraded fixtures and a bathtub Mini-bar and refrigerator Additional seating area for relaxation. The hotel’s unique setting in a converted tea factory adds to its charm, providing guests with an authentic experience."
        }
      ]
   },

   {
    "id": 24,
    "name": "Jetwing Safari Camp",
    "location": "Yala",
    "rating": 4.8,
    "image": "https://jetwingtravels.com/wp-content/uploads/2023/11/Jetwing-Safari-Camp-Desktop-image.jpg",
    "details": "Jetwing Jungle Lodge seamlessly combines modernity with the serene beauty of the jungle, offering a contemporary home of authentic Sri Lankan hospitality. Enjoy a wealth of luxuries that enhance your stay in our coastal sanctuary. In addition to 24-hour room service, our 24-hour travel desk is available to help plan your island adventures. Daily housekeeping and dedicated laundry services ensure your comfort, while complimentary wireless internet keeps you connected at the edge of the wild. For your convenience, we also offer I.D.D., fax, and e-mail services, along with a purpose-built story room for your next business or pleasure event.",
    "rooms": [
        {
          "image": ["https://www.jetwinghotels.com/jetwingjunglelodge/wp-content/uploads/sites/20/2023/06/GAL-Bedroom-2-744X502.jpg",
                     "https://www.jetwinghotels.com/jetwingjunglelodge/wp-content/uploads/sites/20/2020/02/saf-room3.jpg",
                     "https://www.jetwinghotels.com/jetwingjunglelodge/wp-content/uploads/sites/20/2020/02/safari-dining5.jpg",
                     "https://www.jetwinghotels.com/jetwingjunglelodge/wp-content/uploads/sites/20/2023/06/Thicket-Thumbnail-Desktop.jpg"
          ],
          "description": "Jetwing Jungle Lodge seamlessly combines modernity with the serene beauty of the jungle, offering a contemporary home of authentic Sri Lankan hospitality. Enjoy a wealth of luxuries that enhance your stay in our coastal sanctuary. Our location on Sri Lanka’s southern coastline provides direct beach access, with internationally trained lifeguards and a first aid team ensuring your safety. Within the hotel grounds, an elevated swimming pool offers a refreshing alternative. For ultimate relaxation, indulge in our in-room spa treatments, inviting you to experience bliss and tranquility."
        }
      ]
   },

   {
    "id": 25,
    "name": "Cinnamon Wild Yala",
    "location": "Yala",
    "rating": 4.7,
    "image": "https://d19lgisewk9l6l.cloudfront.net/assetbank/Cinnamon_Wild_Yala_Sri_Lanka_Kumana_National_Park_7286.jpg",
    "details": "Cinnamon Wild Yala is a renowned wildlife resort located near Yala National Park, one of Sri Lanka’s premier wildlife reserves. The resort is designed to offer a luxury safari experience, combining comfort with proximity to nature. Here's a comprehensive overview of Cinnamon Wild Yala. Cinnamon Wild Yala is situated in the southern region of Sri Lanka, just on the edge of Yala National Park. This gives guests easy access to the park, which is famous for its population of leopards, elephants, and diverse wildlife. The resort blends luxury with nature, providing a rustic yet elegant stay surrounded by the wilderness. Expect an immersive experience where animals like deer, wild boar, and even elephants may wander near the property.",
    "rooms": [
        {
          "image": ["https://www.sundaytimes.lk/221120/uploads/121.jpg",
                   "https://archives1.dailynews.lk/sites/default/files/news/2019/11/06/T%26C-p31-Cinnamon01.jpg",
                   "https://cf.bstatic.com/xdata/images/hotel/max1024x768/490715476.jpg?k=60b5eca7d3ceb2f96690950b5a8c2fe7cc48238465a2916a0aeee93295f9efbc&o=&hp=1",
                   "https://cf.bstatic.com/xdata/images/hotel/max1024x768/75400942.jpg?k=e464d720bdace716cb4dac0f2eef582a95de2ab7627ca9d641c496899e71bcbd&o=&hp=1"
          ],
          "description": "These chalets are located amidst dense forest and vegetation, offering a secluded, nature-filled experience. King-sized beds or twin beds, En-suite bathroom with modern fittings, Private veranda with jungle views, Air-conditioning and fan, Complimentary Wi-Fi and satellite TV. Cinnamon Wild Yala offers a perfect combination of luxury, nature, and adventure. With its proximity to Yala National Park, guided safaris, and immersive wildlife experience, it is an ideal destination for nature lovers, adventurers, and anyone looking to experience Sri Lanka’s rich wildlife."
        }
      ]
   },

   {
    "id": 26,
    "name": "Hilton Yala Resort",
    "location": "Yala",
    "rating": 4.8,
    "image": "https://assets.hiltonstatic.com/hilton-asset-cache/image/upload/c_fill,w_956,h_632,q_80,f_auto,g_auto/Imagery/Property%20Photography/Hilton%20International/K/KDWYAHI/Exterior01.jpg",
    "details": "Hilton Yala is an upcoming luxury resort located near Yala National Park, Sri Lanka’s renowned wildlife sanctuary. This resort is part of the Hilton brand, known globally for offering world-class accommodations and experiences. While specific details about Hilton Yala are still emerging as the project nears completion. Hilton Yala is located in the southern region of Sri Lanka, adjacent to Yala National Park, one of the country’s most famous national parks. Yala is known for its high density of leopards, elephants, and other diverse wildlife, offering an ideal base for safari enthusiasts. The resort is expected to combine luxury with an immersive natural experience, bringing Hilton’s signature elegance to the wild, while offering guests the chance to connect with nature in one of the most beautiful parts of the island.",
    "rooms": [
        {
          "image": ["https://assets.hiltonstatic.com/hilton-asset-cache/image/upload/c_fill,w_956,h_632,q_80,f_auto,g_auto/Imagery/Imagery/Hilton%20International/K/KDWYAHI/Deluxe_King_Bedroom.jpg",
                    "https://assets.hiltonstatic.com/hilton-asset-cache/image/upload/c_fill,w_660,h_440,q_80,f_auto,g_auto/Imagery/Lifestyle%20Photography/Hilton%20Hotels%20and%20Resorts/K/KDWYAHI/Sandali.jpg",
                    "https://assets.hiltonstatic.com/hilton-asset-cache/image/upload/c_fill,w_660,h_440,q_80,f_auto,g_auto/Imagery/Property%20Photography/Hilton%20International/K/KDWYAHI/PremiumSuiteBathroom.jpg",
                    "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2a/0b/26/90/hilton-yala-resort.jpg?w=700&h=-1&s=1"
          ],
          "description": "As Hilton Yala is under development, the exact details of the rooms and suites are not fully available. However, based on Hilton’s general standards and luxury resort offerings. King-sized or twin beds, En-suite bathroom wiwith modern amenities Large windows or balconies with stunning views of the natural surroundings (likely offering views of Yala National Park or the coastline). Air-conditioning, Wi-Fi, and flat-screen TVs. Hilton Yala is poised to become a premium destination for luxury travelers looking to experience Sri Lanka’s rich wildlife while staying in a world-class resort"
        }
      ]
   },

   {
    "id": 27,
    "name": "Double Tree By Hilton",
    "location": "Weerawila",
    "rating": 4.7,
    "image": "https://www.hilton.com/im/en/WRZRJDI/19594440/dt-weerawila-exterior-drone-shot.jpg?impolicy=crop&cw=4802&ch=2688&gravity=NorthWest&xposition=0&yposition=448&rw=768&rh=430",
    "details": "DoubleTree by Hilton is a global hotel brand that offers upscale accommodations, typically with a focus on comfort, business travel, and family-friendly services. DoubleTree properties are well known for their warm, welcoming atmosphere, highlighted by the brand's signature warm chocolate chip cookie upon check-in. Here’s an overview of what you can generally expect at DoubleTree by Hilton properties.",
    "rooms": [
        {
          "image": ["https://www.hilton.com/im/en/WRZRJDI/18712736/presidential-suite-12-.jpg?impolicy=crop&cw=4500&ch=2519&gravity=NorthWest&xposition=0&yposition=240&rw=768&rh=430",
                     "https://www.hilton.com/im/en/WRZRJDI/17774656/hornbill-2-.jpg?impolicy=crop&cw=4500&ch=2519&gravity=NorthWest&xposition=0&yposition=240&rw=768&rh=430",
                     "https://cf.bstatic.com/xdata/images/hotel/max1024x768/490843178.jpg?k=eb62daa66d1a76b5cb546baa30f24ef954a295c9d7d2d5a21f4d14bfb4d0485a&o=&hp=1",
                     "https://www.hilton.com/im/en/WRZRJDI/18806909/presidential-suite-7-.jpg?impolicy=crop&cw=4500&ch=2929&gravity=NorthWest&xposition=0&yposition=35&rw=768&rh=500"
          ],
          "description": "DoubleTree by Hilton offers a more casual yet upscale experience compared to the main Hilton brand. It caters to business travelers, leisure guests, and families. Friendly and personalized service is a hallmark of DoubleTree, including the signature cookie greeting that’s become synonymous with the brand. DoubleTree by Hilton hotels offer a mix of upscale comfort and approachable luxury. Whether you’re staying in a major city, at an airport location, or in a more exotic destination, you can expect high-quality service, comfortable accommodations, and thoughtful amenities. For families, business travelers, and leisure guests alike, DoubleTree ensures a pleasant and welcoming stay, enhanced by its signature warm cookie and attention to detail."
        }
      ]
   },

   {
    "id": 28,
    "name": "Shangri-La Hambantota",
    "location": "Hambanthota",
    "rating": 4.5,
    "image": "https://secretescapes-web.imgix.net/hotels/6336/140ab166_99e9_4d3d_a611_af604004a6e6.jpg?w=640&h=459&fit=crop&crop=entropy&auto=format,compress",
    "details": "Shangri-La’s Hambantota Golf Resort & Spa is a luxurious resort located on the southern coast of Sri Lanka, offering a perfect blend of relaxation, adventure, and wellness. Situated amidst lush landscapes and with stunning views of the Indian Ocean, this resort is renowned for its world-class facilities, including a championship golf course, luxurious accommodations, and a wide range of amenities. The resort is located in Hambantota, on Sri Lanka’s southern coast, about 200 km from Colombo. It is set on 145 acres of pristine beachfront property, offering a serene and tranquil environment. hangri-La Hambantota blends luxury with the natural beauty of Sri Lanka’s coastal region. The resort has a strong focus on sustainability, and its design is inspired by the island’s rich cultural heritage.",
    "rooms": [
        {
          "image": ["https://static51.com-hotel.com/uploads/hotel/72802/photo/shangri-la-hambantota_169629379130.jpg",
                     "https://hoteldesigns.net/wp-content/uploads/2016/06/Shangri-LaMain.jpg",
                     "https://www.travelforsenses.com/wp-content/uploads/2016/06/shangri-la-hambantota-2-1024x720.jpg",
                     "https://sitecore-cd-imgr.shangri-la.com/MediaFiles/C/4/F/%7BC4F15FDD-A9E6-40AF-8588-F54308236327%7D202110_SLTR-Offers_Half-Board.jpg"
          ],
          "description": "Shangri-La’s Hambantota Golf Resort & Spa offers a luxurious escape with a perfect blend of relaxation, adventure, and wellness. Whether you're looking to play a round of golf, unwind at the spa, or explore Sri Lanka's natural beauty and wildlife, the resort provides a wide array of activities and amenities for all types of travelers. If you're looking for an ideal combination of luxury, nature, and local culture, Shangri-La Hambantota is a fantastic choice. Just a short drive from the resort, Yala National Park is famous for its leopard population, as well as elephants, crocodiles, and diverse birdlife. A major pilgrimage site, Kataragama is an important cultural and religious destination in southern Sri Lanka."
        }
      ]
   },

   {
    "id": 29,
    "name": "EKHO Safari Tissa",
    "location": "Tissamaharama",
    "rating": 4.5,
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/15/7c/c7/9d/swimming-pool.jpg?w=1200&h=-1&s=1",
    "details": "EKHO Safari Tissamaharama is a charming hotel located in the heart of Tissamaharama, near the famous Yala National Park in Sri Lanka. Known for its proximity to key wildlife destinations and tranquil lakeside setting, the hotel provides a comfortable base for nature lovers and safari enthusiasts. EKHO Safari Tissamaharama is set on the banks of the Tissa Wewa lake, offering scenic views of the water and surrounding landscapes. It’s a short drive from Yala National Park, making it an excellent base for wildlife safaris. The hotel combines modern comforts with a relaxed, nature-focused atmosphere, allowing guests to unwind while being surrounded by beautiful natural scenery.",
    "rooms": [
        {
          "image": ["https://www.ekhohotels.com/ekhosafari/wp-content/uploads/sites/3/2024/02/ekho-safari-gallery-rooms-01.webp",
                     "https://www.ekhohotels.com/ekhosafari/wp-content/uploads/sites/3/2024/02/ekho-safari-gallery-rooms-07.webp",
                     "https://www.ekhohotels.com/ekhosafari/wp-content/uploads/sites/3/2024/02/ekho-safari-gallery-suites-02.webp",
                     "https://www.kayak.com/rimg/himg/d7/91/1c/expedia_group-644961-0536df5a-834855.jpg?width=836&height=607&crop=true"
          ],
          "description": "EKHO Safari offers a variety of rooms that cater to both couples and families. The rooms are designed to provide comfort while allowing guests to enjoy the peaceful lakeside surroundings. EKHO Safari Tissamaharama offers a comfortable and tranquil lakeside retreat with easy access to Sri Lanka's top wildlife and cultural destinations. With spacious rooms, a beautiful pool, and excellent safari services, it’s ideal for travelers seeking a blend of relaxation and adventure. Whether you're there for a wildlife safari in Yala or simply to enjoy the serene beauty of Tissamaharama, EKHO Safari ensures a pleasant stay for both leisure and adventure travelers."
        }
      ]
   },

   {
    "id": 30,
    "name": "Jetwing Blue",
    "location": "Negombo",
    "rating": 4.4,
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/494005659.jpg?k=c01ffe539e9199ed868f9fb4793f663bfdc801705c13c2bb0eaf10957bda92fb&o=&hp=1",
    "details": "Jetwing Blue is a renowned luxury beachfront hotel located in Negombo, Sri Lanka. It is part of the Jetwing Hotels chain, which is well-known for its distinctive blend of eco-consciousness and luxury in Sri Lanka. Jetwing Blue offers a relaxing escape along the western coast of the island, with stunning views of the Indian Ocean. Situated right on Negombo Beach, it's just a short drive from Bandaranaike International Airport, making it convenient for travelers. Jetwing Blue is known for its combination of luxury, comfort, and personalized service, making it a popular choice for both leisure and business travelers looking for a beachside retreat in Sri Lanka.",
    "rooms": [
        {
          "image": ["https://www.jetwinghotels.com/jetwingblue/wp-content/uploads/sites/26/2023/09/Super-Deluxe-3-copy.jpg",
                     "https://www.jetwinghotels.com/jetwingblue/wp-content/uploads/sites/26/2017/12/blue-gallery-room-8.jpg",
                     "https://images.trvl-media.com/lodging/5000000/4040000/4031700/4031684/5118427c.jpg?impolicy=resizecrop&rw=575&rh=575&ra=fill",
                     "https://www.jetwinghotels.com/jetwingblue/wp-content/uploads/sites/26/2020/02/jetwing-blue-buffet.jpg"
          ],
          "description": "Jetwing Blue is designed to offer a luxurious, beachfront experience in Negombo with a variety of rooms and amenities that cater to different needs. Concierge and Tour Desk: Available for planning activities, transportation, and excursions. 24-Hour Room Service: For in-room dining options at any time of day. Laundry and Dry Cleaning: Offered for guests' convenience. Airport Transfer: Available upon request, given the proximity of Bandaranaike International Airport. Jetwing Blue features 120 rooms and suites with modern interiors, luxurious touches, and views of the Indian Ocean or the tropical surroundings."
        }
      ]
   },

   {
    "id": 31,
    "name": "Jetwing Ayurveda Pavilions",
    "location": "Negombo",
    "rating": 4.5,
    "image": "https://www.jetwinghotels.com/jetwingayurvedapavilions/wp-content/uploads/sites/30/2017/11/01-1.jpg",
    "details": "Jetwing Ayurveda Pavilions is a wellness retreat in Negombo, Sri Lanka, designed specifically for Ayurvedic healing and rejuvenation. It’s a part of the Jetwing Hotels group and offers a serene, holistic experience focusing on traditional Ayurvedic therapies in a tranquil and natural setting. Jetwing Ayurveda Pavilions is located just a short distance from Negombo Beach, offering a peaceful sanctuary away from the busier tourist spots. It is also conveniently close to the Bandaranaike International Airport, making it accessible for travelers. The hotel offers rooms and pavilions that are designed with a strong focus on relaxation, wellness, and comfort. Each accommodation type is inspired by traditional Sri Lankan architecture with open spaces that blend indoor luxury with outdoor serenity.",
    "rooms": [
        {
          "image": ["https://www.jetwinghotels.com/jetwingayurvedapavilions/wp-content/uploads/sites/30/2019/08/gallery-r-2.jpg",
                    "https://www.jetwinghotels.com/jetwingayurvedapavilions/wp-content/uploads/sites/30/2019/08/gallery-h-4.jpg",
                    "https://www.jetwinghotels.com/jetwingayurvedapavilions/wp-content/uploads/sites/30/2019/08/gallery-r-6.jpg",
                    "https://www.jetwinghotels.com/jetwingayurvedapavilions/wp-content/uploads/sites/30/2019/08/gallery-d-2.jpg"
          ],
          "description": "The rooms are designed with simplicity and tranquility in mind, incorporating traditional Sri Lankan architecture to complement the holistic wellness experience. Each room offers privacy and is equipped with modern amenities, along with facilities for in-room treatments. Private treatment area where Ayurvedic therapies can be performed. Open-air bathroom with luxury amenities. Large private garden with outdoor seating and areas for yoga or relaxation. Air conditioning, Wi-Fi, minibar, and tea/coffee making facilities. Ideal for couples or those looking for a secluded, peaceful retreat."
        }
      ]
   },

   {
    "id": 32,
    "name": "Jetwing Beach",
    "location": "Negombo",
    "rating": 4.5,
    "image": "https://www.jacadatravel.com/wp-content/uploads/2017/02/jetwing-house-exterior-1200x675.jpg",
    "details": "Jetwing Beach is a luxurious beachfront hotel located in Negombo, Sri Lanka, renowned for its elegant design, world-class service, and proximity to the beautiful Indian Ocean. As part of the prestigious Jetwing Hotels chain, it offers a tranquil escape for both leisure travelers and business guests. Here's a comprehensive overview of the rooms and amenities available at Jetwing Beach. Jetwing Beach offers 78 luxurious rooms and suites designed to blend modern comforts with Sri Lankan hospitality and stunning ocean views. Jetwing Beach in Negombo is a perfect blend of luxury, relaxation, and warm Sri Lankan hospitality. With its stunning beachfront location, range of dining options, wellness services, and activities, it offers a memorable experience for guests looking to relax by the Indian Ocean, explore Sri Lanka’s rich culture, or simply enjoy a luxurious beach getaway.",
    "rooms": [
        {
          "image": ["https://cf.bstatic.com/xdata/images/hotel/max1024x768/618788417.jpg?k=5741a427dd54ca883a2319f167747c16900077d3c847fcc582d6a13e8e3e450f&o=&hp=1",
                      "https://www.jetwinghotels.com/jetwingbeach/wp-content/uploads/sites/31/2019/08/gallery-r-3.jpg",
                      "https://www.jetwinghotels.com/jetwingbeach/wp-content/uploads/sites/31/2019/08/gallery-d-3.jpg",
                      "https://www.jetwinghotels.com/jetwingbeach/wp-content/uploads/sites/31/2017/12/gallery-5.jpg"
          ],
          "description": "Jetwing Beach offers 78 luxurious rooms and suites designed to blend modern comforts with Sri Lankan hospitality and stunning ocean views. The suites offer the most luxurious accommodation at Jetwing Beach with separate living and dining areas. Jetwing Beach provides a variety of world-class amenities and facilities to ensure guests have a comfortable and memorable stay."
        }
      ]
   },

   {
    "id": 33,
    "name": "Jetwing Sea",
    "location": "Negombo",
    "rating": 4.2,
    "image": "https://pix10.agoda.net/property/60405106/0/c9057dccbf47a058ed2b99b406105ab0.jpeg?ce=0&s=414x232",
    "details": "Jetwing Sea is a stylish beachfront hotel located in Negombo, Sri Lanka, offering a serene coastal retreat. As part of the Jetwing Hotels chain, it combines modern comforts with traditional Sri Lankan hospitality. This property is ideal for both leisure and business travelers, with its focus on providing a peaceful escape along the shores of the Indian Ocean. Jetwing Sea in Negombo offers a blend of relaxed luxury, Sri Lankan hospitality, and oceanfront beauty. With its comfortable rooms, gourmet dining options, and wellness-focused facilities, the hotel is ideal for those seeking both a beachside escape and a convenient location near Colombo. Whether you're interested in indulging in Ayurvedic spa treatments, enjoying water sports, or exploring the cultural richness of Negombo, Jetwing Sea provides a serene and luxurious base for your Sri Lankan getaway.",
    "rooms": [
        {
          "image": ["https://www.jetwinghotels.com/jetwingsea/wp-content/uploads/sites/27/2019/08/gallery-r-1.jpg",
                    "https://www.jetwinghotels.com/jetwingsea/wp-content/uploads/sites/27/2019/08/gallery-r-8.jpg",
                    "https://www.jetwinghotels.com/jetwingsea/wp-content/uploads/sites/27/2019/08/gallery-h-3.jpg",
                    "https://www.jetwinghotels.com/jetwingsea/wp-content/uploads/sites/27/2019/08/gallery-d-1.jpg"
          ],
          "description": "Jetwing Sea offers 83 well-appointed rooms and suites designed for comfort, relaxation, and scenic views of the ocean. Jetwing Sea offers a variety of dining experiences, focusing on fresh, local ingredients and ocean-inspired flavors. Jetwing Sea is designed to offer a comfortable, relaxing stay with a variety of facilities that cater to leisure and wellness."
        }
      ]
   },

   {
    "id": 34,
    "name": "Jetwing Lagoon",
    "location": "Negombo",
    "rating": 4.5,
    "image": "https://bmkltsly13vb.compat.objectstorage.ap-mumbai-1.oraclecloud.com/cdn.ft.lk/assets/uploads/image_437b75f466.jpg",
    "details": "Jetwing Lagoon is a luxury resort located in Negombo, Sri Lanka, and is known for its serene setting between the Negombo Lagoon and the Indian Ocean. Situated on the west coast of Sri Lanka, Negombo is a popular tourist destination known for its beaches, Dutch-era buildings, and vibrant culture. Between the Lagoon and the Ocean: Jetwing Lagoon is uniquely positioned between the tranquil waters of the Negombo Lagoon and the Indian Ocean, offering picturesque views of both.",
    "rooms": [
        {
          "image": ["https://www.jetwinghotels.com/jetwinglagoon/wp-content/uploads/sites/28/2017/12/Gallary-14.jpg",
                    "https://www.jetwinghotels.com/jetwinglagoon/wp-content/uploads/sites/28/2017/12/Gallary-15.jpg",
                    "https://www.jetwinghotels.com/jetwinglagoon/wp-content/uploads/sites/28/2017/12/Gallary-16.jpg",
                    "https://cdn5.travelconline.com/images/fit-in/2000x0/filters:quality(75):strip_metadata():format(webp)/https%3A%2F%2Fi.travelapi.com%2Flodging%2F5000000%2F4880000%2F4880000%2F4879990%2Fbab4dcf5_z.jpg"
          ],
          "description": "The resort is designed by renowned Sri Lankan architect Geoffrey Bawa, who is celebrated for pioneering 'tropical modernism'. The minimalist design of Jetwing Lagoon is inspired by local materials and natural surroundings, blending traditional aesthetics with modern luxury. The resort boasts one of the largest swimming pools in Sri Lanka, measuring about 100 meters, offering guests a stunning view while they swim. The resort features luxurious rooms and suites, each offering modern amenities and a tranquil environment. Rooms typically provide views of the lagoon or the garden. Jetwing Lagoon is ideal for travelers seeking relaxation, luxury, and a close connection with nature in Sri Lanka."
        }
      ]
   },

   {
    "id": 35,
    "name": "Hotel J Negombo",
    "location": "Negombo",
    "rating": 3.8,
    "image": "https://static.where-e.com/Sri_Lanka/Hotel-J-Negombo_f8c2364b39d18c1a36c61d8508e2d6a3.jpeg",
    "details": "Hotel J Negombo is a budget-friendly hotel located in the coastal town of Negombo, Sri Lanka. It is part of the Jetwing group, a well-known hospitality brand in Sri Lanka, but focuses on providing affordable, comfortable accommodation for travelers. Hotel J is conveniently located near the Negombo beach, making it an ideal spot for travelers looking to enjoy the sun, sea, and sand. The hotel is just a 20-minute drive from the Bandaranaike International Airport (CMB), making it an accessible option for travelers arriving in or leaving Sri Lanka. Hotel J offers clean, modern, and minimalist rooms. Rooms are designed to be functional and comfortable, perfect for travelers on a budget who still want a good quality stay. In summary, Hotel J in Negombo is an ideal choice for travelers looking for a cost-effective stay with access to both the beach and the city’s amenities, while still enjoying the comforts of a well-maintained property.",
    "rooms": [
        {
          "image":[ "https://hotelj.wpenginepowered.com/negombo/wp-content/uploads/sites/2/nggallery/negombo/hotelj-nehombo-G-4.jpg",
                    "https://dayouting.lk/img_uploads/uploads/8366831696396499min.jpg",
                    "https://images.trvl-media.com/lodging/9000000/8060000/8053900/8053899/6d2a4dc7.jpg?impolicy=fcrop&w=1200&h=800&p=1&q=medium",
                    "https://hotelj.wpenginepowered.com/negombo/wp-content/uploads/sites/2/nggallery/negombo/hotelj-nehombo-G-8.jpg"
          ],
          "description": "Overlooking the ocean, offering a relaxing experience with comfortable sun loungers around the pool area. Ideal for both lounging and casual swimming. Offers a mix of local Sri Lankan cuisine and international dishes. You can expect options like fresh seafood, traditional curries, and Western-style meals. Meals are served à la carte or buffet-style depending on guest preferences and occupancy. Hotel J Negombo offers a clean, comfortable, and budget-friendly environment. While it focuses on simplicity, the hotel provides key amenities like a pool, beach access, and friendly service, making it ideal for budget-conscious travelers who want a good location near the beach and airport."
        }
      ]
   },

   {
    "id": 36,
    "name": "Heritance Kandalama",
    "location": "Dambulla",
    "rating": 4.7,
    "image": "https://archives1.dailynews.lk/sites/default/files/news/2019/06/25/z_pF-02-Heritance.jpg",
    "details": "Heritance Kandalama is a luxurious eco-friendly hotel located near Dambulla, Sri Lanka, renowned for its unique design and harmonious integration with nature. The hotel is set in a picturesque setting, nestled between the lush jungles and overlooking the Kandalama Lake and the surrounding mountains.",
    "rooms": [
        {
          "image": ["https://www.heritancehotels.com/kandalama/wp-content/uploads/sites/18/2019/07/Deluxe_King_Room.jpg",
                    "https://www.heritancehotels.com/kandalama/wp-content/uploads/sites/18/2019/07/Deluxe_Bathroom_1.jpg",
                    "https://www.heritancehotels.com/kandalama/wp-content/uploads/sites/18/2020/06/HK_LUXURY-ROOM-307-ARP.LK-3-1.jpg",
                    "https://www.heritancehotels.com/kandalama/wp-content/uploads/sites/18/2019/07/Deluxe_Balcony_4.jpg"
          ],
          "description": "Designed by renowned Sri Lankan architect Geoffrey Bawa, the hotel is considered a masterpiece of tropical modernism and sustainable architecture. The hotel has received international acclaim for its environmentally conscious design. It operates with a strong focus on sustainability, featuring waste management systems, water conservation practices, and an energy-efficient structure. Heritance Kandalama is a perfect destination for travelers seeking both luxury and a deep connection with nature, making it a leading eco-resort in Sri Lanka."
        }
      ]
   },

   {
    "id": 37,
    "name": "Ahungalla Heritance",
    "location": "Ahungalla",
    "rating": 4.7,
    "image": "https://us.lakpura.com/cdn/shop/files/LK15001F9C-01-E.jpg?v=1691404889",
    "details": "Heritance Ahungalla is a luxury beachfront resort located on the southern coast of Sri Lanka, in the town of Ahungalla, known for its pristine beaches and stunning ocean views. The hotel combines elegant design, modern amenities, and a strong commitment to sustainability, making it a premier destination for travelers seeking both relaxation and luxury.",
    "rooms": [
        {
          "image": ["https://www.heritancehotels.com/ahungalla/wp-content/uploads/sites/20/2019/10/accomodation-7.jpg",
                     "https://www.heritancehotels.com/ahungalla/wp-content/uploads/sites/20/2024/05/Heritance_Ahungalla_011-1.jpg",
                     "https://www.heritancehotels.com/ahungalla/wp-content/uploads/sites/20/2019/10/accomodation-2.jpg",
                     "https://www.heritancehotels.com/ahungalla/wp-content/uploads/sites/20/2019/10/dinning-3.jpg"
          ],
          "description": "The resort is situated on a stunning stretch of golden sand beach, offering guests direct access to the Indian Ocean and a serene tropical environment. The resort offers a variety of luxury rooms and suites, most with private balconies or terraces offering views of the ocean or landscaped gardens. One of the highlights of the resort is its large infinity pool, which seems to merge with the horizon, offering stunning ocean views. The pool area is surrounded by comfortable lounge chairs and shaded areas. Heritance Ahungalla provides a perfect blend of luxury, comfort, and natural beauty. With its exceptional dining, modern amenities, wellness options, and eco-conscious philosophy, it is a top destination for both relaxation and adventure in Sri Lanka."
        }
      ]
   },

   {
    "id": 38,
    "name": "Hotel RIU Sri Lanka",
    "location": "Ahungalla",
    "rating": 4.5,
    "image": "https://bmkltsly13vb.compat.objectstorage.ap-mumbai-1.oraclecloud.com/cdn.ft.lk/ftadmin/wp-content/uploads/2017/07/05214958/Untitled-117.jpg",
    "details": "Hotel Riu Sri Lanka is a luxurious, all-inclusive beachfront resort located in Ahungalla, on Sri Lanka’s southwestern coast. It is part of the RIU Hotels & Resorts chain, known for providing high-quality service and comprehensive amenities for guests seeking relaxation and entertainment in an exotic location. The hotel is located directly on Ahungalla Beach, offering easy access to the golden sands and clear waters of the Indian Ocean. The resort is surrounded by tropical landscapes, and its beachfront location provides stunning sea views and the opportunity to enjoy the natural beauty of Sri Lanka’s coast.",
    "rooms": [
        {
          "image": ["https://cf.bstatic.com/xdata/images/hotel/max1024x768/94835371.jpg?k=23d8b402fc023054f76e2ad63e80d951183bb2f467bd62cc31bd4920649c0722&o=&hp=1",
                    "https://www.riu.com/dam/02-RIU-Espanol/Building-Blocks/04-Paises/06-Sri-Lanka/01-Ahungalla/01-Hotel-Riu-Sri-Lanka/Imagenes/001-Piscina-Exterior/pool-riu-sri-lanka-2.jpg",
                    "https://media.tuicontent.nl/7AF/7AF2B73E8FEAEEA695FAA8AA71B6C749.jpg",
                    "https://photos.hotelbeds.com/giata/bigger/12/120069/120069a_hb_r_008.jpg"
          ],
          "description": "The hotel has 501 rooms, ranging from standard rooms to larger suites, all designed with modern decor and comfort in mind. Serves buffet-style international cuisine with live cooking stations for breakfast, lunch, and dinner. The restaurant offers a variety of options, including local Sri Lankan dishes. The resort has three outdoor pools, including a large infinity pool overlooking the beach, a pool with a swim-up bar, and a separate children’s pool. Hotel RIU Sri Lanka is a top choice for travelers looking for a comprehensive, all-inclusive experience in Sri Lanka."
        }
      ]
   },

   {
    "id": 39,
    "name": "Grand Tamarind Lake",
    "location": "Tissamaharama",
    "rating": 4.3,
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/262167510.jpg?k=da68b582c65fd020c82de85bb0f16c0b0ef274bc499a008e04d9629399b09385&o=&hp=1",
    "details": "Grand Tamarind Lake is a luxury resort located near the Tissamaharama Lake in the southern region of Sri Lanka. This scenic and tranquil location provides stunning views of the lake and its surrounding lush greenery, making it a perfect destination for nature lovers, couples, and families seeking relaxation. The resort offers modern amenities and excellent service while maintaining a peaceful atmosphere for its guests.",
    "rooms": [
        {
          "image": ["https://cf.bstatic.com/xdata/images/hotel/max1024x768/262168506.jpg?k=305ac2a96e8bf61c704d6ac1484fdc787332915a8c0301157b01ba5c02f60e3d&o=&hp=1",
                    "https://www.tripavi.com/wp-content/uploads/2020/07/Grand-Tamarind-lake-pool-area-870x555.jpg",
                    "https://q-xx.bstatic.com/xdata/images/hotel/max500/262167485.jpg?k=9ee63fb028f2d4622696a7f863f1a37588a18852a037790dd66829a9d6e9c165&o=",
                    "https://q-xx.bstatic.com/xdata/images/hotel/max1024x768/499108892.jpg?k=494849ae0d9a07a1532a65489b2124941e2a9c09ec41b5251f4c252712458e0c&o=&s=1024x"
          ],
          "description": "The resort is situated near the beautiful Tissamaharama Lake, offering guests spectacular views of the lake and surrounding landscapes. It is an ideal base for exploring nearby natural attractions such as Yala National Park, Bundala National Park, and Kataragama, one of Sri Lanka's most sacred pilgrimage sites. The hotel has a beautiful infinity pool overlooking the lake, allowing guests to relax and cool off while taking in the serene views. The pool area is equipped with sun loungers and umbrellas for guests who prefer to relax by the water. Grand Tamarind Lake offers a tranquil and luxurious experience with a strong connection to nature. The combination of lakeside views, luxurious accommodations, excellent dining, and access to wildlife and cultural sites makes it a perfect destination for both relaxation and adventure in southern Sri Lanka."
        }
      ]
   },

   {
    "id": 40,
    "name": "Mandara Rosen Kataragama",
    "location": "Kataragama",
    "rating": 4.1,
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/09/8a/ad/96/mandara-rosen.jpg?w=500&h=-1&s=1",
    "details": "Mandara Rosen Kataragama is a stylish 4-star hotel located in Kataragama, Sri Lanka, a town famous for its religious significance and close proximity to wildlife parks. The hotel offers a blend of modern luxury and traditional charm, providing a serene retreat for travelers visiting the sacred town or exploring the nearby natural attractions.",
    "rooms": [
        {
          "image": ["https://us.lakpura.com/cdn/shop/files/LK15000D80-06-E.jpg?v=1701342875&width=1445",
                    "https://www.ghrshotels.com/cmn/img/htl/1964/1964100/1964100p3b.jpg",
                    "https://cf.bstatic.com/xdata/images/hotel/max1024x768/74570665.jpg?k=7e21191ea0e6fd547ba387be0ab2b33f9b187c19907514cd93c213d0109e6979&o=&hp=1",
                    "https://cf.bstatic.com/xdata/images/hotel/max1024x768/74570856.jpg?k=cb1408e8cd4105a274c6f452203648e9f04660aedb4c635fca48950c4bbab75e&o=&hp=1"
          ],
          "description": "The hotel is located just a few minutes from the Kataragama Temple, a major pilgrimage site for Buddhists, Hindus, and Muslims. This makes it an ideal location for guests visiting for religious or spiritual purposes. Mandara Rosen is also near popular wildlife parks, such as Yala National Park and Udawalawe National Park, making it a great base for wildlife safaris. Mandara Rosen features a large outdoor swimming pool, which is one of the largest in the Kataragama area. Mandara Rosen Kataragama offers a unique combination of spiritual, natural, and luxurious experiences. With its proximity to the Kataragama Temple and national parks, it serves as an ideal location for both religious visitors and adventure seekers."
        }
      ]
   },

   {
    "id": 41,
    "name": "Hotel Sudu Araliya",
    "location": "Polonnaruwa",
    "rating": 3.9,
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/182078629.jpg?k=7e8657d8dc8ab04c9cde565ef20ae765d14f91f0fe4c4ba8f0a5e0f4649f1464&o=&hp=1",
    "details": "Hotel Sudu Araliya is a well-known hotel located in Polonnaruwa, a UNESCO World Heritage site in Sri Lanka. The hotel is situated near the beautiful Parakrama Samudraya (Sea of Parakrama), offering stunning views of the vast ancient reservoir and easy access to the rich historical and cultural landmarks of Polonnaruwa. The hotel is located on the banks of the Parakrama Samudraya, one of the largest ancient irrigation reservoirs in Sri Lanka, offering peaceful views and a serene atmosphere.",
    "rooms": [
        {
          "image": ["https://images.trvl-media.com/lodging/12000000/11950000/11941100/11941026/d8a8037f.jpg?impolicy=fcrop&w=1200&h=800&p=1&q=medium",
                    "https://cf.bstatic.com/xdata/images/hotel/max1024x768/82519134.jpg?k=16997869ba502c2dac441a268735fbc0e5414d5c47b02cee91ed53fc39c9e358&o=&hp=1",
                    "https://cf.bstatic.com/xdata/images/hotel/max1024x768/130628518.jpg?k=142daf9334a816ef0d701359eae328ff393dc73ab1104e88128ef6d0475789be&o=&hp=1",
                    "https://cf.bstatic.com/xdata/images/hotel/max1024x768/182078095.jpg?k=7a800c5656d861a2ce20909beb2ae7bf6dee38b6723353e0f4ac06742b7d05cf&o=&hp=1"
          ],
          "description": "The hotel offers a variety of rooms and suites, all designed to provide comfort and a blend of modern and traditional aesthetics. Hotel Sudu Araliya features a large outdoor swimming pool surrounded by sun loungers and parasols. The pool area offers beautiful views of the lake and is perfect for relaxation after a day of sightseeing. Hotel Sudu Araliya offers a combination of modern comforts and close proximity to Sri Lanka’s rich cultural heritage, particularly the ancient city of Polonnaruwa. With its beautiful lakeside setting, large pool, wellness options, and accessibility to wildlife and historical excursions, it provides a serene and enriching experience for both leisure and business travelers alike."
        }
      ]
   },

   {
    "id": 42,
    "name": "EKHO Lake House",
    "location": "Polonnaruwa",
    "rating": 4.4,
    "image": "https://www.ekhohotels.com/ekholakehouse/wp-content/uploads/sites/4/2024/02/ekho-lake-house-public-spaces-01.webp",
    "details": "EKHO Lake House Polonnaruwa is a luxury boutique hotel located on the shores of the ancient Parakrama Samudraya (Sea of Parakrama) in Polonnaruwa, Sri Lanka. Known for its rich historical significance and tranquil setting, the hotel offers a blend of modern luxury with historical charm, making it an ideal destination for travelers looking to explore the ancient city of Polonnaruwa or enjoy a peaceful retreat by the lake.",
    "rooms": [
        {
          "image": ["https://www.ekhohotels.com/ekholakehouse/wp-content/uploads/sites/4/2024/02/ekho-lake-house-deluxe-header.webp",
                    "https://www.ekhohotels.com/ekholakehouse/wp-content/uploads/sites/4/2024/02/ekho-lake-house-facilities-01.webp",
                    "https://www.ekhohotels.com/ekholakehouse/wp-content/uploads/sites/4/2024/02/ekho-lake-house-rooms-05.webp",
                    "https://www.ekhohotels.com/ekholakehouse/wp-content/uploads/sites/4/2024/02/ekho-lake-house-dining-01-1.webp"
          ],
          "description": "The hotel is situated right on the banks of the Parakrama Samudraya, offering stunning views of the lake, with its calm waters creating a peaceful and serene atmosphere. EKHO Lake House features a lovely outdoor swimming pool, overlooking the lake. The pool area is equipped with sun loungers and umbrellas, offering a peaceful spot to relax and enjoy the surroundings. EKHO Lake House Polonnaruwa offers a luxurious and peaceful retreat in one of Sri Lanka’s most historically significant locations. The combination of its stunning lakefront setting, proximity to ancient ruins, and elegant accommodations makes it a perfect choice for travelers looking to immerse themselves in Sri Lanka’s rich cultural heritage while enjoying modern comforts."
        }
      ]
   },

   {
    "id": 43,
    "name": "W15 Weligama",
    "location": "Weligama",
    "rating": 4.2,
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/600913140.jpg?k=a1458d3c207f0b1ad6a7dedfaccf3fc330b4d3dc8d30ffe18c11d0088d0998c7&o=&hp=1",
    "details": "W15 Weligama is a stylish beachfront boutique hotel located in Weligama, on Sri Lanka’s south coast. Known for its chic design and laid-back ambiance, W15 offers a blend of luxury and relaxation, making it a popular choice for travelers seeking a beachside escape. The hotel is especially popular among surfers due to its proximity to Weligama’s famous surf spots. W15 is located directly on Weligama Beach, a long sandy beach known for its safe and consistent surf, especially ideal for beginners.",
    "rooms": [
        {
          "image": ["https://cf.bstatic.com/xdata/images/hotel/max1024x768/420349137.jpg?k=3dffee72ca38607d4f5cd7df666bb309854d8007c7080e1498788f0608183c9d&o=&hp=1",
                    "https://images.trvl-media.com/lodging/12000000/11570000/11560800/11560777/af79d6a8.jpg?impolicy=fcrop&w=1200&h=800&p=1&q=medium",
                    "https://images.trvl-media.com/lodging/12000000/11570000/11560800/11560777/675fa117.jpg?impolicy=resizecrop&rw=575&rh=575&ra=fill",
                    "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/06/90/b9/a2.jpg"
          ],
          "description": "W15 Weligama offers luxury rooms with contemporary décor, blending minimalist design with comfort. The rooms are designed with a light, airy feel that complements the beachside location. The hotel’s main restaurant offers a fusion of local Sri Lankan and international cuisine. The menu emphasizes fresh, seasonal ingredients, especially seafood, sourced from the nearby waters. W15 Weligama has a stylish outdoor infinity pool that overlooks the beach. Surrounded by sun loungers and shaded areas, the pool provides a perfect spot to relax and enjoy the beachfront views. W15 Weligama offers a chic, relaxing retreat on one of Sri Lanka’s most famous beaches. With its luxurious accommodations, beachfront dining, and prime location for surfing and other water sports, it caters to both adventure seekers and those looking for a peaceful getaway."
        }
      ]
   },

   {
    "id": 44,
    "name": "EKHO Weligama",
    "location": "Weligama",
    "rating": 3.5,
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/208600274.jpg?k=70fa60af121bc3d52c57953382e5ace105d294fea2be409de42aa9c7d3f18721&o=&hp=1",
    "details": "EKHO Weligama is a charming boutique hotel located in Weligama, a laid-back coastal town on Sri Lanka’s southern coast, known for its beautiful beaches and excellent surf spots. EKHO Weligama offers a mix of comfort and personalized service, making it a great option for travelers looking to relax by the beach while enjoying modern amenities and local experiences.",
    "rooms": [
        {
          "image": ["https://www.ekhohotels.com/ekhoweligama/wp-content/uploads/sites/7/2024/02/ekho-weligama-gallery-rooms-05.webp",
                    "https://www.ekhohotels.com/ekhoweligama/wp-content/uploads/sites/7/2024/02/ekho-weligama-gallery-public-places-01.webp",
                    "https://www.ekhohotels.com/ekhoweligama/wp-content/uploads/sites/7/2024/02/ekho-weligama-gallery-rooms-02.webp",
                    "https://www.chcplc.com/wp-content/uploads/2023/11/ekho-surf-gallery-011.jpg"
          ],
          "description": "EKHO Weligama is located near Weligama Beach, a popular destination for both surfers and beach lovers. The hotel is ideally situated for easy access to the town’s surf spots, beachside activities, and nearby attractions like Mirissa and Galle. EKHO Weligama offers stylish and comfortable rooms designed with modern decor, ensuring a relaxing environment for guests. The hotel featurEKHO Weligama is a stylish yet laid-back boutique hotel perfect for travelers seeking a beachside retreat with modern amenities. The hotel’s beachfront location, easy access to surfing and water sports, and proximity to key attractions like Mirissa and Galle Fort make it an excellent choice for both adventure and relaxationes an outdoor swimming pool, providing guests with an alternative to the beach."
        }
      ]
   },

   {
    "id": 45,
    "name": "Mermaid Hotel & Club",
    "location": "Negombo",
    "rating": 4.4,
    "image": "https://images.trvl-media.com/lodging/3000000/2230000/2222500/2222414/6c7ce1e1.jpg?impolicy=resizecrop&rw=575&rh=575&ra=fill",
    "details": "Mermaid Hotel & Club is a charming beachfront hotel located in Negombo, Sri Lanka, known for its welcoming atmosphere, lush gardens, and excellent service. Situated along the stunning Negombo Beach, this hotel provides guests with a tranquil retreat ideal for relaxation and exploration of the beautiful coastal area. The hotel is located directly on Negombo Beach, offering guests easy access to the sandy shores and beautiful sunsets.",
    "rooms": [
        {
          "image": ["https://r1imghtlak.mmtcdn.com/9885ebc4a55011ee984f0a58a9feac02.jpg",
                     "https://s.joinup.lv/uploads/hotel/6666/rooms/original/mermaidhotel14-min.jpg",
                     "https://www.ekhohotels.com/ekhoweligama/wp-content/uploads/sites/7/2024/02/ekho-weligama-gallery-dining-05.webp",
                     "https://www.ekhohotels.com/ekhoweligama/wp-content/uploads/sites/7/2024/02/ekho-weligama-gallery-public-places-05.webp"
          ],
          "description": "The hotel offers a variety of accommodations, including Standard Rooms, Superior Rooms, Family Rooms, and Suites. Each room is designed for comfort and relaxation, featuring a blend of modern and traditional decor. The hotel features a restaurant that serves a selection of local and international cuisine, focusing on fresh seafood and Sri Lankan specialties. Guests can enjoy meals in a beautiful setting overlooking the ocean. Mermaid Hotel & Club has a large outdoor swimming pool surrounded by sun loungers, making it an ideal spot for relaxation and enjoying the tropical sun. Whether lounging by the pool, savoring delicious cuisine, or exploring the vibrant marine life, visitors will find a memorable experience at Mermaid Hotel & Club."
        }
      ]
   },


   {
    "id": 46,
    "name": "Amaranthé Bay Resort & Spa",
    "location": "Trincomalee",
    "rating": 4.5,
    "image": "https://www.reddottours.com/uploads/Accommodation/amaranthe-bay-resort-and-spa/Amaranthe-Bay-Resort-and-Spa_ProfilePage_Header_01.jpg",
    "details": "Amaranthé Bay Resort & Spa is a luxury boutique resort located in Uppuveli, Trincomalee, on the northeastern coast of Sri Lanka. Known for its tranquil setting, close proximity to pristine beaches, and a focus on relaxation and wellness, Amaranthé Bay offers a peaceful retreat with modern amenities and easy access to the region’s natural beauty and cultural attractions.",
    "rooms": [
        {
          "image": ["https://images.trvl-media.com/lodging/13000000/12640000/12638900/12638841/475fe2c3.jpg?impolicy=fcrop&w=1200&h=800&p=1&q=medium",
                     "https://q-xx.bstatic.com/xdata/images/hotel/max500/46093236.jpg?k=cc6de8b85cc08ef1f02087467f01dc0e66eb56cb8f57403e7d5ae7a1938751c8&o=",
                     "https://cf.bstatic.com/xdata/images/hotel/max1024x768/46093635.jpg?k=24197139fb4e372f29f91d81855beb7b87659631f0835047fcffcc6b2fe0126c&o=&hp=1",
                     "https://cf.bstatic.com/xdata/images/hotel/max1024x768/203025051.jpg?k=abcfb7e8182480c921671b44a7404824790f65fdb0cedaa94a536aa22ee08943&o=&hp=1"
          ],
          "description": "Amaranthé Bay Resort & Spa offers a perfect balance of luxury, relaxation, and adventure. With its upscale accommodations, exceptional dining, and wellness facilities, guests can enjoy a peaceful escape while having access to thrilling activities like diving, whale watching, and exploring Trincomalee’s rich history and natural beauty. Whether you’re seeking a romantic getaway, a family vacation, or a wellness retreat, Amaranthé Bay provides a serene and luxurious environment for all travelers."
        }
      ]
   },


   {
    "id": 47,
    "name": "98 Acres Resort & Spa",
    "location": "Ella",
    "rating": 4.6,
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/123777522.jpg?k=d68c52c58bdec8f871e51d89c80a0ac988559b40f89423842a52ea096e967d37&o=&hp=1",
    "details": "98 Acres Resort & Spa is a luxurious boutique hotel nestled in the scenic hills of Ella, Sri Lanka. This resort is famous for its stunning views of the surrounding tea plantations, lush greenery, and iconic natural landmarks like Little Adam’s Peak. Situated in the heart of Sri Lanka's tea country, in Ella, known for its spectacular landscapes and mild climate.",
    "rooms": [
        {
          "image":[ "https://www.resort98acres.com/wp-content/uploads/2014/10/gallery-accommodation-6.jpg",
                    "https://cf.bstatic.com/xdata/images/hotel/max1024x768/123777542.jpg?k=455473e59ddeb7fc70726d0cf4967d4140ead2a6efb8e7a059b09bd8f58372a8&o=&hp=1",
                    "https://cf.bstatic.com/xdata/images/hotel/max1024x768/216018012.jpg?k=7d33fe15821933b94126861adf07201143a68840d71d5861e6dd40d9897e7532&o=&hp=1",
                    "https://cf.bstatic.com/xdata/images/hotel/max1024x768/216018053.jpg?k=6669931aba013f309145b0f8b0f88fc669bace3bcf01f3ce9db2672003f3ae9f&o=&hp=1"
          ],
          "description": "Offers panoramic vistas of misty mountains, tea plantations, and nearby attractions such as Little Adam’s Peak, which is a short hike away. The resort is built on a 98-acre tea estate, and the rooms, or chalets, are designed using eco-friendly materials like recycled wood and railway sleepers. They offer modern amenities while maintaining a rustic and natural ambiance. The resort is designed to blend with its natural surroundings and uses sustainable practices such as energy-efficient architecture and eco-friendly materials."
        }
      ]
   },


   {
    "id": 48,
    "name": "Cinnamon Bentota Beach",
    "location": "Bentota",
    "rating": 4.7,
    "image": "https://hi-cdn.t-rp.co.uk/images/hotels/2072960/0?width=768&height=500&crop=true&quality=80",
    "details": "Cinnamon Bentota Beach is a luxurious, heritage-inspired beachfront resort located in Bentota, a picturesque coastal town on Sri Lanka’s southwest coast. Managed by the Cinnamon Hotels & Resorts group, it is one of the most iconic properties in the country, known for its stunning architecture, rich history, and prime location between the Bentota River and the Indian Ocean. The resort provides a perfect blend of beach relaxation, luxury, and outdoor adventure.",
    "rooms": [
        {
          "image": ["https://cf.bstatic.com/xdata/images/hotel/max1024x768/586403876.jpg?k=2bf3cb6c004bc32c24775f12176262539b15125ae8cf36316508c37fa6d4ff2b&o=&hp=1",
                     "https://cf.bstatic.com/xdata/images/hotel/max1024x768/490662097.jpg?k=f98050b8d2af08d85c24745bb9823be96205e4041715c19993274ac3d84dade0&o=&hp=1",
                     "https://www.reddottours.com/uploads/Accommodation/Cinnamon-Bentota-Beach/cinnamon-bentota-beach-gallery-pop-up%20(22).jpg",
                     "https://cf.bstatic.com/xdata/images/hotel/max1024x768/252350450.jpg?k=aef55f404aa70cfca170b96b7101023bd848d998abed0f75763fb582d8a50f7d&o=&hp=1"
          ],
          "description": "The resort is beautifully positioned on a strip of land between the Indian Ocean and the Bentota River, offering both beach and riverside views. Bentota is approximately a 90-minute drive from Colombo, making it easily accessible for travelers. The resort offers a variety of room types, including Deluxe Rooms, Superior Rooms, and Luxury Suites, all with sea, river, or garden views. Cinnamon Bentota Beach is a sophisticated blend of luxury, culture, and nature, making it one of the premier destinations on Sri Lanka’s southwestern coast for relaxation, exploration, and adventure."
        }
      ]
   },

   
   {
    "id": 49,
    "name": "Jetwing Saman Villas",
    "location": "Bentota",
    "rating": 4.5,
    "image": "https://images2.bovpg.net/r/media/1/9/0/1/1/901147.jpg",
    "details": "Jetwing Saman Villas is an exclusive luxury boutique hotel located in Bentota, along Sri Lanka’s stunning southwest coastline. This resort is known for offering a secluded, tranquil escape for discerning travelers looking for privacy, breathtaking ocean views, and personalized service. Jetwing Saman Villas is perched on a cliff, giving guests sweeping views of the Indian Ocean on one side and the lush tropical landscape on the other.",
    "rooms": [
        {
          "image": ["https://www.jetwinghotels.com/jetwingsamanvillas/wp-content/uploads/sites/44/2022/08/Room-Images-8.jpg",
                      "https://cf.bstatic.com/xdata/images/hotel/max1024x768/587133885.jpg?k=29ef792cd4f273d2b3aa7945c6851f9865e9867e2f9b7d55f7b819ec8e457d1d&o=&hp=1",
                      "https://www.dotwconnect.com/poze_hotel/41/41114/gfKd0KPX_4cf6bbd0622ddb1f84d8ad519cbe0a80.jpg",
                      "https://cf.bstatic.com/xdata/images/hotel/max1024x768/587133746.jpg?k=931a2aa636e06253372e9af9d51e2dd5589b598060adba6f344ce194f2091b44&o=&hp=1"
          ],
          "description": "Jetwing Saman Villas is located in Aturuwella, near Bentota, which is around a two-hour drive from Colombo and about 90 minutes from the Bandaranaike International Airport. Its unique location on a rocky promontory between two golden sandy beaches ensures a high level of privacy and unparalleled sea views. Jetwing Saman Villas is designed exclusively with suites, offering spacious and luxurious accommodations, most of which are sea-facing and come with private balconies or terraces. The rooms are elegantly furnished with a fusion of modern and traditional Sri Lankan aesthetics. Jetwing Saman Villas is renowned for its unmatched elegance, exclusivity, and serene atmosphere, making it one of the premier luxury resorts in Sri Lanka."
        }
      ]
   },


   {
    "id": 50,
    "name": "EKHO Surf Bentota",
    "location": "Bentota",
    "rating": 4.2,
    "image": "https://s.joinup.lv/uploads/hotel/8585/gallery/original/The-Ekho-Surf-Hotel4-33-min.jpg",
    "details": "EKHO Surf Bentota is a vibrant beachfront resort located along the golden sands of Bentota Beach, one of Sri Lanka’s most popular coastal destinations. Known for its casual elegance and prime location, the resort offers a perfect blend of comfort, relaxation, and activities for families, couples, and adventure seekers alike. With panoramic ocean views and direct access to the beach, EKHO Surf is a great option for travelers looking to experience the beauty of Sri Lanka’s southwest coast. Situated on Bentota Beach, about a 90-minute drive south of Colombo and roughly two hours from Bandaranaike International Airport, EKHO Surf is easily accessible while still offering a peaceful, beachfront retreat.",
    "rooms": [
        {
          "image": ["https://www.ekhohotels.com/ekhosurf/wp-content/uploads/sites/2/2023/12/bedroom-hero.jpg",
                     "https://www.chcplc.com/wp-content/uploads/2023/11/ekho-surf-gallery-012.jpg",
                     "https://www.chcplc.com/wp-content/uploads/2023/11/ekho-surf-gallery-015.jpg",
                     "https://www.ekhohotels.com/ekhosurf/wp-content/uploads/sites/2/2023/11/ekho-dining.jpg"
          ],
          "description": "The resort has a variety of room options, including Deluxe Ocean View Rooms and Superior Ocean View Rooms. EKHO Surf Bentota is a well-rounded resort that caters to various types of travelers, from families to couples and adventure seekers. With its beautiful beach location, comfortable accommodations, and a wide range of activities, it offers a memorable Sri Lankan vacation experience in the heart of the southwest coast."
        }
      ]
   },


   {
    "id": 51,
    "name": "Sigiriya Jungles",
    "location": "Sigiriya",
    "rating": 4.2,
    "image": "https://archives1.dailynews.lk/sites/default/files/styles/node-detail/public/news/2022/11/01/17-5.jpg?itok=NV7laXwn",
    "details": "Sigiriya Jungles is a stunning eco-lodge situated near the iconic Sigiriya Rock Fortress in Sri Lanka. Nestled within a lush, natural environment, the lodge provides guests with an immersive experience in nature, combining luxury accommodations with sustainable tourism practices. The setting is perfect for travelers looking to explore the Cultural Triangle, witness wildlife, and enjoy the tranquility of the Sri Lankan countryside.",
    "rooms": [
        {
          "image":[ "https://d104tpg70nvstz.cloudfront.net/2016/04/deluxe-header-mob-2-1.jpg",
                    "https://d104tpg70nvstz.cloudfront.net/2016/04/deluxe-header-mob-3.jpg",
                    "https://d104tpg70nvstz.cloudfront.net/2019/03/lobby.jpg",
                    "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/13/30/a9/43/sri-lankan-cuisine.jpg?w=700&h=-1&s=1"
          ],
          "description": "Sigiriya Jungles is located about 1.5 kilometers from Sigiriya Rock Fortress, making it an ideal base for visiting this UNESCO World Heritage Site. The lodge is approximately a 4-hour drive from Colombo and Bandaranaike International Airport. Sigiriya Jungles offers a unique blend of luxury, nature, and cultural experiences in the heart of Sri Lanka's Cultural Triangle. With its eco-friendly focus, comfortable accommodations, and proximity to historical attractions, the lodge provides guests with an unforgettable experience of Sri Lanka's natural and cultural heritage. Whether you’re exploring Sigiriya Rock, going on a wildlife safari, or simply relaxing in the lush surroundings, Sigiriya Jungles ensures a memorable stay that connects you with the beauty of nature."
        }
      ]
   },


   {
    "id": 52,
    "name": "8+ Plus Motels",
    "location": "Negombo",
    "rating": 4.4,
    "image": "https://q-xx.bstatic.com/xdata/images/hotel/max500/508161190.jpg?k=5a2e32222c2f8ed3a33c967fc09244fc9c4b8782c7aae6a50de893db8c1f3aa0&o=",
    "details": "8+ Plus Motels is a chain of motels located in Sri Lanka, known for offering budget-friendly accommodations with essential amenities and a focus on comfort and convenience. The motels cater to a variety of travelers, including families, backpackers, and those looking for affordable lodging while exploring different parts of the country.",
    "rooms": [
        {
          "image": ["https://cf.bstatic.com/xdata/images/hotel/max1024x768/332115075.jpg?k=8a2a411192cf16a83dd2f8eb37b36d9228bb7cadf806bb322ef7a3ef891ff6a8&o=&hp=1",
                    "https://cf.bstatic.com/xdata/images/hotel/max1024x768/338393316.jpg?k=897b0f4255a0306a5cf0664fb429e8a635ebc98b08c230cb9fe273303e63280a&o=&hp=1",
                    "https://cf.bstatic.com/xdata/images/hotel/max1024x768/332972474.jpg?k=5550cab3f91b4accb42f224b2358a11d417b90b2b5fc47bbeded7712941b7369&o=&hp=1",
                    "https://8plusmotels.hotelsnegombo.com/data/Images/OriginalPhoto/13074/1307466/1307466619/negombo-8-plus-motels-image-71.JPEG"
          ],
          "description": "8+ Plus Motels are strategically located in key tourist areas across Sri Lanka, making them accessible for travelers looking to explore popular destinations. 8+ Plus Motels typically offer a range of room types to accommodate different budgets and preferences. 8+ Plus Motels offer a practical solution for travelers looking for budget-friendly accommodations in Sri Lanka. With their focus on comfort, essential amenities, and strategic locations, they provide a convenient base for exploring the rich cultural and natural heritage of the country. Whether you're visiting bustling cities, ancient ruins, or serene landscapes, 8+ Plus Motels can be a suitable choice for your stay in Sri Lanka."
        }
      ]
   },


   {
    "id": 53,
    "name": "Sentido Heritance Negombo",
    "location": "Negombo",
    "rating": 4.7,
    "image": "https://media-cdn.holidaycheck.com/w_768,h_432,c_fill,q_auto,f_auto/ugc/images/1cb08f22-2050-4ef4-8e1c-d3d1cdce6ddf",
    "details": "Sentido Heritance Negombo is a luxurious beachfront resort located in Negombo, Sri Lanka. Known for its modern design, upscale amenities, and proximity to both the beach and local attractions, it is a popular choice for travelers looking for a relaxing getaway with a touch of elegance. Sentido Heritance is situated along the beautiful coastline of Negombo, which is approximately 12 kilometers (about 7.5 miles) from Bandaranaike International Airport. This makes it a convenient choice for travelers seeking a beach destination close to the airport.",
    "rooms": [
        {
          "image": ["https://hi-cdn.t-rp.co.uk/images/hotels/1515499/2?width=870&height=480&crop=false",
                    "https://cf.bstatic.com/xdata/images/hotel/max1024x768/90365023.jpg?k=bc4cb1037762b069e3d8229c0d02436c9329783587e11f572857f3699a3f4a4b&o=&hp=1",
                    "https://www.sentido.com/image/ws/en/Sentido-Heritance-Negombo/content/04/image2/1200x800/DER1082337-min.jpg",
                    "https://ceylonpages.lk/wp-content/uploads/2020/05/Heritance-Negombo-IV.jpg"
          ],
          "description": "Sentido Heritance is situated along the beautiful coastline of Negombo, which is approximately 12 kilometers (about 7.5 miles) from Bandaranaike International Airport. This makes it a convenient choice for travelers seeking a beach destination close to the airport. Sentido Heritance Negombo offers a perfect blend of luxury, comfort, and cultural experiences along the beautiful coastline of Sri Lanka. With its upscale amenities, beachfront location, and variety of activities, the resort is an ideal destination for couples, families, and business travelers seeking a memorable getaway in Negombo. Whether you’re lounging by the pool, indulging in spa treatments, or exploring the local culture, Sentido Heritance ensures a relaxing and enriching experience."
        }
      ]
   },


   {
    "id": 54,
    "name": "The Kingsbury Colombo",
    "location": "Colombo",
    "rating": 4.5,
    "image": "https://thekingsburyhotel.imgix.net/2021/03/Pinterest-cover.jpg?w=1900&h=&&fit=crop&crop=edges,center&auto=enhance&q=50",
    "details": "The Kingsbury Colombo is a prestigious luxury hotel located in the heart of Colombo, Sri Lanka. Known for its elegance and world-class amenities, The Kingsbury offers a sophisticated atmosphere with stunning views of the Indian Ocean and the bustling city skyline. It caters to both business and leisure travelers, providing a perfect blend of comfort, convenience, and luxury.",
    "rooms": [
        {
          "image": ["https://images.trvl-media.com/lodging/1000000/20000/20000/19910/fd54a36a.jpg?impolicy=resizecrop&rw=575&rh=575&ra=fill",
                    "https://images.trvl-media.com/lodging/1000000/20000/20000/19910/4d1866be.jpg?impolicy=resizecrop&rw=575&rh=575&ra=fill",
                    "https://images.trvl-media.com/lodging/1000000/20000/20000/19910/62594c0f.jpg?impolicy=fcrop&w=1200&h=800&p=1&q=medium",
                    "https://www.yololetstraveltheworld.com/wp-content/uploads/2018/12/DSC03893-15-1440x1263.jpg"
          ],
          "description": "The Kingsbury Colombo is a premier luxury hotel that offers an exceptional experience for travelers seeking comfort, elegance, and convenience in Sri Lanka's capital city. With its stunning ocean views, upscale amenities, and central location, it is an ideal choice for business and leisure travelers alike. Whether you're enjoying a meal at one of the hotel’s restaurants, relaxing by the infinity pool, or exploring the vibrant city of Colombo, The Kingsbury ensures a memorable stay filled with luxury and hospitality."
        }
      ]
   },


   {
    "id": 55,
    "name": "Taj Samudra, Colombo",
    "location": "Colombo",
    "rating": 4.5,
    "image": "https://cdn.sanity.io/images/ocl5w36p/prod2/64b18861cbfac783a61388d94dd03aa3409be344-1000x666.jpg?w=1366&fm=webp&dpr=2",
    "details": "Taj Samudra Colombo is a luxury 5-star hotel located in the heart of Colombo, overlooking the Indian Ocean. Set within 11 acres of beautifully landscaped gardens, it offers a blend of modern comforts and traditional hospitality. The hotel features 274 rooms and 26 suites, many of which offer panoramic ocean views. Guests can enjoy amenities such as marble bathrooms, luxury toiletries, and 24-hour room service. The Taj Samudra is also known for its excellent dining options, which include six restaurants serving a range of cuisines. From the Indian flavors at Navratna to Japanese dishes at YUMI, and seafood specialties at The Crab Factory, there is something to suit all palates. Additionally, the hotel offers a fitness center, an outdoor swimming pool, and wellness treatments, including massages and beauty services.",
    "rooms": [
        {
          "image": ["https://cdn.sanity.io/images/ocl5w36p/prod2/26b3bdba41156b157616b856f8a3a03fc2a65271-4810x3189.jpg?w=1366&fm=webp&dpr=2",
                    "https://cdn.sanity.io/images/ocl5w36p/prod2/f9cbb776acdca04733bccf247977e3ce71a24381-1200x800.jpg?w=1366&fm=webp&dpr=2",
                    "https://cdn.sanity.io/images/ocl5w36p/prod2/8b49e6a583f35af601288691d2a25102d54536fc-1200x800.jpg?w=1366&fm=webp&dpr=2",
                    "https://media-cdn.tripadvisor.com/media/photo-s/16/be/64/85/breakfast-buffe-at-the.jpg"
          ],
          "description": "The hotel is convenient for both business and leisure travelers, offering proximity to major landmarks in Colombo. For business events, it has a 24-hour business center, modern conference rooms, and banquet facilities. Other features include free Wi-Fi, free parking, concierge services, and a range of entertainment options such as live music, tennis, and themed dinners."
        }
      ]
   },

   
   {
    "id": 56,
    "name": "Cinnamon Red Colombo",
    "location": "Colombo",
    "rating": 4.5,
    "image": "https://d18slle4wlf9ku.cloudfront.net/www.cinnamonhotels.com-1302818674/cms/cache/v2/66bd5f872ea30.jpg/1920x1080/fit;c:0,0,2263,1351;fp:50,31/80/b2653c5f94ea281b4c3796cc5dc29d8e.jpg",
    "details": "Cinnamon Red Colombo is a sleek and modern hotel in Colombo's Bambalapitiya district, ideal for both business and leisure travelers. The hotel is eco-certified and offers a range of amenities, including a rooftop infinity pool with stunning views of the city and the Indian Ocean. There's also a rooftop bar, Cloud Red, that provides cocktails and tapas with a lively social atmosphere.",
    "rooms": [
        {
          "image": ["https://www.kayak.com/rimg/kimg/6c/17/17407bb52cca827d.jpg?width=1366&height=768&crop=true",
                    "https://ik.imgkit.net/3vlqs5axxjf/external/ik-seo/http://media.iceportal.com/63070/photos/8293469_XL/Cinnamon-Red-Colombo-Lobby.jpg?tr=w-780%2Ch-437%2Cfo-auto",
                    "https://cinnamon-red-colombo.srilankahotel.net/data/Photos/700x500w/15487/1548775/1548775798.JPEG",
                    "https://cf.bstatic.com/xdata/images/hotel/max1024x768/239078948.jpg?k=7b899c3ffbcbcefda4babe9f6470a7d9bc7b33c5f43bdbf5caa887151b15e02a&o=&hp=1"
          ],
          "description": "The hotel's dining options include Flavoured, a casual restaurant offering fusion cuisine, and Stirred, a 24/7 lobby bar. Guests can also enjoy a gym, free Wi-Fi, and a business center. Rooms are stylishly furnished with modern comforts like premium bedding, hypoallergenic options, and 40-inch LED TVs. The hotel is near popular attractions such as the Gangaramaya Temple and Liberty Plaza, making it a convenient stay for exploring Colombo."
        }
      ]
   },


   {
    "id": 57,
    "name": "Cinnamon Lakeside Hotel",
    "location": "Colombo",
    "rating": 4.6,
    "image": "https://hotelmedia.s3.amazonaws.com/720/480/9823270aeef9e96c4abddfb82d1670f788831d66",
    "details": "Cinnamon Lakeside Colombo is a popular 5-star hotel situated along the banks of Beira Lake in the heart of Colombo. It is known for its luxurious atmosphere, exceptional dining options, and range of leisure activities. The hotel offers a variety of rooms and suites, including family-friendly options and bridal suites, equipped with modern amenities like air conditioning, flat-screen TVs, minibars, and private balconies. Guests also have access to allergy-free rooms and interconnected rooms.",
    "rooms": [
        {
          "image": ["https://imgcy.trivago.com/c_fill,d_dummy.jpeg,e_sharpen:60,f_auto,h_534,q_40,w_800/hotelier-images/6a/a0/cadd14eded071da09b854ff35150306678d1d1c01d625ec2dbd175edd061.jpeg",
                    "https://www.kayak.com/rimg/himg/0f/44/27/expediav2-319809-59e47f-155642.jpg?width=1366&height=768&crop=true",
                    "https://bmkltsly13vb.compat.objectstorage.ap-mumbai-1.oraclecloud.com/cdn.ft.lk/assets/uploads/image_4082c3fb17.jpg",
                    "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/12/9d/57/6b/8-degrees-event-space.jpg?w=700&h=-1&s=1"
          ],
          "description": "Cinnamon Lakeside features six on-site restaurants offering diverse cuisines, such as Royal Thai for Thai dishes, Long Feng for Chinese cuisine, and Sushi Bar. The hotel also boasts a pool, a wellness spa, tennis courts, and a gym, ensuring a comfortable and activity-filled stay. For nightlife and entertainment, the property offers a floating lounge and a nightclub. It’s conveniently located just 0.3 miles from several top attractions like Bally's Casino and Sri Murugan Temple, making it a good base for exploring Colombo."
        }
      ]
   },


   {
    "id": 58,
    "name": "The Golden Crown",
    "location": "Kandy",
    "rating": 4.4,
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/116650068.jpg?k=a70d359a82c1c792fa4facbc71bf619be0da3c7ac927f6a7637b4b5ec5975477&o=&hp=1",
    "details": "The Golden Crown Hotel is a premier 5-star luxury hotel located in the tranquil hills of Ampitiya, Kandy, offering a perfect blend of modern sophistication and traditional Sri Lankan charm. Known for its serene ambiance and elegant architecture, this hotel is ideal for both leisure and business travelers seeking a high-end experience while being close to Kandy’s cultural landmarks. Situated about 10 minutes from Kandy’s city center, in a peaceful area called Ampitiya.",
    "rooms": [
        {
          "image": ["https://www.thegoldencrownhotel.com/images/site-specific/golden_crown/accomodation/delux-am.png",
                    "https://www.thegoldencrownhotel.com/images/site-specific/golden_crown/gallery/things-to-do/gallery_spa.jpg",
                    "https://www.thegoldencrownhotel.com/images/site-specific/golden_crown/dining/long-bar-photo.jpg",
                    "https://www.thegoldencrownhotel.com/images/site-specific/golden_crown/banner_2.jpg"
          ],
          "description": "Concierge Services: 24-hour assistance for tour arrangements, restaurant reservations, and transport services. Free Wi-Fi: Complimentary high-speed Wi-Fi throughout the property. Valet Parking: Available for guests with private vehicles. Airport Transfers: Private transfers to and from Bandaranaike International Airport can be arranged upon request. The Golden Crown Hotel offers a range of luxurious rooms and suites, each designed with comfort and style in mind. All rooms provide scenic views of either the surrounding hills, the lush gardens, or the hotel's swimming pool."
        }
      ]
   },


   {
    "id": 59,
    "name": "Jetwing by Galle Heritage Villa",
    "location": "Galle",
    "rating": 4.2,
    "image": "https://www.jetwinghotels.com/wp-content/uploads/2023/08/galle-heritage-01-696x360-1.jpg",
    "details": "Galle Heritage Villa is a beautiful boutique hotel located in the historic city of Galle, Sri Lanka. It’s known for its charming architecture, combining colonial influences with modern comforts. Historical Ambiance: The villa often showcases original features such as high ceilings, wooden floors, and intricate decor, reflecting Galle's rich history. Comfortable Accommodations: Rooms typically include air conditioning, en-suite bathrooms, and charming furnishings, providing a cozy and inviting atmosphere. Outdoor Spaces: Many guests enjoy the lush gardens and tranquil courtyard areas, perfect for relaxing or enjoying breakfast.",
    "rooms": [
        {
          "image": ["https://www.jetwinghotels.com/jetwinggalleheritagehome/wp-content/uploads/sites/47/2023/11/Jetwing-Galle-Heritage-Experiences-1200x810-1.jpg",
                    "https://www.jetwinghotels.com/jetwinggalleheritagehome/wp-content/uploads/sites/47/2023/11/Jetwing-Galle-Heritage-Deluxe-rooms-1200x810-2-1.jpg",
                    "https://www.jetwinghotels.com/jetwinggalleheritagehome/wp-content/uploads/sites/47/2023/11/Jetwing-Galle-Heritage-Interior-view-1200x810-2.jpg",
                    "https://www.jetwinghotels.com/jetwinggalleheritagehome/wp-content/uploads/sites/47/2023/11/Jetwing-Galle-Heritage-Dining-1200x810-6.jpg"
          ],
          "description": "At the hotel, each room is fitted with a wardrobe. With a private bathroom equipped with a shower and free toiletries, rooms at GALLE HERITAGE VILLA also offer free WiFi, while selected rooms come with a balcony. Guest rooms at the accommodation include air conditioning and a desk. At Villa Heritage in Galle, the rooms typically offer a blend of colonial charm and modern comfort"
        }
      ]
   },


   {
    "id": 60,
    "name": "Radisson Blu Resort Galle",
    "location": "Galle",
    "rating": 4.8,
    "image": "https://media.radissonhotels.net/image/radisson-blu-resort-galle/exterior/16256-147492-f76469032_4k.jpg?impolicy=GalleryLightboxFullscreen",
    "details": "Radisson Blu Resort, Galle is a 5-star beachfront luxury resort located on the southwestern coast of Sri Lanka, just a few kilometers from the historic Galle Fort. Known for its modern design, exceptional service, and direct access to the beach, it offers a serene getaway for both leisure and business travelers. Situated just a short drive from the UNESCO World Heritage Site Galle Fort, the hotel offers easy access to local attractions, beaches, and cultural landmarks. It is also near popular coastal destinations like Unawatuna Beach and Hikkaduwa for snorkeling, diving, and surfing.",
    "rooms": [
        {
          "image": ["https://static51.com-hotel.com/uploads/hotel/54849/photo/amari-galle-level-1-safe-secure_161311202427.jpg",
                    "https://www.momondo.in/kimg/c6/29/21885898-5c1c8914-34.jpg",
                    "https://media.expedia.com/hotels/17000000/16270000/16267200/16267123/d12c249a_z.jpg",
                    "https://cf.bstatic.com/xdata/images/hotel/max1024x768/246563086.jpg?k=7878b205e279db6f51a6755fd4623cb9c7ef56743cbb802a13be25cc129d168c&o=&hp=1"
          ],
          "description": "Radisson Blu Resort, Galle offers a blend of contemporary luxury, stunning ocean views, and excellent service. With its wide range of amenities, from gourmet dining to spa treatments and beach activities, it's an ideal destination for families, couples, and business travelers looking for a relaxing yet enriching stay in Sri Lanka."
        }
      ]
   },

   
   {
    "id": 61,
    "name": "Madulkelle Tea and Eco Lodge",
    "location": "Kandy",
    "rating": 4.5,
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/505734731.jpg?k=bd13d0727a7603b37d7b5057b27aee63c86c854bea2899324f72d819801ce378&o=&hp=1",
    "details": "Madulkelle Tea and Eco Lodge is an eco-friendly luxury retreat nestled in the lush Knuckles Mountain Range of Sri Lanka. It offers guests a unique experience of staying in sustainable tented lodges surrounded by tea plantations, dense forests, and stunning mountain views. The lodge combines comfort, nature, and adventure, making it an ideal destination for eco-conscious travelers, nature lovers, and those looking for a serene escape in the heart of Sri Lanka's highlands. Situated on the Knuckles Mountain Range, a UNESCO World Heritage site, the lodge is about 30 km from Kandy. The lodge offers breathtaking views of the surrounding mountains, forests, and tea plantations.",
    "rooms": [
        {
          "image": ["https://images.trvl-media.com/lodging/12000000/11260000/11254500/11254476/97984946.jpg?impolicy=resizecrop&rw=575&rh=575&ra=fill",
                    "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/07/4a/9f/cd/madulkelle-tea-and-eco.jpg?w=700&h=-1&s=1",
                    "https://cf.bstatic.com/xdata/images/hotel/max1024x768/189689869.jpg?k=48f59b2ee1fbdd3b35ed956425f56fc53d9abc69485dee380f243b6d57a2ab2d&o=&hp=1",
                    "https://www.secret-retreats.com/wp-content/uploads/gallery/madulkelle/madulkelle-10.jpg"
          ],
          "description": "Each tented lodge is elevated on stilts, with canvas walls and wooden floors. The lodges feature modern amenities but maintain a close connection to nature, with large private verandas that offer panoramic views. Comfortable king-size or twin beds with premium bedding En-suite bathroom with hot water, rain showers, and eco-friendly toiletries Private terrace or balcony with outdoor seating Solar-powered lighting and minimal use of electricity to reduce environmental impact Complimentary tea and coffee-making facilities with a selection of local tea. Madulkelle Tea and Eco Lodge is a perfect blend of luxury, adventure, and sustainability, offering guests a chance to disconnect from modern life while immersing themselves in nature. With breathtaking views, eco-conscious practices, and a range of activities that cater to both relaxation and adventure, it provides an unforgettable experience for travelers seeking a peaceful retreat in the heart of Sri Lanka’s highlands."
        }
      ]
   },


   {
    "id": 62,
    "name": "Suisse Hotel Kandy",
    "location": "Kandy",
    "rating": 4.0,
    "image": "https://www.hotelsuisse.lk/img/gallery/6b.png",
    "details": "Suisse Hotel Kandy is a charming colonial-style hotel located in the heart of Kandy, Sri Lanka. Known for its old-world charm, historic significance, and picturesque location by the Kandy Lake, the hotel offers a blend of traditional elegance and modern comfort. It’s a great choice for travelers who wish to experience Kandy’s rich cultural heritage while enjoying convenient access to the city's attractions. Suisse Hotel Kandy is ideal for travelers seeking an authentic and historical experience in Sri Lanka’s cultural capital. Its colonial charm, combined with a scenic location by Kandy Lake, makes it a great choice for those who appreciate history, nature, and comfort. The hotel’s proximity to major attractions, along with its beautiful gardens and traditional hospitality, ensures a relaxing and memorable stay in Kandy.",
    "rooms": [
        {
          "image": ["https://www.hotelsuisse.lk/img/gallery/7b.png",
                    "https://www.hotelsuisse.lk/img/gallery/2b.png",
                    "https://www.hotelsuisse.lk/img/gallery/1b.png",
                    "https://www.hotelsuisse.lk/img/dining/indoor/Salad-Bar.jpg"
          ],
          "description": "Suisse Hotel Kandy offers a range of rooms and suites, all designed to provide comfort with a hint of colonial grandeur. The rooms feature vintage décor, high ceilings, and traditional furnishings, creating a unique and nostalgic atmosphere. Free Wi-Fi: Available throughout the property. Children’s Playground: A dedicated play area for families traveling with children. The hotel offers tour and travel assistance, helping guests plan excursions to nearby attractions such as the Royal Botanical Gardens, Kandy Lake, and the Ceylon Tea Museum, The hotel’s gift shop offers a selection of local handicrafts, souvenirs, and Sri Lankan goods."
        }
      ]
   },


   {
    "id": 63,
    "name": "The Cottage By Jetwing",
    "location": "Nuwara Eliya",
    "rating": 4.3,
    "image": "https://www.jetwinghotels.com/thecottage/wp-content/uploads/sites/12/2019/05/Cottage-Exterior-8-1200x810.jpg",
    "details": "The Cottage by Jetwing in Nuwara Eliya, a cozy retreat with colonial charm, offers a blend of history and modern comforts. This restored bungalow is surrounded by picturesque gardens, and its intimate accommodation consists of two elegant suites and one deluxe room. Situated in Nuwara Eliya, often referred to as 'Little England' for its cool climate and colonial architecture, the cottage is surrounded by lush greenery and misty hills, making it an ideal escape for nature lovers and history enthusiasts.",
    "rooms": [
        {
          "image": ["https://www.jetwinghotels.com/thecottage/wp-content/uploads/sites/12/2019/05/accommodation-849x647.jpg",
                    "https://www.jetwinghotels.com/thecottage/wp-content/uploads/sites/12/2019/05/Cottage-Gallery-2-1200x810.jpg",
                    "https://cf.bstatic.com/xdata/images/hotel/max1024x768/365160406.jpg?k=e46b2f936c1238854e41202fc41972c4c75b888a22745e6ffe40660f180aa6e1&o=&hp=1",
                    "https://www.jetwinghotels.com/thecottage/wp-content/uploads/sites/12/2019/05/Gallery-Deluxe-1200x810.jpg"
          ],
          "description": "Antiquated on the outside, yet remarkably contemporary on the inside, The Cottage by Jetwing is an extraordinary Nuwara Eliya holiday bungalow equipped with luxurious amenities from the home of Sri Lankan hospitality. Beyond the standard services expected with any accommodation, our upcountry home also features a communal sitting area, as well as a dedicated laundry service from our family at Jetwing St. Andrew’s."
        }
      ]
   },


   {
    "id": 64,
    "name": "The Golden Ridge",
    "location": "Nuwara Eliya",
    "rating": 4.5,
    "image": "https://www.thegoldenridge.com/images/site-specific/golden_ridge/gallery/aerial-view.jpg",
    "details": "The Golden Ridge Hotel in Nuwara Eliya is a luxurious, 5-star property offering 78 elegantly designed rooms and suites with stunning views of the misty hills. The hotel features an indoor heated pool, a spa, a kids’ play area, and several dining options, including The Clovelly Kitchen and The Sackville restaurant. Located close to popular attractions like tea plantations and the Nuwara Eliya Golf Club, the hotel is ideal for both relaxation and exploration. Its colonial charm and modern amenities make it a standout in the region​.",
    "rooms": [
        {
          "image": ["https://www.thegoldenridge.com/images/site-specific/golden_ridge//gallery/family-room-banner.jpg",
                    "https://www.thegoldenridge.com/images/site-specific/golden_ridge/gallery/mountant-view-double-bathroom.jpg",
                    "https://www.thegoldenridge.com/images/site-specific/golden_ridge/gallery/skyline-restaurant.jpg",
                    "https://www.thegoldenridge.com/images/site-specific/golden_ridge/gallery/meat-item.jpg"
          ],
          "description": "The Golden Ridge Hotel in Nuwara Eliya offers a blend of luxury and comfort with various amenities. The hotel features 76 well-appointed rooms equipped with LED TVs, minibars, and heated floors. Guests can enjoy both indoor and outdoor pools, a sauna, and a gym. Dining options include three restaurants and three cafes. Additional amenities comprise a business center, kids' club, and spa services. The hotel is situated near local attractions like the Nuwara Eliya Golf Club and Lake Gregory​"
        }
      ]
   },


   {
    "id": 65,
    "name": "The Clovelly Bungalow",
    "location": "Nuwara Eliya",
    "rating": 4.6,
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/176005325.jpg?k=19a8b35545fb09abac7f643befa6b52b8b48a02f187f523847c976526238ce0b&o=&hp=1",
    "details": "The Clovelly Hotel in Nuwara Eliya, Sri Lanka, is a charming and picturesque accommodation option known for its colonial architecture and serene surroundings. Situated in the heart of Nuwara Eliya, the hotel is surrounded by stunning landscapes, including lush tea plantations and rolling hills. It's a popular spot for tourists seeking a peaceful retreat in the hill country.",
    "rooms": [
        {
          "image": ["https://www.theclovellybungalow.com/images/site-specific/collvelly-bunglow/accommodation/premium-king/ameniten-copy.jpg",
                    "https://www.theclovellybungalow.com/images/site-specific/collvelly-bunglow/about-us/our-vision-mission.jpg",
                    "https://www.theclovellybungalow.com/images/site-specific/collvelly-bunglow/gallery/new-18.jpg",
                    "https://www.theclovellybungalow.com/images/site-specific/collvelly-bunglow/dining/dining-banner.jpg"
          ],
          "description": "The hotel offers a variety of rooms, including standard rooms and suites. Many rooms are designed with traditional furnishings, providing a comfortable and inviting atmosphere. Flat-screen TV, Wi-Fi, Tea/coffee-making facilities,En-suite bathrooms. The Clovelly Hotel offers a delightful experience in Nuwara Eliya, combining comfort, charm, and stunning natural beauty.​"
        }
      ]
   },


   {
    "id": 66,
    "name": "W15",
    "location": "Nuwara Eliya",
    "rating": 4.8,
    "image": "https://lakegregory.w15.lk/_next/image?url=https%3A%2F%2Fimages.ctfassets.net%2Fz8qhe5hje565%2F16kcIC2sF01zBEcnaxHFdE%2Fc686cc4c036bf564df2a22d63ac7dc04%2Foutdoors-03.jpg&w=1920&q=75",
    "details": "W15 is a collection of boutique hotels located in various picturesque settings in Sri Lanka, with a focus on providing unique experiences and modern comforts. The most notable W15 hotel is W15 Nuwara Eliya, which is situated in the scenic hill country of Sri Lanka. Here’s a detailed overview of W15 Nuwara Eliya. The hotel is located in Nuwara Eliya, known for its cool climate, lush tea plantations, and stunning landscapes. The area is often referred to as 'Little England' due to its colonial architecture and cool weather.",
    "rooms": [
        {
          "image": ["https://lakegregory.w15.lk/_next/image?url=https%3A%2F%2Fimages.ctfassets.net%2Fz8qhe5hje565%2F127EBvP66kK4Tir8fbntko%2F5826e1028df9873be40521917a368d1c%2Frooms-10.jpg&w=1920&q=75",
                    "https://lakegregory.w15.lk/_next/image?url=https%3A%2F%2Fimages.ctfassets.net%2Fz8qhe5hje565%2F2HdfYPCUiONMuW13dycEQ9%2F017dbc283c840ee9b51da7e6a6c12055%2Frooms-01.jpg&w=1920&q=75",
                    "https://lakegregory.w15.lk/_next/image?url=https%3A%2F%2Fimages.ctfassets.net%2Fz8qhe5hje565%2F4sJO2i4x7TiFFFEVn26FR3%2F1b8a325ecf4224f061d898f9a4904388%2Fliving-space-04.jpg&w=1920&q=75",
                    "https://lakegregory.w15.lk/_next/image?url=https%3A%2F%2Fimages.ctfassets.net%2Fz8qhe5hje565%2F6mHlHUoIay4VwdaGMguMtN%2F6578b5e8e159096d7dc95b263dbea2f7%2Findoor-pool-04.jpg&w=1920&q=75"
          ],
          "description": "Rooms and Suites: W15 Nuwara Eliya offers a variety of accommodations, including luxury rooms and suites, each designed with modern amenities and stylish decor. Rooms typically include comfortable beds, en-suite bathrooms, flat-screen TVs, Wi-Fi, and tea/coffee-making facilities. Many rooms provide beautiful views of the surrounding mountains and gardens. W15 Nuwara Eliya is a great option for those looking to explore the beauty of Sri Lanka’s hill country while enjoying a luxurious and unique stay.​"
        }
      ]
   },


   {
    "id": 67,
    "name": "Araliya Red Hotel",
    "location": "Nuwara Eliya",
    "rating": 4.2,
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/334092465.jpg?k=25abfa0ebd7d0befc135ccb9a51bb80a350332e3f6c3333a5680aa7c5068e271&o=&hp=1",
    "details": "Araliya Red in Nuwara Eliya is another fantastic property under the Araliya Group, known for its modern amenities, stylish design, and beautiful surroundings. Situated in the heart of Nuwara Eliya, the hotel is close to popular attractions, tea plantations, and scenic spots, making it an ideal base for exploring the region.",
    "rooms": [
        {
          "image": ["https://do6raq9h04ex.cloudfront.net/sites/5/2020/12/PGP_6359-1.jpg",
                    "https://do6raq9h04ex.cloudfront.net/sites/5/2020/12/PGP_6463-1.jpg",
                    "https://do6raq9h04ex.cloudfront.net/sites/5/2020/12/PGP_6230-1.jpg",
                    "https://q-xx.bstatic.com/xdata/images/hotel/max500/259026020.jpg?k=9a8bf1083d8fe2435618dd04c25966436b426f792e6154b0eeb014f8ad58b496&o="
          ],
          "description": "The hotel provides a variety of room types, including standard rooms and suites, all designed with modern comforts. Luxurious bedding, En-suite bathrooms with modern fittings. Flat-screen TVs, Mini-fridges. Tea and coffee-making facilities, Balconies or large windows for enjoying the views. Araliya Red’s modern design and amenities cater to travelers looking for a stylish and comfortable stay. Its proximity to key attractions makes it a practical choice for tourists wanting to explore Nuwara Eliya."
        }
      ]
   },


   {
    "id": 68,
    "name": "Jetwing Thalahena Villa",
    "location": "Negombo",
    "rating": 4.4,
    "image": "https://www.jetwinghotels.com/jetwingthalahenavillas/wp-content/uploads/sites/6/2017/11/thalahena-gallery-dining-4.jpg",
    "details": "Jetwing Sea is a stylish beachfront hotel located in Negombo, Sri Lanka, offering a serene coastal retreat. As part of the Jetwing Hotels chain, it combines modern comforts with traditional Sri Lankan hospitality. This property is ideal for both leisure and business travelers, with its focus on providing a peaceful escape along the shores of the Indian Ocean. Jetwing Thalahena Villas offers an exclusive and serene beachfront retreat with a focus on luxury, privacy, and personalized service. The combination of elegant villas, in-villa dining, and private spa treatments makes it an ideal choice for couples, families, or small groups seeking a peaceful getaway. Its proximity to Negombo and easy access to excursions and cultural activities ensure that guests can enjoy both relaxation and exploration during their stay in Sri Lanka.",
    "rooms": [
        {
          "image": ["https://www.jetwinghotels.com/jetwingthalahenavillas/wp-content/uploads/sites/6/2017/11/Jetwing-Thalahena-Villas-accommodation-1.jpg",
                    "https://www.jetwinghotels.com/jetwingthalahenavillas/wp-content/uploads/sites/6/2017/11/jetwing-thalahena-villas-gallery-2-1.jpg",
                    "https://cf.bstatic.com/xdata/images/hotel/max1024x768/52119358.jpg?k=6fa7e7701397a650200d146214b5ea343e2ac96061dee9d3b0efa1107584c376&o=&hp=1",
                    "https://jetwing-thalahena-villas.srilankahotel.net/data/Imgs/700x500w/7494/749402/749402336/img-jetwing-thalahena-villas-negombo-4.JPEG"
          ],
          "description": "The accommodation at Jetwing Thalahena Villas is designed with both luxury and privacy in mind. It offers a limited number of exclusive villas, making it ideal for small groups, families, or couples looking for an intimate beachfront retreat. Although Jetwing Thalahena Villas is a smaller, more intimate property, it still offers a variety of dining experiences, with meals focusing on fresh, locally sourced ingredients and Sri Lankan flavors. While Jetwing Thalahena Villas is a boutique property with a focus on privacy and luxury, it still offers a range of high-end amenities to enhance the guest experience. Guests at Jetwing Thalahena Villas can enjoy a variety of activities and excursions, either arranged directly by the hotel or through local tour providers. Jetwing Thalahena Villas, like other properties in the Jetwing portfolio, is committed to sustainability."
        }
      ]
   },


   {
    "id": 69,
    "name": "Araliya Beach Resort & Spa - Unawatuna",
    "location": "Unawatuna",
    "rating": 4.2,
    "image": "https://do6raq9h04ex.cloudfront.net/sites/2/2024/07/beach-exterior-gall-large-8.jpg",
    "details": "Araliya Beach Resort & Spa is a luxurious beachfront property located in Unawatuna, Sri Lanka. Known for its stunning views, elegant accommodations, and comprehensive amenities, the resort is an excellent choice for travelers looking to relax by the beach while enjoying modern comforts and a touch of Sri Lankan hospitality. The resort is situated directly on Unawatuna Beach, providing guests with easy access to the soft sands and clear waters of the Indian Ocean.",
    "rooms": [
        {
          "image": ["https://do6raq9h04ex.cloudfront.net/sites/2/2024/06/premier-hm-feat.jpg",
                    "https://cf.bstatic.com/xdata/images/hotel/max1024x768/561434094.jpg?k=b9a7265da024298b41c6367fed2967a1912d704726aea0121f16583e619636b3&o=&hp=1",
                    "https://do6raq9h04ex.cloudfront.net/sites/2/2024/07/facility-gall-large-11.jpg",
                    "https://do6raq9h04ex.cloudfront.net/sites/2/2024/07/dining-gall-large-9.jpg"
          ],
          "description": "Araliya Beach Resort offers a range of luxurious accommodations, including Deluxe Rooms, Suites, and Family Rooms. Most rooms feature private balconies with views of the ocean or lush gardens. The resort boasts a stunning infinity pool that overlooks the ocean, providing a perfect spot for guests to relax and enjoy the scenery. Araliya Beach Resort & Spa provides a luxurious and relaxing retreat in Unawatuna, combining modern amenities with stunning natural beauty. With its beachfront location, diverse dining options, comprehensive wellness services, and a range of activities, the resort is ideal for couples, families, and solo travelers looking for an unforgettable beach holiday in Sri Lanka. Whether guests are seeking adventure or relaxation, Araliya Beach Resort & Spa offers a perfect blend of both."
        }
      ]
   },


   {
    "id": 70,
    "name": "Hotel J Ambalangoda",
    "location": "Ambalangoda",
    "rating": 4.1,
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/166515376.jpg?k=cc8ed099daec367b238bbd42eb8e8ff66431114b2d2222a577759305f2e46359&o=&hp=1",
    "details": "Hotel J Ambalangoda is a charming beachfront hotel located in Ambalangoda, a coastal town on Sri Lanka’s southern coast known for its serene beaches and rich cultural heritage. This hotel offers a combination of comfort, hospitality, and convenient amenities, making it an excellent choice for travelers seeking relaxation by the sea. The hotel is situated directly on the sandy shores of Ambalangoda Beach, providing guests with easy access to the beach and beautiful ocean views.",
    "rooms": [
        {
          "image": ["https://hotelj.wpenginepowered.com/ambalangoda/wp-content/uploads/sites/5/2019/11/gallery-blue-room.jpg",
                    "https://hotelj.wpenginepowered.com/ambalangoda/wp-content/uploads/sites/5/2019/09/DSC_2888_HDR_g.jpg",
                    "https://hotelj.wpenginepowered.com/ambalangoda/wp-content/uploads/sites/5/2019/11/gallery-outdoor-deck.jpg",
                    "https://media-cdn.tripadvisor.com/media/photo-s/10/8f/ba/06/photo5jpg.jpg"
          ],
          "description": "Hotel J Ambalangoda provides a relaxed and welcoming atmosphere, perfect for travelers seeking a beach getaway in Sri Lanka. With comfortable accommodations, a range of dining options, and various activities available, guests can enjoy both relaxation and adventure. Whether lounging by the beach, exploring local attractions, or indulging in spa treatments, Hotel J Ambalangoda offers a delightful retreat for all types of travelers."
        }
      ]
   },


   {
    "id": 71,
    "name": "Cinnamon Bey Beruwala",
    "location": "Beruwala",
    "rating": 4.5,
    "image": "https://images.trvl-media.com/lodging/9000000/8260000/8256300/8256226/648758d8.jpg?impolicy=resizecrop&rw=575&rh=575&ra=fill",
    "details": "Cinnamon Bey Beruwala is a luxurious resort located in Beruwala, a picturesque coastal town in Sri Lanka. Set amidst lush tropical gardens and offering direct access to the stunning beaches of the Indian Ocean, Cinnamon Bey is known for its elegant accommodations, exceptional amenities, and warm Sri Lankan hospitality.",
    "rooms": [
        {
          "image": ["https://cinnamonbeyberuwala.hotelmix.co.uk/data/Photos/OriginalPhoto/15487/1548777/1548777394/Cinnamon-Bey-Beruwala-Exterior.JPEG",
                    "https://r1imghtlak.mmtcdn.com/99faf212826111ea82740242ac110002.jpg",
                    "https://cf.bstatic.com/xdata/images/hotel/max1024x768/490896398.jpg?k=36921c28ba020cd96903791430fe2ce8eaac6360a92cb94926485c97e272f3cc&o=&hp=1",
                    "https://tourismnewslive.com/wp-content/uploads/2019/02/Junior-Suite-Living-Dining-Room.jpg"
          ],
          "description": "The resort is situated along a pristine stretch of beach, providing guests with easy access to sun, sand, and sea. The resort offers a variety of rooms and suites, including Superior Rooms, Deluxe Rooms, Family Rooms, and Suites. Each accommodation is designed for comfort and relaxation, blending modern luxury with traditional Sri Lankan elements. The resort features a large infinity pool with stunning views of the ocean, surrounded by sun loungers and tropical landscaping, ideal for relaxation. Cinnamon Bey Beruwala offers a luxurious and relaxing beachfront getaway, combining modern amenities with stunning natural beauty. With a wide range of accommodations, dining options, and activities, the resort is ideal for couples, families, and solo travelers seeking a memorable experience in Sri Lanka. Whether lounging by the pool, indulging in spa treatments, or exploring the local culture, guests will find plenty to enjoy at this exquisite resort."
        }
      ]
   },


   {
    "id": 72,
    "name": "Jetwing Welimada Villa",
    "location": "Welimada",
    "rating": 4.7,
    "image": "https://www.jetwinghotels.com/jetwinguvabenheadvilla/wp-content/uploads/sites/45/2023/01/Uva-Hotel-OG-1200x630-1.jpg",
    "details": "Jetwing Welimada Villa is a serene getaway located in Welimada, Sri Lanka. Surrounded by lush greenery and stunning mountain views, this villa is part of the renowned Jetwing Hotels chain, known for its commitment to hospitality and sustainable tourism. Jetwing Welimada Villa provides a peaceful retreat for travelers looking to escape the hustle and bustle of city life and immerse themselves in nature. Set amidst the picturesque landscapes of the Central Highlands, the villa offers breathtaking views of tea plantations, rolling hills, and mountains.",
    "rooms": [
        {
          "image": ["https://www.jetwinghotels.com/jetwingwelimadavilla/wp-content/uploads/sites/46/2023/01/Room-Image-3-1200x810-1.jpg",
                    "https://www.jetwinghotels.com/jetwingwelimadavilla/wp-content/uploads/sites/46/2023/01/Room-Image-2-1200x810-1.jpg",
                    "https://www.jetwinghotels.com/jetwingwelimadavilla/wp-content/uploads/sites/46/2023/01/Hotel-3-1200x810-1.jpg",
                    "https://www.jetwinghotels.com/jetwingwelimadavilla/wp-content/uploads/sites/46/2023/01/Dining-room2-v1-1200x810-1.jpg"
          ],
          "description": "Jetwing Welimada Villa offers a range of comfortable accommodations, including Deluxe Rooms and Family Rooms. The rooms are designed to provide a cozy atmosphere, featuring local decor and modern comforts. The villa features a restaurant that serves a variety of delicious dishes, focusing on local and international cuisine made with fresh, locally sourced ingredients. Jetwing Welimada Villa offers a tranquil escape into nature, with comfortable accommodations and a focus on relaxation and wellness. Its stunning location in the Central Highlands makes it an ideal choice for travelers seeking to explore the beauty of Sri Lanka’s countryside while enjoying the comforts of a well-appointed villa. Whether hiking through tea plantations, enjoying local cuisine, or simply unwinding in a serene environment, guests will find a memorable experience at Jetwing Welimada Villa."
        }
      ]
   },


   {
    "id": 73,
    "name": "Jetwing Kaduruketha",
    "location": "Ella",
    "rating": 4.6,
    "image": "https://www.bestoflanka.com/images/slider/recommended-stays-sri-lanka/stay-in-the-country-side-sri-lanka/jetwing_kaduruketha/01.jpg",
    "details": "Jetwing Kaduruketha is a stunning eco-friendly hotel located in the Uva Province of Sri Lanka, near Ella. Set amidst beautiful paddy fields and lush greenery, this property offers a unique experience that combines comfort, sustainability, and authentic Sri Lankan culture. The hotel is designed to reflect the region's agricultural heritage and provides an ideal retreat for travelers looking to explore the scenic beauty of the hill country. Nestled in the picturesque countryside, Jetwing Kaduruketha is surrounded by stunning landscapes, including rolling hills, paddy fields, and tea plantations.",
    "rooms": [
        {
          "image": ["https://www.jetwinghotels.com/jetwingayurvedapavilions/wp-content/uploads/sites/30/2019/02/classic-room-1-744x653.jpg",
                    "https://www.jetwinghotels.com/jetwingkaduruketha/wp-content/uploads/sites/23/2020/02/kathu-room-2.jpg",
                    "https://cf.bstatic.com/xdata/images/hotel/max1024x768/99687994.jpg?k=5374b6687d030106102fbf39985c1f65b683c83bc93fca5a36981bb5a6dc0e09&o=&hp=1",
                    "https://www.jetwinghotels.com/jetwingkaduruketha/wp-content/uploads/sites/23/2019/06/kaduruketha-dining-744x502.jpg"
          ],
          "description": "The hotel offers a variety of spacious and comfortable accommodations, including Superior Rooms and Luxury Suites. Each room is designed with modern amenities while reflecting traditional Sri Lankan architecture. Jetwing Kaduruketha offers a unique blend of luxury and authenticity in the heart of Sri Lanka's countryside. With its stunning surroundings, comfortable accommodations, and a commitment to sustainability, guests can enjoy a relaxing and enriching experience. Whether exploring the scenic landscapes, savoring local cuisine, or engaging in cultural activities, visitors will find a memorable stay at this charming hotel."
        }
      ]
   },


   {
    "id": 74,
    "name": "Turyaa Kalutara",
    "location": "Kalutara",
    "rating": 4.6,
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/566374947.jpg?k=c8ad3d8994e2cc3b36882ff1960dbd6d6b7e9f0922ee6a25aa4df1d15eaba350&o=&hp=1",
    "details": "Turyaa Kalutara is a luxurious beachfront resort located in Kalutara, along Sri Lanka's southwestern coast. Known for its picturesque ocean views, contemporary design, and warm hospitality, this hotel offers a mix of relaxation, adventure, and comfort. With its wide range of amenities and facilities, Turyaa Kalutara is a popular choice for both leisure travelers and those seeking a serene tropical getaway.",
    "rooms": [
        {
          "image": ["https://d1rcspxk90kf40.cloudfront.net/2015/12/room-2.jpg",
                    "https://www.turyaakalutara.com/wp-content/uploads/2015/12/8-2.jpg",
                    "https://www.turyaakalutara.com/wp-content/uploads/2015/12/s-delux1.jpg",
                    "https://d1rcspxk90kf40.cloudfront.net/2024/01/MG_6390-1.jpg"
          ],
          "description": "Turyaa Kalutara is located directly on Kalutara Beach, offering guests easy access to the sandy shores and stunning views of the Indian Ocean. The hotel offers a range of accommodation options, including Superior Rooms, Deluxe Rooms, and Suites, each designed with modern comforts and elegant decor. Turyaa Kalutara features a large outdoor pool with a sun terrace and plenty of loungers, providing a relaxing space to unwind. Turyaa Kalutara offers an exceptional beachfront getaway with a perfect blend of luxury, relaxation, and adventure. Its wide range of amenities, including multiple dining options, a spa, and water sports, ensures that guests can enjoy a variety of experiences during their stay."
        }
      ]
   },


   {
    "id": 75,
    "name": "Jetwing Jaffna",
    "location": "Jaffna",
    "rating": 4.3,
    "image": "https://images.trvl-media.com/lodging/14000000/13140000/13131100/13131015/dda90a88.jpg?impolicy=resizecrop&rw=575&rh=575&ra=fill",
    "details": "Jetwing Jaffna is a modern hotel located in the vibrant city of Jaffna, Sri Lanka. Known for its rich cultural heritage and unique cuisine, this hotel offers a comfortable stay while providing access to the region's historical sites and natural beauty. Located in the heart of Jaffna, making it convenient for guests to explore local attractions, markets, and restaurants.",
    "rooms": [
        {
          "image": ["https://www.jetwinghotels.com/jetwingjaffna/wp-content/uploads/sites/16/2019/08/galley-r-2.jpg",
                    "https://www.jetwinghotels.com/jetwingjaffna/wp-content/uploads/sites/16/2018/07/jetwing-jaffna-01-1.jpg",
                    "https://images.trvl-media.com/lodging/14000000/13140000/13131100/13131015/8d19f3d3.jpg?impolicy=fcrop&w=1200&h=800&p=1&q=medium",
                    "https://www.jetwinghotels.com/jetwingjaffna/wp-content/uploads/sites/16/2019/08/galley-d-3.jpg"
          ],
          "description": "Offers a variety of rooms, including Standard Rooms, Deluxe Rooms, and Suites. An outdoor pool surrounded by lounge chairs, providing a relaxing environment. Jetwing Jaffna offers a blend of modern comfort and cultural immersion, making it an ideal choice for travelers looking to explore the northern part of Sri Lanka. With its comfortable accommodations, excellent dining options, and convenient access to local attractions, guests can enjoy a memorable stay while experiencing the unique heritage of Jaffna. Whether relaxing by the pool, indulging in local cuisine, or exploring the historical sites, visitors will find a welcoming atmosphere at Jetwing Jaffna."
        }
      ]
   },

   
   {
    "id": 76,
    "name": "Fox Jaffna",
    "location": "Jaffna",
    "rating": 4.5,
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/219613527.jpg?k=9490abd2a7c6b381f14e042fe36e2cbced03564b4965f64fec950b2b2c1a5ae5&o=&hp=1",
    "details": "Fox Jaffna is a contemporary hotel located in the heart of Jaffna, Sri Lanka. Known for its blend of modern amenities and traditional Sri Lankan hospitality, Fox Jaffna offers a comfortable and stylish retreat for both leisure and business travelers. Situated in Jaffna, providing easy access to major attractions, shopping areas, and cultural sites like the Nallur Kandaswamy Kovil and Jaffna Fort.",
    "rooms": [
        {
          "image": ["https://files.elfsight.com/storage/6e7ecea3-fb01-45f4-a04c-d8257512324d/22d799b1-2e44-4ed7-8395-653be1e5776b.jpg",
                    "https://files.elfsight.com/storage/6e7ecea3-fb01-45f4-a04c-d8257512324d/72e6321b-af3d-4a0e-a011-90b944d95cf5.jpg",
                    "https://files.elfsight.com/storage/6e7ecea3-fb01-45f4-a04c-d8257512324d/6777fde8-2142-4193-ac40-c630c8a055fe.jpg",
                    "https://files.elfsight.com/storage/6e7ecea3-fb01-45f4-a04c-d8257512324d/3c1ae6ac-cb44-4429-8bf1-55272680424f.jpg"
          ],
          "description": "Offers a range of accommodations, including Standard Rooms, Superior Rooms, and Suites. An outdoor pool surrounded by sun loungers, ideal for relaxation. Fox Jaffna combines modern comfort with a touch of local culture, making it an ideal choice for travelers looking to explore the northern part of Sri Lanka. With its excellent amenities, convenient location, and commitment to quality service, guests can enjoy a memorable stay while experiencing the unique heritage and hospitality of Jaffna. Whether relaxing by the pool, enjoying local cuisine."
        }
      ]
   },


   {
    "id": 77,
    "name": "Jetwing Lake",
    "location": "Dambulla",
    "rating": 4.6,
    "image": "https://www.jetwinghotels.com/wp-content/uploads/2018/04/Jetwing-lake-offer-banner-desktop.jpg",
    "details": "Jetwing Lake Dambulla is a luxurious eco-friendly hotel situated near the famous Dambulla Cave Temple and the Sigiriya Rock Fortress, two UNESCO World Heritage Sites in Sri Lanka. Nestled amidst lush landscapes and serene water bodies, the hotel offers guests a unique blend of nature, culture, and comfort, making it an ideal base for exploring the cultural heart of Sri Lanka. The hotel is conveniently located close to major attractions such as Dambulla Cave Temple, Sigiriya Rock Fortress, and Minneriya National Park, making it ideal for cultural and wildlife excursions.",
    "rooms": [
        {
          "image": ["https://www.jetwinghotels.com/jetwinglake/wp-content/uploads/sites/8/2017/11/lake-Gallery3.jpg",
                    "https://www.jetwinghotels.com/jetwinglake/wp-content/uploads/sites/8/2018/03/Gallery-Room-1200X810-3.jpg",
                    "https://www.jetwinghotels.com/jetwinglake/wp-content/uploads/sites/8/2018/03/Gallery-Hotel-1200X810.jpg",
                    "https://www.jetwinghotels.com/jetwinglake/wp-content/uploads/sites/8/2024/02/JW-Lake-Suite-Img.jpg"
          ],
          "description": "Offers a variety of accommodations, including Deluxe Rooms, Family Rooms, and Suites. Jetwing Lake Dambulla offers a perfect combination of luxury and eco-friendliness in a stunning natural setting. With its excellent amenities, beautiful surroundings, and convenient access to cultural and historical sites, it provides an ideal base for travelers looking to explore the rich heritage of Sri Lanka. Whether lounging by the pool, indulging in delicious cuisine, or embarking on cultural adventures, guests will find a warm and welcoming atmosphere at Jetwing Lake Dambulla."
        }
      ]
   },

   {
    "id": 78,
    "name": "Trinco Blu by Cinnamon",
    "location": "Trincomalee",
    "rating": 4.5,
    "image": "https://www.bestoflanka.com/images/slider/recommended-stays-sri-lanka/stay-on-the-beach-sri-lanka/cinnamon_blue_trinco/01.jpg",
    "details": "Trinco Blu by Cinnamon is a stunning beachfront resort located in Trincomalee, on the northeast coast of Sri Lanka. Known for its pristine beaches, clear blue waters, and marine biodiversity, this resort offers a perfect mix of relaxation and adventure for both couples and families.",
    "rooms": [
        {
          "image": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/13/0b/a9/21/beach-chalet.jpg?w=700&h=-1&s=1",
                    "https://www.reddottours.com/uploads/Accommodation/trinco-blu-by-cinnamon/Trinco%20Blu%20by%20Cinnamon-gallery-pop-up%20(4).jpg",
                    "https://images.trvl-media.com/lodging/5000000/4040000/4031800/4031742/da04fdbb.jpg?impolicy=resizecrop&rw=575&rh=575&ra=fill",
                    "https://cf.bstatic.com/xdata/images/hotel/max1024x768/75411358.jpg?k=67f5d859fc86464825b976eb37d57faf440038117e6a5801b291626525a5735b&o=&hp=1"
          ],
          "description": "Trinco Blu by Cinnamon is a tropical paradise, perfect for beach lovers and adventure seekers. With its luxurious amenities, exciting marine activities, and close proximity to both cultural and natural attractions, this resort offers a memorable experience in Sri Lanka’s coastal gem, Trincomalee. Whether you're relaxing on the beach, indulging in fresh seafood, or exploring the underwater world, Trinco Blu provides a vibrant and relaxing atmosphere for all types of travelers."
        }
      ]
   },


   {
    "id": 79,
    "name": "Hikka Tranz by Cinnamon",
    "location": "Hikkaduwa",
    "rating": 4.5,
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/13/0b/a3/be/hotel-exterior.jpg?w=700&h=-1&s=1",
    "details": "Hikka Tranz by Cinnamon is a vibrant beachfront hotel located in Hikkaduwa, a popular coastal town on the southwestern coast of Sri Lanka. Known for its lively atmosphere, rich marine life, and stunning sunsets, this hotel is a part of the Cinnamon Hotels & Resorts chain, offering a unique blend of comfort, entertainment, and beachfront luxury. Situated right on Hikkaduwa Beach, one of Sri Lanka's most famous surfing and snorkeling destinations.",
    "rooms": [
        {
          "image": ["https://cf.bstatic.com/xdata/images/hotel/max1024x768/527821614.jpg?k=5a6d4da3759709643ceaee88289cb94d72914fbbe38387c0acd3fc302e6dca95&o=&hp=1",
                    "https://cf.bstatic.com/xdata/images/hotel/max1024x768/527821636.jpg?k=77979d8041fd879283282e4165d16891ad739a45d1ed919a56186142562293bc&o=&hp=1",
                    "https://content.tui.co.uk/adamtui/2023_4/6_9/bb0e8f64-bb17-4dbd-981f-afdc009a3391/ACC_059880_SRI_19_MAINRESTWebOriginalCompressed.jpg?i10c=img.resize(width:658);img.crop(width:658%2Cheight:370)",
                    "https://cf.bstatic.com/xdata/images/hotel/max1024x768/123170025.jpg?k=0ea02905c4b66ee1f3f522c046e9f030d99991bba9af0cb966567bdf154a9894&o=&hp=1"
          ],
          "description": "Direct access to the beach with golden sands, perfect for sunbathing, swimming, and water sports. The Hikkaduwa Coral Reef, located nearby, is a major attraction where guests can snorkel and observe colorful coral formations, sea turtles, and vibrant marine life. Hikka Tranz offers a variety of rooms, including superior rooms, deluxe rooms, and suites, all with sea-facing balconies or terraces. Rooms are designed in a modern, tropical style, featuring bright colors and large windows to capture the coastal atmosphere. An all-day dining restaurant offering a range of international and local Sri Lankan cuisine. An all-day dining restaurant offering a range of international and local Sri Lankan cuisine.Hikka Tranz by Cinnamon is perfect for travelers looking for a combination of beach relaxation, water sports, vibrant nightlife, and modern comfort in a laid-back, tropical setting."
        }
      ]
   },

   {
    "id": 80,
    "name": "Amethyst Resort, Passikudah",
    "location": "Passikudah",
    "rating": 4.3,
    "image": "https://q-xx.bstatic.com/xdata/images/hotel/max500/218246232.jpg?k=1cf5ec80dbc612142fe65cce0beb19e044963d035a3687731a631b08990f8aff&o=",
    "details": "Amethyst Resort, Passikudah is a serene beachfront property located in Passikudah, on the east coast of Sri Lanka. Known for its pristine beaches and shallow, calm waters, the resort offers a tranquil escape for travelers looking to unwind by the ocean while enjoying luxurious accommodations. Passikudah Beach is famous for its expansive bay and one of the longest shallow coastlines in the world, making it ideal for swimming and water activities.",
    "rooms": [
        {
          "image": ["https://images.trvl-media.com/lodging/10000000/9690000/9682500/9682449/871f7b51.jpg?impolicy=fcrop&w=1200&h=800&p=1&q=medium",
                    "https://cf.bstatic.com/xdata/images/hotel/max1024x768/218231328.jpg?k=4c06682b5a648801b46b832aadaeda7163ff9b02b08f3ed8592151e78b255bfb&o=&hp=1",
                    "https://cf.bstatic.com/xdata/images/hotel/max1024x768/218249602.jpg?k=79970ff2840625080559accf76df8ab1fa8953b685ee2c10ca03b97e702332ac&o=&hp=1",
                    "https://resortamethystpassikudah.lk-com.com/data/Photos/OriginalPhoto/9132/913256/913256233/photo-amethyst-resort-passikudah-15.JPEG"
          ],
          "description": "Situated right on the shores of Passikudah Bay, the resort offers direct beach access with crystal-clear waters and golden sands. The resort features chalet-style rooms nestled between a lagoon and the beach, offering guests the choice of staying in Lagoon View Chalets or Sea View Chalets. The main restaurant offering buffet and à la carte dining, with a focus on fresh seafood, Sri Lankan delicacies, and continental dishes. Amethyst Resort, Passikudah is perfect for travelers seeking a peaceful retreat in one of Sri Lanka's most beautiful coastal destinations. Whether you’re looking for relaxation, water sports, or exploring the local culture, the resort offers a blend of luxury and nature for a memorable vacation."
        }
      ]
   },


   {
    "id": 81,
    "name": "Yathra Houseboat by Jetwing",
    "location": "Bentota",
    "rating": 4.3,
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/158183227.jpg?k=f32b2c448a79087df70318a7f19d5327af6aa4df1b08c6956ca8a655f26d67ab&o=&hp=1",
    "details": "Yathra by Jetwing is a unique and luxurious houseboat experience located on the tranquil waters of the Bentota River in Sri Lanka. Unlike typical land-based accommodations, Yathra offers an intimate journey through the river’s scenic landscapes, allowing guests to relax and enjoy the beauty of nature in an eco-friendly and serene environment. The houseboat, operated by Jetwing Hotels, combines luxury, privacy, and an immersive experience with Sri Lanka’s lush river ecosystems.",
    "rooms": [
        {
          "image": ["https://q-xx.bstatic.com/xdata/images/hotel/max1024x768/250438212.jpg?k=3d7b02f138ee7bc2dbd135db03419b5c04c5478e4b63d93367d47d236c7f036f&o=&s=1024x",
                    "https://pix8.agoda.net/hotelImages/926599/-1/af82dc6b7928b52eb798c6cdcbae04b1.jpg?ca=10&ce=1&s=1024x",
                    "https://images.trvl-media.com/lodging/12000000/11480000/11474300/11474279/86fc5c43.jpg?impolicy=fcrop&w=1200&h=800&p=1&q=medium",
                    "https://pix8.agoda.net/hotelImages/926/926599/926599_15051813470027562949.jpg?ca=4&ce=1&s=1024x"
          ],
          "description": "The houseboat is docked along the Bentota River, a popular destination on Sri Lanka’s southwest coast known for its calm waters and scenic beauty. The journey on Yathra takes guests along the winding river, passing mangroves, small villages, and abundant wildlife. Yathra by Jetwing features just two luxury cabins, ensuring an intimate and exclusive experience. Each cabin is elegantly designed with traditional Sri Lankan decor and modern amenities. The design is inspired by Kerala houseboats, providing a cozy, comfortable atmosphere. Yathra by Jetwing is perfect for those seeking an intimate, luxury houseboat experience that combines the natural beauty of the Bentota River with the comfort and service of a high-end boutique hotel. Whether you're looking for a romantic escape or simply a serene retreat, Yathra offers a unique and unforgettable journey through one of Sri Lanka’s most beautiful rivers."
        }
      ]
   },


   {
    "id": 82,
    "name": "Sea Rock Villa",
    "location": "Bentota",
    "rating": 4.6,
    "image": "https://i.ytimg.com/vi/J02t0IFQsRI/hq720.jpg?sqp=-oaymwEhCK4FEIIDSFryq4qpAxMIARUAAAAAGAElAADIQj0AgKJD&rs=AOn4CLB0YQEbqW8CAHdpfxCQdt6AkpULow",
    "details": "Sea Rock Villa is a boutique beachfront hotel located along the stunning coastline of Induruwa, near Bentota, Sri Lanka. Known for its peaceful ambiance, personalized service, and intimate setting, the villa provides a relaxing escape from the busier tourist areas while offering luxurious accommodations and direct access to a quiet beach. It is ideal for couples, families, and travelers seeking a serene and private seaside retreat.",
    "rooms": [
        {
          "image": ["https://q-xx.bstatic.com/xdata/images/hotel/max1024x768/198630367.jpg?k=becfd7027cdb43d02133ef6738d4d618975be66e87c12a0d061335bb20f39c59&o=&s=1024x",
                    "https://q-xx.bstatic.com/xdata/images/hotel/max1024x768/198630213.jpg?k=99adf1b80d92af6bdc06bd59391642b0624ce0547b70c567e8013d16df6f7f66&o=&s=1024x",
                    "https://villasearockbentota.lk-com.com/data/Photos/OriginalPhoto/7995/799551/799551546/photo-sea-rock-villa-bentota-26.JPEG",
                    "https://sea-and-rock-villa.hotels-capetown.com/data/Imgs/OriginalPhoto/14288/1428874/1428874099/img-sea-and-rock-villa-cape-town-7.JPEG"
          ],
          "description": "Sea Rock Villa is a hidden gem on Sri Lanka’s southwest coast, offering a combination of luxury, privacy, and natural beauty. Whether you're looking to unwind by the pool, enjoy fresh seafood by the beach, or explore the cultural and natural attractions of the region, this boutique hotel provides a peaceful and memorable escape."
        }
      ]
   },

   {
    "id": 83,
    "name": "Jetwing Vil Uyana",
    "location": "Sigiriya",
    "rating": 4.7,
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0d/72/30/a1/exterior.jpg?w=700&h=-1&s=1",
    "details": "Jetwing Vil Uyana is an eco-luxury resort located near the Sigiriya Rock Fortress in Sri Lanka, renowned for its innovative blend of nature and sustainable architecture. Nestled in a man-made wetland environment, the resort is designed to immerse guests in a peaceful, natural setting, offering a unique opportunity to experience wildlife and serenity in the heart of Sri Lanka's Cultural Triangle. The resort is perfect for eco-conscious travelers, honeymooners, and those looking to explore the rich history and culture of the region while enjoying luxury and comfort.",
    "rooms": [
        {
          "image": ["https://www.jetwinghotels.com/jetwingviluyana/wp-content/uploads/sites/2/2017/10/accomodation-003.jpg",
                    "https://cf.bstatic.com/xdata/images/hotel/max1024x768/85000002.jpg?k=47f9254088bdcea8a4d103271d0278f1440492a827543e52e9f9d807ed8ea4b6&o=&hp=1",
                    "https://www.jetwinghotels.com/jetwingviluyana/wp-content/uploads/sites/2/2019/08/gallery-r-2.jpg",
                    "https://www.jetwinghotels.com/jetwingviluyana/wp-content/uploads/sites/2/2019/08/gallery-d-1.jpg"
          ],
          "description": "Jetwing Vil Uyana is located in Sigiriya, a UNESCO World Heritage Site in Sri Lanka's Cultural Triangle, roughly 5 kilometers from the famous Sigiriya Rock Fortress. It’s about a 4-hour drive from Colombo and Bandaranaike International Airport. Jetwing Vil Uyana is a standout eco-luxury resort that offers a unique blend of nature, culture, and comfort in Sri Lanka's Cultural Triangle. With its serene environment, focus on sustainability, and luxurious facilities, it provides an unforgettable experience for those seeking relaxation, adventure, and a deep connection with the natural world."
        }
      ]
   },

   {
    "id": 84,
    "name": "EKHO Sigiriya",
    "location": "Sigiriya",
    "rating": 4.2,
    "image": "https://www.ekhohotels.com/ekhosigiriya/wp-content/uploads/sites/6/2024/02/sigiriya-gallery-public-places-04.webp",
    "details": "EKHO Sigiriya is a charming boutique hotel located near the iconic Sigiriya Rock Fortress, a UNESCO World Heritage Site in Sri Lanka’s Cultural Triangle. Known for its convenient location and serene ambiance, the hotel offers modern amenities with a focus on comfort and relaxation, making it a perfect base for exploring the ancient cultural sites in the region. EKHO Sigiriya is well-suited for history enthusiasts, nature lovers, and travelers looking to immerse themselves in the natural and cultural beauty of Sri Lanka.",
    "rooms": [
        {
          "image": ["https://cf.bstatic.com/xdata/images/hotel/max1024x768/113159395.jpg?k=bef6e30a4d8414b4a22bf0892d1c30f424aef195bdcf031c8057c8d693ab9020&o=&hp=1",
                    "https://www.ekhohotels.com/ekhosigiriya/wp-content/uploads/sites/6/2024/02/sigiriya-gallery-public-places-08.webp",
                    "https://www.ekhohotels.com/ekhosigiriya/wp-content/uploads/sites/6/2024/02/ekho-sigiriya-gallery-room-06.webp",
                    "https://www.ekhohotels.com/ekhosigiriya/wp-content/uploads/sites/6/2024/02/sigiriya-gallery-dining-09.webp"
          ],
          "description": "EKHO Sigiriya is situated just a short distance (about 800 meters) from the Sigiriya Rock Fortress, one of Sri Lanka’s most famous landmarks. The hotel is roughly a 3.5 to 4-hour drive from Colombo and Bandaranaike International Airport, making it easily accessible for travelers. EKHO Sigiriya is an excellent choice for travelers looking for a comfortable and conveniently located hotel near one of Sri Lanka’s most iconic historical sites. With its blend of modern amenities, personalized service, and access to cultural and natural attractions, the hotel provides an ideal base for exploring the beauty and history of the Cultural Triangle. Whether you're climbing Sigiriya Rock, going on a wildlife safari, or simply relaxing by the pool, EKHO Sigiriya ensures a memorable and enriching experience."
        }
      ]
   },

   {
    "id": 85,
    "name": "Mirage Hotel Colombo",
    "location": "Colombo",
    "rating": 4.0,
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0f/1c/b4/f2/mirage-hotel-colombo.jpg?w=700&h=-1&s=1",
    "details": "The Mirage Hotel Colombo is a modern four-star hotel situated in the vibrant city of Colombo, Sri Lanka. Located on Marine Drive in Wellawatta, it offers stunning ocean views and a range of comfortable accommodations, including deluxe rooms and family suites, all equipped with private balconies",
    "rooms": [
        {
          "image": ["https://www.miragecolombo.com/images/mirage_images/gallery/first/001_mirage_deluxe_room_03.jpg",
                    "https://www.miragecolombo.com/images/mirage_images/gallery/first/001_mirage_deluxe_room_02.jpg",
                    "https://www.miragecolombo.com/images/mirage_images/gallery/first/mirage_pool_nn05.jpg",
                    "https://lillyland-beach-club-resort.hotel-hurghada.com/data/Pics/OriginalPhoto/13654/1365433/1365433316/mirage-bay-resort-aqua-park-hurghada-pic-29.JPEG"
          ],
          "description": "The hotel features a restaurant serving a variety of cuisines, including German, Italian, Chinese, and local Sri Lankan dishes. Guests can enjoy an outdoor swimming pool, a fitness center, and a bar. Additionally, the hotel offers free Wi-Fi, laundry services, and free parking. It's conveniently located about 1.4 miles from Dehiwala Zoo and approximately a 15-minute drive from Colombo City Center. Bandaranaike International Airport is about 21 miles away. The hotel is well-reviewed for its friendly staff and comfortable accommodations, often praised for its cleanliness and value for money. Couples particularly enjoy its location, rating it highly for romantic getaways​"
        }
      ]
   },


   {
    "id": 86,
    "name": "Shangri-La Colombo",
    "location": "Colombo",
    "rating": 4.6,
    "image": "https://architizer-prod.imgix.net/media/149280814184900.849.07.007a.jpg?w=1680&q=60&auto=format,compress&cs=strip",
    "details": "The Shangri-La Hotel in Colombo is a luxurious five-star establishment that offers a range of upscale amenities and accommodations. Opened in November 2017, it is located near the city's waterfront, providing stunning views of the Indian Ocean and Beira Lake​.",
    "rooms": [
        {
          "image": ["https://sitecore-cd-imgr.shangri-la.com/MediaFiles/B/E/9/%7BBE9B00F7-29DE-49E6-9545-2E147658C7AE%7DDeluxeConnectingroomSLCB1.jpg",
                    "https://www.reddottours.com/uploads/Accommodation/Shangri-La-Hotel-Colombo/Shangri---La-Hotel-header.jpg",
                    "https://www.srilankacolombohotels.com/data/Pics/OriginalPhoto/12237/1223759/1223759872/shangri-la-hotel-colombo-pic-92.JPEG",
                    "https://images.squarespace-cdn.com/content/v1/59899fa9f9a61eda9f9f0394/1528520602233-DIKDTGAE5SJH1M0URT4K/DSC04650_pixel+crop.jpg"
          ],
          "description": "A personal tropical sanctuary that is perfect for escaping the city, Shangri-La Colombo overlooks the Indian Ocean in the heart of the business district with direct access to the most extensive international shopping mall in Sri Lanka, Shangri-La’s own One Galle Face Mall. The hotel offers the finest accommodation in Colombo, an exciting new dining and social scene and the largest and extensive hotel conference and event facilities.​"
        }
      ]
   },


   {
    "id": 87,
    "name": "Hilton Colombo",
    "location": "Colombo",
    "rating": 4.6,
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/09/16/74/33/hilton-colombo.jpg?w=700&h=-1&s=1",
    "details": "The Hilton Colombo is one of the premier luxury hotels in Colombo, known for its prime location and exceptional amenities. Situated close to popular attractions like the Dutch Hospital Shopping Precinct and Galle Face Green, it provides easy access to both business and leisure destinations. The hotel offers a mix of modern and recently refurbished rooms with views of the Indian Ocean or the city.",
    "rooms": [
        {
          "image": ["https://www.hilton.com/im/en/COLHITW/20264579/kingdeluxeseaviewbedroom01.jpg?impolicy=crop&cw=5000&ch=3255&gravity=NorthWest&xposition=0&yposition=38&rw=768&rh=500",
                    "https://www.hilton.com/im/en/COLHITW/19317249/deluxe-rooms-bathrooms.jpg?impolicy=crop&cw=5000&ch=3255&gravity=NorthWest&xposition=0&yposition=38&rw=768&rh=500",
                    "https://www.hilton.com/im/en/COLHITW/19617923/suitelivingday02.jpg?impolicy=crop&cw=5000&ch=3255&gravity=NorthWest&xposition=0&yposition=38&rw=768&rh=500",
                    "https://www.hilton.com/im/en/COLHITW/21981978/ths-6212-hdr-1-.jpg?impolicy=crop&cw=4495&ch=2926&gravity=NorthWest&xposition=0&yposition=36&rw=768&rh=500"
          ],
          "description": "The facilities include a large outdoor pool, a fitness center, and multiple dining options such as the renowned Graze Kitchen, offering international buffets, and SunsetBlu, a rooftop bar with stunning views. Guests often praise the service, the hotel's well-maintained amenities, and the luxurious feel of the newly renovated rooms. The executive lounge is a highlight for business travelers, and the hotel also provides event and conference spaces.​"
        }
      ]
   },


   {
    "id": 88,
    "name": "Jetwing Colombo Seven",
    "location": "Colombo",
    "rating": 4.5,
    "image": "https://www.maga.lk/wp-content/uploads/2018/03/DSC_5150.jpg",
    "details": "Searched 4 sites Jetwing Colombo Seven is a luxurious 4-star hotel situated in the upscale Cinnamon Gardens area of Colombo, offering a perfect blend of comfort, style, and modern amenities. This hotel is highly praised for its rooftop infinity pool, which provides stunning views of the city skyline. The rooftop area also features a bar and restaurant, making it a great spot for relaxation or socializing.",
    "rooms": [
        {
          "image": ["https://www.jetwinghotels.com/jetwingcolomboseven/wp-content/uploads/sites/4/2019/08/Gallery1-2.jpg",
                    "https://www.jetwinghotels.com/jetwingcolomboseven/wp-content/uploads/sites/4/2019/08/Gallery1-6.jpg",
                    "https://www.jetwinghotels.com/jetwingcolomboseven/wp-content/uploads/sites/4/2019/10/DSC_3110-Edit-1200x810.jpg",
                    "https://www.jetwinghotels.com/jetwingcolomboseven/wp-content/uploads/sites/4/2019/10/DSC_3013-Edit-1200x810.jpg"
          ],
          "description": "The rooms at Jetwing Colombo Seven are designed with modern minimalism, offering spacious layouts and excellent amenities like free WiFi, flat-screen TVs, and tea/coffee-making facilities. Some rooms also include kitchenettes, which make longer stays convenient. The hotel is well-regarded for its cleanliness and the helpfulness of its staff.​"
        }
      ]
   },

   {
    "id": 89,
    "name": "Cinnamon Grand Hotel",
    "location": "Colombo",
    "rating": 4.7,
    "image": "https://d18slle4wlf9ku.cloudfront.net/www.cinnamonhotels.com-1302818674/cms/cache/v2/66bd61ab411ad.jpg/1920x1080/fit/80/e025f0c5fa81a93236d946f06d436f9c.jpg",
    "details": "Cinnamon Grand Colombo is a luxurious 5-star hotel located centrally in Colombo, offering high-end services and a wide variety of amenities for both leisure and business travelers.",
    "rooms": [
        {
          "image": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/14/e7/c4/34/premium-room.jpg?w=700&h=-1&s=1",
                    "https://d18slle4wlf9ku.cloudfront.net/www.cinnamonhotels.com-1302818674/cms/cache/v2/66ed32c112605.jpg/1920x1080/resize;c:704,0,4375,3669/80/8c0041d78cde038e40e30fe91d470369.jpg",
                    "https://d363suj4pdptk4.cloudfront.net/externalApps/b4327255-bda1-4003-b27c-e8196c8a5cc1/conversion/slide/assets/3122557",
                    "https://d18slle4wlf9ku.cloudfront.net/www.cinnamonhotels.com-1302818674/cms/cache/v2/66ed32c0846ed.jpg/1920x1080/resize;c:911,0,4582,3669/80/1bdd6c9b536ea1ffc5c23b53c823e7dc.jpg"
          ],
          "description": "Modern and spacious, with city or lake views, featuring complimentary Wi-Fi, flat-screen TVs, minibars, and tea/coffee-making facilities. Rooms come with premium bedding and 24-hour room service. Two outdoor pools, including a large family-friendly pool and a more private, tranquil pool area. The Cinnamon Grand Colombo stands out for its hospitality, dining options, and an extensive range of facilities.​"
        }
      ]
   },

   {
    "id": 90,
    "name": "Jie Jie Beach Hotel",
    "location": "Hikkaduwa",
    "rating": 4.1,
    "image": "https://images.trvl-media.com/lodging/16000000/15450000/15440600/15440520/81ed0d9d.jpg?impolicy=resizecrop&rw=575&rh=575&ra=fill",
    "details": "Jie Jie Beach Hotel is a beautiful beachfront property located in Hikkaduwa, a popular coastal town in Sri Lanka known for its vibrant marine life and stunning beaches. This hotel offers a relaxed atmosphere with a blend of modern comforts and traditional Sri Lankan hospitality, making it a great choice for travelers looking for a beachside getaway.",
    "rooms": [
        {
          "image": ["https://cf.bstatic.com/xdata/images/hotel/max1024x768/90655537.jpg?k=c4bd6fd77e06cf786d2e58b8fef799d2fcc7f594a884c7d1b799006649204ea0&o=&hp=1",
                    "https://cf.bstatic.com/xdata/images/hotel/max1024x768/90559784.jpg?k=7512e7a69ed2100cbef89f0c7aa0de7d74b066e17b377621cf34cdf8cce851c7&o=&hp=1",
                    "https://cf.bstatic.com/xdata/images/hotel/max1024x768/107385920.jpg?k=74da83959a79eb1a7679884cdf2a640a235a51e84fe5deab7e76f87d31329f05&o=&hp=1",
                    "https://cf.bstatic.com/xdata/images/hotel/max1024x768/101732390.jpg?k=740cefce74fb132bb27b4843a6e1d5f8db9ecde3b561763898a62ce1466a1a60&o=&hp=1"
          ],
          "description": "The hotel is situated directly on the sandy shores of Hikkaduwa Beach, offering guests immediate access to the ocean and beautiful views. Jie Jie Beach Hotel offers a variety of room options, including Standard Rooms, Deluxe Rooms, and Suites. Each room is designed for comfort and relaxation. The property has an outdoor swimming pool surrounded by sun loungers, providing a relaxing space for guests to unwind and soak up the sun. Jie Jie Beach Hotel provides a relaxing and enjoyable beachfront escape in Hikkaduwa, perfect for couples, families, and solo travelers alike. With comfortable accommodations, a range of amenities, and easy access to local attractions and activities, guests can immerse themselves in the beauty of Sri Lanka’s southern coast.​"
        }
      ]
   },

   {
    "id": 91,
    "name": "Dutch Wall Luxury Boutique Villa galle",
    "location": "Galle",
    "rating": 4.9,
    "image": "https://a0.muscache.com/im/pictures/hosting/Hosting-U3RheVN1cHBseUxpc3Rpbmc6MzQwMDU2OTI%3D/original/10adf3a9-d6c1-4ea2-bbba-347c1d9f8a15.jpeg?im_w=1200&im_format=avif",
    "details": "Dutch Wall Luxury Boutique Villa is a premium, boutique-style hotel located in the heart of the Galle Fort, a UNESCO World Heritage site in Sri Lanka. The villa offers a unique combination of historic charm, elegant interiors, and personalized service, making it an ideal destination for travelers seeking luxury, privacy, and a deep connection to the rich cultural heritage of Galle. Situated within the fortified walls of Galle Fort, the villa provides easy access to the fort’s attractions, including historic landmarks, art galleries, cafes, and shops. The villa is also just a short distance from Galle's famous beaches, such as Unawatuna Beach and Jungle Beach, allowing guests to enjoy both cultural exploration and coastal relaxation.",
    "rooms": [
        {
          "image": ["https://a0.muscache.com/im/pictures/hosting/Hosting-U3RheVN1cHBseUxpc3Rpbmc6MzQwMDU2OTI%3D/original/fa073562-d859-42ca-8bbe-2e888d880d2d.jpeg?im_w=1200&im_format=avif",
                    "https://a0.muscache.com/im/pictures/hosting/Hosting-U3RheVN1cHBseUxpc3Rpbmc6MzQwMDU2OTI%3D/original/fe4b1c73-7f6b-4fa0-b941-002caac61029.jpeg?im_w=1200&im_format=avif",
                    "https://a0.muscache.com/im/pictures/hosting/Hosting-U3RheVN1cHBseUxpc3Rpbmc6MzQwMDU2OTI%3D/original/7287214e-ba27-47bf-8a52-bf0450c79bcb.jpeg?im_w=960&im_format=avif",
                    "https://a0.muscache.com/im/pictures/hosting/Hosting-U3RheVN1cHBseUxpc3Rpbmc6MzQwMDU2OTI%3D/original/dd2409fa-680e-4f6c-8d6b-8490cad38d02.jpeg?im_w=1200&im_format=avif"
          ],
          "description": "spacious suites that reflect the villa’s colonial heritage with stylish decor and handpicked furnishings. Rooms feature views of either the historic Galle Fort or the villa’s inner courtyards. King-size bed with luxury linens, Air conditioning and ceiling fans, En-suite bathroom with rain shower and luxury toiletries, Free Wi-Fi, Smart TV, and mini-bar, Private balconies or verandas in select rooms.​"
        }
      ]
   },

   {
    "id": 92,
    "name": "Cinnamon Citadel Kandy",
    "location": "Kandy",
    "rating": 4.5,
    "image": "https://r1imghtlak.mmtcdn.com/f965161498a411eca8d50a58a9feac02.webp",
    "details": "Cinnamon Citadel Kandy is a four-star luxury hotel nestled on the banks of the Mahaweli River, just a short distance from the heart of Kandy, Sri Lanka's cultural capital. Known for its tranquil riverside location and stylish design, the hotel blends modern comforts with touches of traditional Sri Lankan architecture. Surrounded by lush greenery and misty hills, it offers guests a serene and relaxing environment while being close to Kandy’s main attractions. The hotel is located about 15 minutes away from Kandy’s city center, offering convenient access to key attractions such as the Temple of the Sacred Tooth Relic and the Kandy Lake. Its riverside setting provides a peaceful escape from the bustling city.",
    "rooms": [
        {
          "image": ["https://cf.bstatic.com/xdata/images/hotel/max1024x768/490888080.jpg?k=288a522eb7fa6d478b6dee7e8b0b64e67fd0583cfa4c3d8f323f0db0d2beffd9&o=&hp=1",
                    "https://nz.lakpura.com/cdn/shop/files/LK15003C24-03-E.jpg?v=1696849843&width=1445",
                    "https://q-xx.bstatic.com/xdata/images/hotel/max500/490888248.jpg?k=96fd4063f10fa2a8a02de0430583e16106e990cdb6124858b447d4b27fa969a1&o=",
                    "https://media-cdn.tripadvisor.com/media/photo-s/05/fe/3b/1d/cinnamon-citadel-kandy.jpg"
          ],
          "description": "Cinnamon Citadel Kandy offers a variety of rooms and suites, all designed for comfort with modern amenities and views of either the river or the surrounding gardens and mountains. These rooms are designed with modern interiors, featuring earthy tones and large windows that offer views of the lush gardens or the river. King-size or twin beds, Private balcony or terrace, Air conditioning, flat-screen TV, free Wi-Fi, En-suite bathroom with rain shower, Mini-bar, tea/coffee making facilities. Cinnamon Citadel Kandy provides a perfect blend of luxury, comfort, and scenic beauty, making it an ideal choice for travelers looking to experience both Kandy's rich cultural heritage and natural surroundings."
        }
      ]
   },

   {
    "id": 93,
    "name": "Jetwing Kandy Gallery",
    "location": "Kandy",
    "rating": 4.7,
    "image": "https://archives1.dailynews.lk/sites/default/files/news/2019/06/09/z_p24-JETWING.jpg",
    "details": "Jetwing Kandy Gallery is a luxury boutique hotel located near Kandy, Sri Lanka, offering a serene retreat with a focus on elegance, comfort, and a rich cultural experience. Situated along the Mahaweli River, it provides guests with tranquil surroundings and scenic views while being close to the historical and cultural attractions of the region. The hotel is located about 30 minutes from Kandy's city center, along the banks of the Mahaweli River, offering a peaceful escape while being near attractions such as the Temple of the Sacred Tooth Relic and Peradeniya Botanical Gardens.",
    "rooms": [
        {
          "image": ["https://www.jetwinghotels.com/jetwingkandygallery/wp-content/uploads/sites/39/2019/09/room-interior-3D-2-744x653.jpg",
                    "https://www.jetwinghotels.com/jetwingkandygallery/wp-content/uploads/sites/39/2019/11/bar-3D-768x432.jpg",
                    "https://q-xx.bstatic.com/xdata/images/hotel/max500/263024888.jpg?k=7644d58180d74c4d63e4d3bac4cbe7a2d35da8c32620c6203a1f3cf4ddb2c885&o=",
                    "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1c/da/a5/f9/img-20210412-wa0003-largejpg.jpg?w=1100&h=-1&s=1"
          ],
          "description": "Contemporary and spacious, these rooms feature modern décor with Kandyan-inspired touches. Large windows allow natural light to fill the space and offer views of the river or gardens. King-size or twin beds, Private balcony or terrace En-suite bathroom with rain shower and bathtub, Air conditioning, flat-screen TV, free , Wi-Fi, Mini-bar, tea/coffee making facilities"
        }
      ]
   },

   {
    "id": 94,
    "name": "W15Hanthana Estate",
    "location": "Kandy",
    "rating": 4.7,
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1b/56/6d/e6/w15-hanthana-estate-kandy.jpg?w=700&h=-1&s=1",
    "details": "W15 Hanthana Estate is a luxurious and tranquil boutique hotel located in the heart of Sri Lanka’s famous Hanthana Mountain Range, just outside of Kandy. The estate is an exclusive and serene retreat that combines modern luxury with the charm of a colonial tea estate. It offers stunning views of the surrounding mountains and lush greenery, providing an ideal setting for relaxation, privacy, and immersion in nature.",
    "rooms": [
        {
          "image": ["https://images.ctfassets.net/l5et9zo41v9n/3HHPHOKMDpflMWfyFQJEuE/e36c29224c945c81b79fb3ad45bdc129/Bungalow_Suite_03.jpg",
                    "https://cf.bstatic.com/xdata/images/hotel/max1024x768/423261528.jpg?k=949b17d1a73c2615c86efa54685de2f58df5e7941f080c9d676f40b390c04e2f&o=&hp=1",
                    "https://cf.bstatic.com/xdata/images/hotel/max1024x768/253193967.jpg?k=6a72eb5189a6d80e591caef0ece5975c589572dbf8e3536d49ae35ba154040af&o=&hp=1",
                    "https://q-xx.bstatic.com/xdata/images/hotel/max500/416979621.jpg?k=1449c25935a7ebffc750267d50b63fa3c0e6c09597bab2a51c3f595359325e6a&o="
          ],
          "description": "The rooms and suites at W15 Hanthana Estate are spacious and elegantly designed with a mix of antique furniture and modern amenities. Each room is individually styled and features high ceilings, large windows, and private balconies or verandas. King-size or twin beds with premium bedding, En-suite bathrooms with rain showers and bathtubs, Air conditioning and ceiling fans, Flat-screen TVs, Wi-Fi, and Bluetooth speakers. Tea and coffee-making facilities with a selection of local teas Personalized butler service for a tailored experience. W15 Hanthana Estate is a luxurious, peaceful, and eco-conscious retreat set in one of Sri Lanka’s most beautiful mountain regions. Its perfect blend of colonial elegance, modern comfort, and natural beauty makes it an ideal destination for travelers seeking a unique and serene getaway."
        }
      ]
   },


   {
    "id": 95,
    "name": "W15 Ahangama Escape",
    "location": "Ahangama",
    "rating": 3.6,
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/88950725.jpg?k=0a1dbda79876e0d4870d3f10b729e88b20f21b0e4405d82fba7844b75f8bef68&o=&hp=1",
    "details": "W15 Ahangama Escape is a luxury boutique hotel located in the serene coastal town of Ahangama, on Sri Lanka’s southern coast. Known for its peaceful setting, lush surroundings, and proximity to some of the best surf spots in the region, W15 Ahangama Escape offers a perfect retreat for those seeking relaxation, surfing, and upscale amenities. W15 Ahangama Escape is nestled in a tranquil spot on Sri Lanka’s southern coast, surrounded by lush vegetation and offering direct access to the beach. It’s an ideal spot for those looking to escape the crowds and enjoy the natural beauty of the area.",
    "rooms": [
        {
          "image": ["https://cf.bstatic.com/xdata/images/hotel/max1024x768/88943010.jpg?k=130efe5c1c579beeca9540130f8c60806f0183b9cec1a8b1802218ba6127828f&o=&hp=1",
                    "https://cf.bstatic.com/xdata/images/hotel/max1024x768/88950730.jpg?k=b2abe2529c78d6c4f4ec9272ab772d7a75a8fafc60a79c96aab573aa26331124&o=&hp=1",
                    "https://cf.bstatic.com/xdata/images/hotel/max1024x768/88942105.jpg?k=6d80dbaa617f6936e6c9b845fb7fd05c8c143b448b7ddea179472e585b3726db&o=&hp=1",
                    "https://images.trvl-media.com/lodging/10000000/9850000/9847600/9847508/1f3deb2a.jpg?impolicy=resizecrop&rw=575&rh=575&ra=fill"
          ],
          "description": "W15 Ahangama Escape offers luxurious, private villas and suites designed to blend seamlessly with the natural surroundings. The architecture features a combination of modern design with rustic elements to create an elegant, laid-back vibe. The hotel offers a variety of luxury suites and villas, including garden view rooms and oceanfront villas. These accommodations are spacious, offering privacy and tranquility, with modern amenities and stylish interiors. W15 Ahangama Escape boasts a beautiful infinity pool, offering panoramic views of the ocean. The pool area is surrounded by sun loungers and lush greenery, creating a relaxing environment for guests to unwind. W15 Ahangama Escape offers a luxurious yet tranquil experience for guests looking to relax by the beach, surf the famous waves of Ahangama, or explore the southern coast of Sri Lanka."
        }
      ]
   },


   {
    "id": 96,
    "name": "Hotel J",
    "location": "Unawatuna",
    "rating": 4.2,
    "image": "https://hotelj.wpenginepowered.com/unawatuna/wp-content/uploads/sites/4/nggallery/unawatuna/una-gallery-2.jpg",
    "details": "Hotel J Unawatuna is a charming beachfront hotel located in Unawatuna, a popular coastal town in Sri Lanka, known for its stunning beaches and vibrant marine life. Hotel J offers a blend of comfort and relaxation, making it an ideal destination for travelers seeking a laid-back beach holiday. Hotel J is situated right on Unawatuna Beach, offering guests easy access to the golden sands and clear waters of the Indian Ocean. The hotel is conveniently located near popular attractions, including the historic Galle Fort, Japanese Peace Pagoda, and various diving spots.",
    "rooms": [
        {
          "image": ["https://hotelj.wpenginepowered.com/unawatuna/wp-content/uploads/sites/4/nggallery/unawatuna/una-gallery-6.jpg",
                    "https://hotelj.wpenginepowered.com/unawatuna/wp-content/uploads/sites/4/nggallery/unawatuna/una-gallery-7.jpg",
                    "https://hotelj.wpenginepowered.com/unawatuna/wp-content/uploads/sites/4/nggallery/unawatuna/una-gallery-3.jpg",
                    "https://www.hotelscombined.com/himg/b7/32/a4/expedia_group-3345848-08c5ea-448117.jpg"
          ],
          "description": "The hotel features a variety of comfortable rooms designed with a mix of modern and traditional Sri Lankan décor. Options include Standard Rooms, Deluxe Rooms, and Family Rooms. Some rooms offer stunning ocean views or direct access to the beach. Each room is equipped with air conditioning, free Wi-Fi, a flat-screen TV, a minibar, tea/coffee-making facilities, and an en-suite bathroom with hot water. Hotel J features a spacious outdoor swimming pool, surrounded by sun loungers and tropical landscaping, providing a perfect place to relax and unwind. Hotel J Unawatuna provides a relaxing beachside escape with comfortable accommodations and a variety of amenities. Its prime location on Unawatuna Beach, combined with a range of activities and dining options, makes it an attractive destination for families, couples, and solo travelers alike."
        }
      ]
   },

   {
    "id": 97,
    "name": "Kottukal Beach House by Jetwing",
    "location": "Pottuvil",
    "rating": 4.3,
    "image": "https://x.cdrst.com/foto/hotel-sf/656f1/granderesp/kottukal-beach-house-by-jetwing-habitacion-d014ce2.jpg",
    "details": "Kottukal Beach House by Jetwing is a charming and intimate boutique hotel located on the pristine beaches of Kottukal, along the southwestern coast of Sri Lanka. Surrounded by lush tropical gardens and offering direct access to the beach, this property provides a perfect blend of natural beauty, comfort, and personalized service. It is ideal for travelers seeking a tranquil getaway by the sea, away from the hustle and bustle of larger resorts.",
    "rooms": [
        {
          "image": ["https://www.jetwinghotels.com/kottukalbeachhouse/wp-content/uploads/sites/9/2017/11/DSC_1227_4813x3213.jpg",
                    "https://www.jetwinghotels.com/kottukalbeachhouse/wp-content/uploads/sites/9/2017/11/DSC_4098.jpg",
                    "https://www.jetwinghotels.com/kottukalbeachhouse/wp-content/uploads/sites/9/2017/11/DSC_4313.jpg",
                    "https://www.jetwinghotels.com/kottukalbeachhouse/wp-content/uploads/sites/9/2017/11/DSC_4363.jpg"
          ],
          "description": "The hotel is located right on the sandy shores of Kottukal Beach, providing stunning views of the Indian Ocean and easy access to the beach. Kottukal Beach House offers a variety of accommodations, including Deluxe Rooms, Superior Rooms, and Family Rooms. Each room is designed for comfort and relaxation, featuring modern decor with a touch of local charm."
        }
      ]
   },

   {
    "id": 98,
    "name": "Jetwing Mahesa Bhawan",
    "location": "Anuradhapura",
    "rating": 4.9,
    "image": "https://www.jetwinghotels.com/jetwingmahesabhawan/wp-content/uploads/sites/42/2022/05/Hotel-Images-8.jpg",
    "details": "Jetwing Mahesa Bhawan is a serene and luxurious hotel located in Anuradhapura, Sri Lanka, set amidst beautiful gardens and rich historical surroundings. This property is known for its focus on sustainability, local culture, and the traditional Sri Lankan way of life, making it an ideal retreat for travelers looking to explore the ancient city of Anuradhapura while enjoying modern comforts. Situated near historical sites, including the Sacred City of Anuradhapura, a UNESCO World Heritage Site, allowing guests to explore ancient temples, stupas, and other cultural landmarks. The hotel is set in a peaceful environment surrounded by nature, offering a tranquil escape.",
    "rooms": [
        {
          "image": ["https://www.jetwinghotels.com/jetwingmahesabhawan/wp-content/uploads/sites/42/2022/05/Room-Images-2.jpg",
                    "https://www.jetwinghotels.com/jetwingmahesabhawan/wp-content/uploads/sites/42/2022/05/Room-Images-7.jpg",
                    "https://www.jetwinghotels.com/jetwingmahesabhawan/wp-content/uploads/sites/42/2022/05/Hotel-Images-7.jpg",
                    "https://www.jetwinghotels.com/jetwingmahesabhawan/wp-content/uploads/sites/42/2022/05/Dining-Images-5.jpg"
          ],
          "description": "The hotel features a range of accommodations, including Deluxe Rooms and Suites. The hotel has a restaurant that offers a diverse menu featuring local and international cuisine, emphasizing fresh, locally sourced ingredients and traditional Sri Lankan flavors. Jetwing Mahesa Bhawan provides a unique blend of luxury and cultural immersion in the heart of Anuradhapura. With its modern amenities, excellent dining options, and easy access to historical sites, guests can enjoy a relaxing stay while exploring the rich heritage of one of Sri Lanka’s ancient cities. Whether lounging by the pool, indulging in local cuisine, or discovering the area's history, visitors will find a welcoming and enriching experience at Jetwing Mahesa Bhawan."
        }
      ]
   },


   {
    "id": 99,
    "name": "Cinnamon Lodge Habarana",
    "location": "Habarana",
    "rating": 4.7,
    "image": "https://www.reddottours.com/uploads/Accommodation/cinnamon-lodge/Cinnamon-Lodge-header.jpg",
    "details": "Cinnamon Lodge Habarana is a luxurious eco-friendly resort located in Habarana, in the heart of Sri Lanka’s Cultural Triangle. Surrounded by lush greenery, the hotel offers a serene escape for nature lovers and is an excellent base for exploring nearby historical sites like Sigiriya, Dambulla, and Polonnaruwa. The resort emphasizes sustainability and blends luxury with a commitment to preserving the environment.",
    "rooms": [
        {
          "image": ["https://www.momondo.com/rimg/himg/9c/2e/26/expedia_group-202838-1a963d46-964013.jpg?width=968&height=607&crop=true",
                    "https://q-xx.bstatic.com/xdata/images/hotel/max500/579561867.jpg?k=d5c0b6eaf43a9d6f7040297b360bf62822c417122285d487fe2559f96c371b77&o=",
                    "https://images.trvl-media.com/lodging/2000000/1860000/1854500/1854476/e0ef7d57.jpg?impolicy=resizecrop&rw=575&rh=575&ra=fill",
                    "https://il.bestattravel.co.uk/Images/Cropped/IND-SriLanka-Habarana-CinnamonLodge%2CHabarana-705160-EhalaRestaurant-2-CinnamonLodgeHabarana(6).jpg"
          ],
          "description": "Cinnamon Lodge Habarana is an eco-luxury retreat that provides guests with an immersive experience of Sri Lanka's rich natural beauty and cultural heritage. With its luxurious accommodations, excellent dining options, and close proximity to the island’s most iconic historical sites, it is the perfect destination for both leisure and adventure travelers. Whether you're exploring the Cultural Triangle, going on a safari, or simply relaxing by the pool, Cinnamon Lodge offers an unforgettable stay surrounded by nature."
        }
      ]
   },

   {
    "id": 100,
    "name": "Lavendish Wild Safari",
    "location": "Wasgamuwa",
    "rating": 4.1,
    "image": "https://dayouting.lk/img_uploads/uploads/4729681685645705min.jpg",
    "details": "Lavendish Wild is set amidst the lush expanses of Wasgamuwa overlooking the majestic Knuckles Mountain Range and Dunuwila Wewa. 27-star classrooms, a restaurant and pool sit in perfect unison on 3.5 acres of beautifully landscaped garden. The hotel is a haven for the wildlife enthusiast and a gateway to a number of breath-taking attractions in the surrounding area.",
    "rooms": [
        {
          "image": ["https://cf.bstatic.com/xdata/images/hotel/max1024x768/176667003.jpg?k=2044e4a1ac1ad3d7a66ab69a6b5294f0e78a92da360469b260ed2f10a8cd148c&o=&hp=1",
                    "https://lavendishleisure.xyz/wp-content/uploads/2022/03/WS-AcommodationVilla-003-p-1080.jpeg",
                    "https://static.readytotrip.com/upload/information_system_24/1/5/3/item_1533788/photo_92133786.jpg",
                    "https://lavendish-wild-safari-wasgamuwa.booked.net/data/Photos/OriginalPhoto/9572/957200/957200491/Lavendish-Wild-Safari-Hotel-Wasgamuwa-Exterior.JPEG"
          ],
          "description": "Dip your toes into crystal clear waters in our hotel-centered pool and enjoy the calm serenity of nature under the shade of lush green trees. Enjoy an evening drink at the lounge bar or have a bit of fun with our pool table."
        }
      ]
   },


   {
    "id": 101,
    "name": "Lavendish Wild Wilpattu",
    "location": "Wilpattu",
    "rating": 4.1,
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/496262392.jpg?k=8fd8a5b9e0fe139af66011fcefd92bac2165ec8fa409d982a0d615d4c9ec7806&o=&hp=1",
    "details": "Immersed in nature, Wild Wilpattu hosts a selection of deluxe rooms that surrounds a peaceful paddy field. Within close proximity to Wilpattu National Park and hosting an array of excursions, the hotel stands as the ideal holiday escape.",
    "rooms": [
        {
          "image": ["https://cf.bstatic.com/xdata/images/hotel/max1024x768/557670340.jpg?k=9e6c9f73390f518771f7bd21a4803cbbccb2547f912c1c50143c598e80a467e5&o=&hp=1",
                    "https://cf.bstatic.com/xdata/images/hotel/max1024x768/557670357.jpg?k=ef28c7e39ea6ed4b26b8cfbbd2203c5282914db88dc0f5582404cfafbb54a411&o=&hp=1",
                    "https://images.trvl-media.com/lodging/110000000/109330000/109326600/109326577/554facdb.jpg?impolicy=resizecrop&rw=575&rh=575&ra=fill",
                    "https://lavendishleisure.xyz/wp-content/uploads/2022/03/DSC09681.jpeg"
          ],
          "description": "Enjoy your next gateway right at your fingertips via website. Your Booking through our official website is fast, seamless and secure. Click on the link below to make your booking today."
        }
      ]
   },


   {
    "id": 102,
    "name": "Lavendish Country Resort",
    "location": "Dambulla",
    "rating": 4.1,
    "image": "https://lavendishleisure.xyz/wp-content/uploads/2024/12/DSC02035-HDR-scaled.jpg",
    "details": "Finding an ideal small hotel in Dambulla does not have to be difficult. Welcome to Lavendish Country Resort, a nice option for travelers like you. Guest rooms offer air conditioning, and Lavendish Country Resort makes getting online easy as free wifi is available. You can also take advantage of some of the amenities offered by the small hotel, including room service. In addition, guests can enjoy a pool and an on-site restaurant during their visit.",
    "rooms": [
        {
          "image": ["https://cf.bstatic.com/xdata/images/hotel/max1024x768/557825222.jpg?k=78db2c4b1d75e436cc700f8e7cf02d47707bb0f65ebbfbc86789f8cf03d643f2&o=&hp=1",
                    "https://cf.bstatic.com/xdata/images/hotel/max1024x768/557825266.jpg?k=b8e35c2e04e5c8b4e04556240d12dc146c15b7f290273ff4a6dd6dc73a3153ba&o=&hp=1",
                    "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/14/79/37/f4/lavendish-wild-safari.jpg?w=700&h=-1&s=1",
                    "https://q-xx.bstatic.com/xdata/images/hotel/max500/621181243.jpg?k=4c51b6a0469dd8fc348fe314f0fcf62a670853787c01300a040b79c74cbe73f8&o="
          ],
          "description": "Dip your toes into crystal clear waters in our hotel-centered pool and enjoy the calm serenity of nature under the shade of lush green trees. Enjoy an evening drink or have a bit of fun with our pool table. The world’s largest rock cave temple, at Dambulla, is one of Sri Lanka’s most important religious sites. Its Buddha-filled interior is a highlight; it’s an experience you won't want to miss."
        }
      ]
   },


   {
    "id": 103,
    "name": "Lavendish Okrin Kataragama",
    "location": "Kataragama",
    "rating": 4.1,
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/262412137.jpg?k=cdc404dd1df3105ec0fe636738be4f25dccbecf55247513ece98da77e49339ff&o=&hp=1",
    "details": "Nested in the lower southern corner of the island, bordering ‘Wedihiti Kanda’ and ‘Detagamuwa Tank,’ Lavendish OKRIN has a very unique view of the environment and surroundings. For several years now, Lavendish Okrin Kataragama has been ranked number 2 by ‘Trip Advisor’ in hotels within Kataragama and has been awarded the Trip Advisor Certificate of Excellence on multiple occasions.",
    "rooms": [
        {
          "image": ["https://cf.bstatic.com/xdata/images/hotel/max1024x768/262412132.jpg?k=69e0b5586074e959b1bd7f9b9a4cd5e905913dec514aba2b5ca0d8ccef02e154&o=&hp=1",
                    "https://lavendishleisure.xyz/wp-content/uploads/2022/03/okrin__gallers__top__05-min-p-1600.jpeg",
                    "https://cf.bstatic.com/xdata/images/hotel/max1024x768/25236031.jpg?k=da7347c00f1328a03f68c22b86e2120ce14d51003ca6b3755e991512e4474991&o=&hp=1",
                    "https://lavendishleisure.xyz/wp-content/uploads/2024/07/Swimming-Pool-7-1-scaled.jpg"
          ],
          "description": "Open for both adults and supervised kids, take a swim in our pool and experience some refreshing drinks at our bar which also holds a lounge and pool table. With selections from both Sri Lankan and Western cuisines, kick start your morning with a delicious, wholesome cooked-to-order breakfast from our full-service restaurant. Or step outside to enjoy some high tea in our garden and pool area, with Kataragama Lake in the distance."
        }
      ]
   },


   {
    "id": 104,
    "name": "Jaffna Heritage Hotel",
    "location": "Jaffna",
    "rating": 4.4,
    "image": "https://www.attractionsinsrilanka.com/wp-content/uploads/2020/05/Jaffna-Heritage-Hotel-1.jpg",
    "details": "Jaffna Heritage is not just about just a hotel. We are always attentive about your holiday and try our hardest to make it memorable. Our friendly staff always care for you with all high standards. We provide you with the best authentic healthier cuisine experiences that make you have again.",
    "rooms": [
        {
          "image": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2c/0d/c6/fc/heritage-double-room.jpg?w=700&h=-1&s=1",
                    "https://images.trvl-media.com/lodging/15000000/14890000/14884600/14884560/49247e08.jpg?impolicy=resizecrop&rw=575&rh=575&ra=fill",
                    "https://images.trvl-media.com/lodging/14000000/13240000/13233400/13233398/5ddd3b39.jpg?impolicy=resizecrop&rw=575&rh=575&ra=fill",
                    "https://images.trvl-media.com/lodging/2000000/1680000/1678800/1678796/228e9322.jpg?impolicy=resizecrop&rw=575&rh=575&ra=fill"
          ],
          "description": "Jaffna Heritage Hotel is just 601 m away from Nallur Kandaswamy Temple in Jaffna. Featuring a 24-hour front desk, this 4-star hotel has a garden, a terrace and free private parking. The accommodations include free WiFi, an outdoor swimming pool, room service, a shared lounge and a restaurant. The hotel provides you with the facility of currency exchange for guests."
        }
      ]
   }
  ]
